import React from 'react';
import { PropTypes } from 'prop-types';

const Page2 = ({ agencyContract }) => {
  if (!agencyContract) return null;

  return (
    <div className="contract-page page-1">
      <div className="text-justify leading-relaxed text-[23px]">
        
      <p className="mb-3 pr-4 text-[23px]">
          <span className="font-bold text-[23px]">21) دوره اجرای طرح: </span>
          منظور مدت زمانی است که متقاضی نسبت به اجرای کسب‌وکار طرح اقدام می‌نماید. این مدت از اولین
          روز کاری پس از تاریخ موفقیت طرح در جذب سرمایه شروع می‌شود و درهرحال بیش‌تر از «18 ماه» پس
          از آن مقطع نخواهد بود. در پایان دوره اجرای طرح، پس از وصول و بر اساس گزارش تسویه طرح نسبت
          به تسویه حساب ذینفعان آن اقدام می‌شود.
        </p>
        <p className="mb-3 pr-4 text-[23px]">
          <span className="font-bold text-[23px]">22) گزارش تسویه: </span>
          منظور گزارشی است که حسب مورد و طبق سازوکارهای شرکت فرابورس ایران (یا کارگروه ارزیابی)، به
          ترتیب اولویت از سوی فرابورس یا کارگروه ارزیابی (در مواردی که فرابورس یا کارگروه ارزیابی در
          پایان دوره اجرای طرح ظرف مدت «1 ماه» در مورد وضعیت آن اعلام نظر ننمایند و یا نتوانند اعلام
          نظر نمایند مشروط به مهر و امضای آن توسط نهاد مالی) در خصوص وضعیت موفقیت و شکست طرح، میزان
          سود و یا زیان وارده تنظیم و تأیید می‌گردد.
        </p>
        <h3 className="font-bold mb-2 text-[23px]">ماده 3)موضوع فعالیت </h3>

        <p className="mb-3 pr-4 text-[23px]">
          <span className="font-bold text-[23px]">1) </span>
          ارائه‌ خدمات مشاوره تأمین‌ مالی‌ به‌ متقاضی‌ از طریق‌ طراحی‌ شیوة تأمین‌ مالی‌ و تهیه‌
          گزارش مورد نیاز جهت‌ انتشار گواهی‌هاي شراکت‌ تأمین‌ مالی‌ جمعی‌ توسط‌ عامل برای طرح{' '}
          <strong>{agencyContract?.investor_request?.suggestion_plan_name}</strong>
        </p>

        <p className="mb-3 pr-4 text-[23px]">
          <span className="font-bold text-[23px]">2) </span>
          ارائه خدمات بازاریابی به متقاضی از طریق طراحی و اجرای کمپین های بازاریابی به منظور فروش
          گواهی های شراکت به عموم.
        </p>

        <p className="mb-3 pr-4 text-[23px]">
          <span className="font-bold text-[23px]">3) </span>
          ارائه‌ خدمات عاملیت‌ و انجام مراحل‌ قانونی‌ اخذ مجوزهاي لازم از شرکت‌ فرابورس ایران جهت‌
          انتشار گواهی‌هاي شراکت‌ تأمین‌ مالی‌ جمعی‌ مطابق‌ با شرایط‌ مندرج در جدول ماده ٥ این‌
          قرارداد. به میزان{' '}
          <strong>
            {(
              (agencyContract?.investor_request?.amount_of_investment || 0) / 1000
            ).toLocaleString()}{' '}
            گواهی شراکت.
          </strong>
        </p>

        <p className="mb-3 pr-4 text-[23px]">
          <span className="font-bold text-[23px]">4) </span>
          ارائۀ خدمات بازارسازی به متقاضی از طریق طراحی و برنامه‌ریزی کمپین‌های تبلیغاتی به منظور
          فروش گواهی‌های شراکت به اشخاص حقیقی و حقوقی
        </p>
        <br />

        <p className="mb-3 pr-4 text-[23px]">
          <span className="font-bold text-[23px]">تبصره 1: </span>
          متقاضی متعهد است( ٪۱۰ده درصد ) بر اساس دستورالعمل تأمین مالی جمعی از مبلغ سرمایه مورد نیاز
          خود را رأسا به عنوان آورده سهم خود پرداخت و به حساب معرفی شده از سوی سکو واریز نماید
          نماید. این پرداخت در صورت خاتمه زمان تأمین مالی و جمع آوری کل مبلغ سرمایه مورد نیاز یا
          حداقل منابع مالی جمع آوری شده و یا عدم موفقیت طرح در جذب سرمایه، به وی مسترد می گردد.
          درصورتی که در انتهای مدت نمایش طرح جهت تأمین مالی جمعی، متقاضی موفق به جمع آوری کل مبلغ
          سرمایه مورد نیاز یا حداقل منابع مالی جمع آوری شده طبق این قرارداد شود، میزان مبلغ موضوع
          این بند، همزمان با پرداخت سرمایه تأمین شده و بر اساس دستورالعمل مربوط در اختیار متقاضی
          قرار خواهد گرفت. درهرصورت متقاضی متعهد است این مبلغ را در راستای طرح هزینه نماید. شرایط و
          نحوه هزینه کرد این مبلغ می بایست بر اساس جزئیات طرح و تحت نظارت عامل و سکو براساس اختیارات
          دستورالعمل تأمین مالی جمعی در این قرارداد صورت گیرد.
        </p>

        <p className="mb-3 pr-4 text-[23px]">
          <span className="font-bold text-[23px]">تبصره 2: </span>
          پرداخت مبلغ مندرج در بند فوق به حسابی که توسط عامل به اطلاع متقاضی می رسد، صورت خواهد
          گرفت.
        </p>

        <p className="mb-3 pr-4 text-[23px]">
          <span className="font-bold text-[23px]">تبصره 3: </span>
          در انتهای دوره طرح متقاضی ، نقدی سازی دارائی هایی که در طرح خریداری یا تولید شده اند ،
          انجام شده و مبالغ تحصیل شده به عنوان درآمدهای پروژه محاسبه می گردد. درصورتی که کارگروه
          ارزیابی، شیوه ی نقدی سازی را مشمول تخلف نقدی سازی اعلام کند، متقاضی مسئول جبران کلیه ی
          خسارت های وارده به عامل ، نهاد مالی و تأمین کنندگان خواهد بود.
        </p>

        <p className="mb-3 pr-4 text-[23px]">
          <span className="font-bold text-[23px]">تبصره 4: </span>
          درصورتیکه منابع مالی جمع آوری شده، از حداقل منابع مالی جمع آوری شده طبق این قرارداد کم تر
          باشد، در این صورت فرض می گردد که طرح نتوانسته منابع مالی و سرمایه مورد نیاز خود را از طریق
          تأمین مالی جمعی تأمین کند و منابع مالی جمع آوری شده از تأمین کنندگان ظرف مهلت ۵ روز کاری
          از تاریخ خاتمه مهلت فراخوان تأمین مالی جمعی به ایشان مسترد می شود. درصورتی که منابع مالی
          جمع آوری شده، برابر مبلغ حداقل منابع مالی جمع آوری شده تا سقف کل مبلغ سرمایه مورد نیاز
          متقاضی طبق این قرارداد باشد، مبالغ پرداختی تأمین کننده (تأمین کنندگان ) بنا بر تأیید عامل
          در راستای تأمین مالی جمعی طبق این قرارداد مورداستفاده قرار خواهد گرفت.
        </p>

        <p className="mb-3 pr-4 text-[23px]">
          <span className="font-bold text-[23px]">تبصره 5: </span>
          پس از موفقیت طرح در جذب سرمایه و طی فرایندهای اداری و قانونی مربوطه، «گواهی شراکت» توسط
          شرکت فرابورس ایران برای تأمین کنندگان و متناسب با میزان مشارکت هر کدام از آنها صادر می
          گردد.
        </p>

        <p className="mb-3 pr-4 text-[23px]">
          <span className="font-bold text-[23px]">تبصره 6: </span>
          عامل، نماینده تأمین کنندگان و نهاد مالی است. متقاضی و تأمین کنندگان و نهاد مالی ضمن عقد
          خارج لازم به صورت غیرقابل رجوع به عامل به عنوان نماینده اجازه و حق دادند که هرگونه مطالبات
          ناشی از این قرارداد اعم از اصل و سود محقق شده سرمایه گذاری، وصول خسارات و جریمه های
          احتمالی و هزینه های فسخ قرارداد را پس از سررسید یا انحلال این قرارداد و فقط در صورت عدم
          پرداخت متقاضی، از وثایق و تضامین متقاضی نزد عامل و یا از طریق اعطای وکالت بدون هیچ قید و
          شرطی و بدون نیاز به حکم قضایی یا اجرایی برداشت نموده و به حساب بدهی متقاضی منظور نماید.
          اقدام عامل در این خصوص برای متقاضی غیرقابل اعتراض و لازم الاجرا است . همچنین تأمین کنندگان
          ضمن عقد خارج لازم هرگونه اقدام تا زمان پایان طرح در خصوص موضوع قرارداد را از خود سلب و
          ساقط نمودند و کلیه اختیارات دراین خصوص را به عامل و کارگزار عامل واگذار کردند.
        </p>

        <p className="mb-3 pr-4 text-[23px]">
          <span className="font-bold text-[23px]">ماده 4(کارمزد موضوع قرارداد)</span>
          <br />
        </p>

        <p className="mb-2">
          كارمزد ارائة خدمات موضوع ماده ٣ ( موضوعات 1و2و3) اين قرارداد توسط عامل، جمعا{' '}
          <strong>
            {(
              Number(agencyContract.investor_request.design_wage / 1000000 || 0) +
              Number(agencyContract.investor_request.company_certificate_wage / 1000000 || 0) +
              Number(agencyContract.investor_request.execution_wage / 1000000 || 0)
            ).toLocaleString()}{' '}
            میلیون ریال{' '}
          </strong>
          و علاوه بر آن كارمزد شركت فرابورس{' '}
          <strong>
            {Number(agencyContract.investor_request.farabours_wage / 1000000 || 0).toLocaleString()}{' '}
            میلیون ریال{' '}
          </strong>
          مي باشد و همچنین کارمزد موضوع 4 ماده 3 این قرارداد{' '}
          <strong>
            {Number(agencyContract.investor_request.marketing_wage / 1000000 || 0).toLocaleString()}{' '}
            میلیون ریال{' '}
          </strong>
          كه به تفكيك زير، توسط متقاضي در وجه عامل و شركت فرابورس ايران پرداخت ميگردد:
        </p>

        <p className="mb-3 pr-4">
          <span className="font-bold">1) </span>
          کارمزد طراحی شیوه تامین مالی و تهیه گزارش توجیحی به منظور فراهم نمودن مقدمات اخذ مجوز از
          شرکت فرابورس ایران جهت انتشار و فروش گواهی شراکت به دارندگان گواهی های شراکت
          <strong>
            {Number(agencyContract.investor_request.design_wage / 1000000 || 0).toLocaleString()}{' '}
            میلیون ریال{' '}
          </strong>
          <span className="font-bold">
            كه متقاضي متعهد است همزمان با امضاي قرارداد، در قالب نقدي در وجه عامل به حساب شماره
            3002.115.15884588.1 نزد بانک پاسارگاد بلوار جمهوری و شماره شبا IR4705703002115158845881
            به نام شركت سبدگردان ایساتیس پویا کیش واريز نمايد IR.
          </span>
        </p>
        <p className="mb-3 pr-4">
          <span className="font-bold">تبصره 1 :</span>
          در صورت عدم واريز كارمزد بند 4-1 اين ماده حداكثر طي 10 روز كاري از تاريخ اين قرارداد، عامل
          تعهدي نسبت به انجام موضوع قرارداد نداشته و مخير به فسخ قرارداد ميباشد و متقاضي متعهد به
          اجراي بند ١-١ مادة ٩ اين قرارداد ميباشد.
        </p>
        <p className="mb-3 pr-4 text-right">
          <span className="font-bold">2)</span> كارمزد ارائه خدمات بازاريابي به متقاضي،{' '}
          {Number(agencyContract.investor_request.execution_wage / 1000000 || 0).toLocaleString()}{' '}
          ميليون ريال ميباشد كه در صورت موفقيت كمپين، حداكثر طي يك روز كاري پيش از واريز وجوه تأمين
          مالی شده به حساب متقاضي، از متقاضي به صورت نقدي/ چك در وجه حساب معرفي شده در بند 4-١- اين
          ماده دريافت خواهد شد.
        </p>
       
      </div>
    </div>
  );
};

Page2.propTypes = {
  agencyContract: PropTypes.object.isRequired,
};

export default Page2;
