import React from 'react';
import { PropTypes } from 'prop-types';

const Page7 = ({ agencyContract }) => {
  if (!agencyContract) return null;

  const warrantyList = agencyContract.warranty.filter((item) => item.type === 'warranty');

  return (
    <div className="contract-page page-1">
      <div className="text-justify leading-relaxed text-[23px]">
        <table className="table-auto w-full border-collapse border border-gray-300 text-[22px]">
          <thead>
            <tr>
              <th className="border border-gray-300 text-[22px] text-right pr-2">ردیف</th>
              <th className="border border-gray-300 text-[22px] text-right pr-2">شرایط</th>
              <th className="border border-gray-300 text-[22px] text-right pr-2">توضیحات</th>
            </tr>
          </thead>

          <tbody className="border border-gray-300">
            <tr>
              <td className="border border-gray-300 text-[22px] text-right pr-2">12</td>
              <td className="border border-gray-300 text-[22px] text-right pr-2">
                تضامین مورد نیاز{' '}
              </td>
              <td className="border border-gray-300 text-[18px] text-right pr-2">
                متقاضي متعهد است {warrantyList.length} فقره ضمانت نامه تعهد پرداخت بانکی برابر اصل
                مبلغ تامین مالی {warrantyList.length > 1 ? 'جمعا' : ''}  به{' '}
                <strong>
                  {Number(
                    agencyContract.investor_request.amount_of_investment / 1000000 || 0
                  ).toLocaleString()}{' '}
                  میلیون ریال{'  '}
                </strong>
                را با اعتبار 12 ماهه و قابلیت تمدید توسط عامل و با قابلیت دریافت وجه ضمانت نامه بدون
                قید و شرط در هر زمان به محض تقاضای عامل (عندالمطالبه)، که مورد تائید واحد حقوقی و
                واحد مالی عامل باشد، ارائه نماید، همچنین متقاضی متعهد است 2 فقره چک ضمانت صیادی طرح
                جدید را جمعاً به مبلغ{' '}
                <strong>
                  {Math.ceil(
                    (Math.ceil(agencyContract.warranty_check / 1000) * 1000) / 1000000 || 0
                  ).toLocaleString()}{' '}
                  میلیون ریال{'  '}
                </strong>
                (یک فقره چک به میزان اصل مبلغ تأمین مالی و یک فقره چک به میزان یک فرع از اقساط مبلغ
                تأمین مالی) از ضامن دریافت و حداکثر یک روز کاری پس از موفقیت کمین و جمع آوری وجوه به
                عامل تحویل نماید.
                <br /> تبصره 7 : متقاضی متعهد است پیش از اقدام عامل برای اخذ مجوز انتشار گواهی های
                شراکت از شرکت فرابورس ایران، حداکثر طی 5 روز کاری نسبت به ارائه ضمانت نامه تعهد
                پرداخت اقدام نماید. در صورت عدم ارائه ضمانت نامه در موعد مقرر به عامل، عامل مخیر به
                فسخ قرارداد است و متقاضی متعهد به اجرای بند 2-1 ماده 9 این قرارداد می باشد.
                <br /> تبصره 8 : کلیه هزینه های صدور، تمدید، اصلاح یا ابطال ضمانت نامه تعهد پرداخت
                بر عهده متقاضی است.
                <br /> تبصره 9: در صورت عدم تحويل چك هاي تضمين در مواعد مقرر شده يا در صورت عدم ثبت
                چك هاي تضمين در سامانه چك صيادي، و نیز عدم ظهرنویسی آن توسط صاحبین امضای مجاز، عامل
                مخير به فسخ قرارداد است و متقاضي متعهد به اجراي بند ٣-١ مادة ٩ اين قرارداد ميباشد.
                <br /> تبصره 10: متقاضي متعهد است چك هاي تضمين را بدون درج عبارت «بابت ضمانت» روي چك
                تضمين و درج عبارت « تأديه ديون» در شرح سامانه چك صيادي يا عدم تكميل قسمت شرح چك در
                سامانه چك صياد و به عامل تحويل نمايد، در غير اينصورت عامل مخير به فسخ قرارداد است و
                متقاضي متعهد به اجراي بند ٣-١ مادة ٩ اين قرارداد ميباشد.
                <br />
                <span className="text-[18px]">
                  تبصره 11: متقاضي ميتواند در صورت نياز هنگام تحويل چك تضمين و چك هاي پرداخت اقساط
                  از عامل رسيد موقت دريافت اسناد ياد شده را درخواست نمايد، اما رسيد موقت صرفاً به
                  معناي تحويل اسناد يادشده توسط متقاضي است و به هيچ وجه به منزله صحت اسناد ياد شده
                  نيست.
                </span>
              </td>
            </tr>

            <tr>
              <td className="border border-gray-300 text-[22px] text-right p-3">13</td>
              <td className="border border-gray-300 text-[22px] text-right p-3">
                {' '}
                مواعدچک های پرداخت اقساط
              </td>
              <td className="border border-gray-300 text-[22px] text-right p-3">
                متقاضي متعهد است چك هاي پرداخت اقساط بابت اصل و متفرعات (سود علي الحساب) را جمعاً به
                مبلغ{' '}
                {(
                  (Number(agencyContract.investor_request.amount_of_investment || 0) +
                    Number(agencyContract.investor_request.amount_of_investment || 0) *
                      Number(agencyContract.investor_request.interest_rate_plan / 100 || 0) *
                      0.9) /
                  1000000
                ).toLocaleString()}
                ميليون ريال،{' '}
                {Number(
                  agencyContract.investor_request.amount_of_investment / 1000000 || 0
                ).toLocaleString()}{' '}
                بابت اصل مبلغ تأمين مالي{' '}
                {(
                  (Number(agencyContract.investor_request.amount_of_investment || 0) *
                    Number(agencyContract.investor_request.interest_rate_plan / 100 || 0) *
                    0.9) /
                  1000000
                ).toLocaleString()}{' '}
                میلیون ریال بابت متفرعات مبلغ تأمین مالی)، حداكثر يك روز كاري پس از موفقيت كمپين، طي
                5 فقره چك، با تاريخ هاي پرداخت حداقل 5 روز كاري زودتر از مواعد سررسيد (زمان پرداخت
                سود مشاركت به دارندگان گواهي شراكت) كه پس از موفقيت كمپين توسط عامل به متقاضي اعلام
                مي گردد، به عامل تحويل نمايد.
              </td>
            </tr>
          </tbody>
        </table>
        <h3 className="font-bold mb-2 text-[23px] text-right">ماده 6) مدت قرارداد </h3>
        <p className="mb-2 text-right">
          اين قرارداد از زمان امضاي قرارداد، تا 15 روز كاري پس از اتمام مدت فراخوان جمع آوري وجوه از
          اعتبار قانوني برخوردار است. زمان قرارداد به صلاحديد عامل به طور خودكار و طي ارسال نامه
          كتبي به متقاضي قابل تمديد است.
          <br /> تبصره: خاتمه مدت قرارداد، تأثیری در تعهد متقاضی به پرداخت مبلغ قرارداد و نیز ایفای
          تعهدات وی در برابر عامل ،تأمین کنندگان و نهاد مالی ندارد.
        </p>
        <h3 className="font-bold mb-2 text-[23px] text-right">ماده 7) تعهدات و تأییدات متقاضی </h3>
        <p className="mb-3 pr-4 text-[23px]">
          <span className="font-bold">1)</span>
          متقاضي تعهد مي نمايد نسبت به معرفي نماينده يا نمايندگاني به عامل با رسید کتبی، به منظور
          انجام اقدامات لازم از سوي متقاضي، حداكثر سه روز پس از شروع قرارداد، اقدام نمايد.
        </p>
        <p className="mb-3 pr-4 text-[23px]">
          <span className="font-bold">2)</span>
          متقاضي متعهد است در زمان امضاي قرارداد كليه مدارك لازم جهت تهيه گزارشات لازم كه توسط عامل
          تعيين مي شود، ظرف سه روز از تاريخ اعلامي به عامل تحويل دهد.
        </p>
        <p className="mb-3 pr-4 text-[23px]">
          <span className="font-bold">3)</span>
          اخذ مجوز انتشار گواهي هاي شراكت از شركت فرابورس ايران منوط به ارائه كد بورسي و احراز هويت
          سجامي متقاضي مي باشد. در صورت عدم ارايه موارد فوق توسط متقاضي به عامل، عامل مخير به فسخ
          قرارداد است و متقاضي متعهد به اجراي بند ٢-١ مادة ٩ اين قرارداد مي باشد.
        </p>
        <p className="mb-3 pr-4 text-[23px]">
          <span className="font-bold">4)</span>
          متقاضي متعهد است هرگونه تغيير در اسناد، مدارک، اطلاعات و مفروضات ارائه شده را حداكثر طي
          مدت ٣ روز به عامل ارائه دهد.
        </p>
        <p className="mb-3 pr-4 text-[23px]">
          <span className="font-bold">5)</span>
          متقاضي متعهد است گزارش هاي ارائه شده توسط عامل را مطالعه و بررسي نموده و نسبت به تأييد و
          امضاي گزارش حداكثر طي 3 روز از زمان ارائة گزارش ها، اقدام نمايد.
        </p>
        <p className="mb-3 pr-4 text-[23px]">
          <span className="font-bold">6)</span>
          متقاضي متعهد است همكاري لازم با عامل را در راستاي تسريع امور مربوط به موضوع قرارداد، به
          عمل آورد.
        </p>
        <p className="mb-3 pr-4 text-[23px]">
          <span className="font-bold">7)</span>
          متقاضي متعهد است اقدامات لازم را جهت بازديد كارشناس يا كارشناسان معرفي شده توسط عامل از
          محل متقاضي يا مكان اجراي عمليات وي و يا برگزاري جلسات ضروري با مديران متقاضي به عمل آورد.
        </p>
        <p className="mb-3 pr-4 text-[23px]">
          <span className="font-bold">8)</span>
          متقاضي متعهد به عدم استفاده از گزارش هاي ارائه شده توسط عامل در مواردي غير از موضوع اين
          قرارداد است که احراز تخلف مستوجب خسارت وجه التزام معادل 10 درصد مبلغ کمپین تامین مالی است.
        </p>
        <p className="mb-3 pr-4 text-[23px]">
          <span className="font-bold">9)</span>
          متقاضي اقرار مي نمايد تمام مدارک و مستندات مالی شامل صورت حساب ها، حساب سود و زیان و نیز
          ترازنامه یا هر سند مالی همچنین، ديون حال و موجل خود را اعلام نموده است و تكاليف مالياتي و
          بيمه تامين اجتماعي خود را رعايت نموده است و تعهدات به سازمان های دولتی را کامل تامین نموده
          و هیچ دین یا تعهد یا قرارداد یا بدهی را کتمان ننموده و صورت های مالی واقعی و صحیح بوده و
          منبعد نیز تعهد مي نمايد كه سلامت و شفافیت کامل مالی و اداری را رعايت نمايد.
        </p>
        <p className="mb-3 pr-4 text-[23px]">
          <span className="font-bold">10)</span>
          متقاضي تأييد و اقرار مي نمايد تمامي مجوزهاي لازم را جهت اجراي طرحي كه بابت آن به عامل
          درخواست تأمين مالي ارائه شده است، اخذ نموده است.
        </p>
        <p className="mb-3 pr-4 text-[23px]">
          <span className="font-bold">11)</span>
          متقاضي تضمين مي نمايد كه مسئوليت كليه ضررها، خسارات و هزينه هاي متحمل شده در نتيجه يا در
          رابطه با عدم صحت اظهارات و ضمانت هاي مقرر در اين قرارداد را، جبران نمايد. مضافا کلیه
          مسئولیت های ناشی از تخلفات اداری، انتظامی یا حتی کیفری نیز به عهده متقاضی است و در هر حال،
          در اجرای مقدمات یا موخرات انعقاد و اجرای مفاد این قرارداد و ملزومات این قرارداد، هیچ گونه
          تخلفی نداشته و در فرض احراز، به ازای هر تخلف، ملزم به جبران خسارت وجه التزام معادل 150
          درصد از مبلغ تامین مالی است.
        </p>
        <p className="mb-3 pr-4 text-[23px]">
          <span className="font-bold">12)</span>
          متقاضي، اقرار، تأييد و تعهد مي كند كه اطلاعات ارائه شده از سوي متقاضي، افشاي درست و كاملي
          از كليه واقعيات مربوط به انتشار جهت تأمين مالي طرح را به دست مي دهد. در نتیجه، هرگونه
          اهمال در اين خصوص كه باعث به خطا رفتن پروژه يا وارد آمدن خسارت به عامل به نمايندگي از
          دارندگان گواهي شراكت گردد، بر عهده متقاضي بوده و وي مسئول تمامي خسارتهاي ناشي از اين موضوع
          است. این امر، نافی حق فسخ و مطالبه خسارت وجه التزام نیست.
        </p>
      </div>
    </div>
  );
};

Page7.propTypes = {
  agencyContract: PropTypes.object.isRequired,
};

export default Page7;
