import React from 'react';
import { PropTypes } from 'prop-types';

const Page7 = ({ agencyContract }) => {
  if (!agencyContract) return null;

  return (
    <div className="contract-page page-1">
      <div className="text-justify leading-relaxed text-[23px]">
        <p className="mb-3 pr-4 text-[23px]">
          <span className="font-bold">33)</span>
          متقاضی متعهد است اقدامات لازم قانونی و اداری برای افتتاح حساب بانکی جدید برای طرح (یا خالی
          کردن موجودی یک حساب بانکی موجود و استفاده طبق شرط آمده در تبصره،) اخذ کد بورسی و ثبت نام
          در سامانه سجام و انعقاد قرارداد با حسابرسان معتمد سازمان بورس و اوراق بهادار (در صورت
          صلاحدید عامل ) را به کار بندد و نتیجه آنها را به عامل اعلام نماید. عامل حق دارد انجام
          موضوع قرارداد در مقابل متقاضیانی که تعهدات مقدماتی موضوع این بند را رعایت ننموده است،
          متوقف کند. تبصره2 : حساب بانکی فوق، انحصارا به امور تأمین مالی جمعی طرح متقاضی طبق این
          قرارداد اختصاص خواهد داشت و متقاضی متعهد است از این حساب بانکی صرفا در راستای همین قرارداد
          بهره برداری نماید. هرگونه واریز و برداشت از این حساب تابع مقررات مربوطه و شرایط قرارداد
          حاضر خواهد بود. متقاضی متعهد است این حساب را طی یک نامه به عامل معرفی کند تا کلیه
          پرداختهای فی مابین عامل و متقاضی از طریق این حساب بانکی انجام پذیرد.
        </p>

        <p className="mb-3 pr-4 text-[23px]">
          <span className="font-bold">34)</span>
          متقاضی متعهد است در راستای انجام امور تبلیغات برای پویش تأمین مالی جمعی مرتبط با طرح خود،
          اقدامات و راهکارهای اعلام شده با هزینه کرد معقول توسط عامل را به کار بندد و از کلیه ظرفیت
          های رسانه ای و تبلیغاتی خود برای موفقیت طرح در جذب سرمایه و اجرای طرح موضوع این پویش ،
          استفاده و بهره برداری نماید.
        </p>

        <p className="mb-3 pr-4 text-[23px]">
          <span className="font-bold">35)</span>
          درصورتیکه به واسطه نقض تعهدات متقاضی، عامل ملزم به پرداخت خساراتی به اشخاص حقیقی و حقوقی
          گردد، متقاضی و اعضای هیئت مدیره آن متضامنا و رأسا مسئول پرداخت و جبران خسارات مادی وارده
          به آن اشخاص است و عامل را از هرگونه حقوق و ادعای این اشخاص مصون و مبرا می دارد. ملاک در
          ارزیابی نقض تعهد و اصل ورود خسارات و میزان خسارات، تشخیص به ترتیب کارگروه ارزیابی و عامل
          هر دو با هم است؛هزینه های اجرای این قرارداد در خصوص تهیه و تنظیم گزارش انتهایی حسابرس
          معتمد سازمان بورس و اوراق بهادار بر عهده متقاضی است و عامل هیچگونه مسئولیتی در این موارد
          نخواهد داشت.
        </p>

        <p className="mb-3 pr-4 text-[23px]">
          <span className="font-bold">36)</span>
          قید عبارت «تحت نظارت شرکت مشاور سرمایه گذاری........... توسط متقاضی برای معرفی طرح و نیز
          هرگونه تبلیغات برای آن تحت هر عنوان و به هر طریق، مستلزم مجوز مکتوب پیشین عامل است. در غیر
          این صورت متقاضی رأسًا مسئول جبران خسارات وارده به عامل ،نهادمالی و ضمانت اجراهای تعیین شده
          توسط آنان است.
        </p>

        <p className="mb-3 pr-4 text-[23px]">
          <span className="font-bold">37)</span>
          متقاضی در دوره اجرای طرح اقدام به انجام عملیات کسب وکار اعلامی خویش تحت نظارت کامل عامل ،
          حسابرس معتمد سازمان بورس و اوراق بهادار (در صورت صلاحدید عامل) و کارگروه ارزیابی می نماید
          و مکلف است نسبت به ارائه گزارش های دورهای از عملکرد خود طبق مقررات سازمان بورس اوراق
          بهادار و دستورالعمل تأمین مالی جمعی و قرارداد حاضر اقدام کند. متقاضی موظف است همواره یک
          نسخه مورد تأیید فرابورس یا کارگروه ارزیابی یا نهاد مالی (طبق سازوکارهای دستورالعمل) از
          گزارش های مزبور را مطابق با ابلاغیه شماره /۲۳۷۷و/ ۹۹مورخ 1399/09/29 را به عامل ارائه
          نماید. درهرحال، لازم است علاوه بر گزارش های مذکور، در پایان هر طرح، بنا بر صلاحدید عامل
          گزارش حسابرسی شده طرح توسط حسابرس( که فاقد قید عدم اظهارنظر یا مردود باشد) ارائه شود و
          متقاضی متعهد است دراین خصوص شرایط مورد نیاز را مهیا نماید.
        </p>

        <p className="mb-3 pr-4 text-[23px]">
          <span className="font-bold">38)</span>
          درصورتیکه متقاضی از ارائه گزارشهای موضوع این قرارداد و سایر گزارشهای مورد درخواست عامل،
          خودداری کند، متعهد است نسبت به پرداخت 150درصد مبلغ سرمایه مورد نیاز به عنوان وجه التزام
          نقض تعهد به عامل اقدام کند. مطالبه این خسارت نافی اعمال حق فسخ قرارداد توسط عامل نیست.
        </p>

        <p className="mb-3 pr-4 text-[23px]">
          <span className="font-bold">39)</span>
          مسئولیت صحت اطلاعات، گزارش ها و اظهارات متقاضی، به عهده متقاضی است و چنانچه از باب نقض این
          تعهد خسارتی به عامل ، نهاد مالی و تأمین کنندگان وارد گردد، متقاضی مسئول جبران آن خواهد
          بود. در این راستا لازم است متقاضی شرایطی را مهیا نماید که حسابداری هر یک از طرح ها در طول
          دوره اجرا به نحو استاندارد و مطلوب مورد قبول حسابرس (در صورت صلاحدید عامل ) صورت پذیرد.
          متقاضی می بایست در ابتدای شروع طرح استانداردهای لازم، نوع و شیوه ارائه اسناد و مدارک مالی
          مورد قبول و دستورالعمل های مقتضی را با حسابرس معتمد سازمان بورس و اوراق بهادار و عامل
          تعیین نماید تا در زمان حسابرسی بر مبنای تأییدات حسابرس و عامل اقدام شده باشد.
        </p>
        <p className="mb-3 pr-4 text-[23px]">
          <span className="font-bold">40)</span>
          تمام مصادیقی که وجه التزام تعیین شده است، معادل 150 درصد از مبلغ کمپین تامین مالی است. که
          خسارت وجه التزام طبق اصل عدم تداخل اسباب، با هم به نحو مجزا، قابل جمع است.
        </p>

        <h3 className="font-bold mb-2 text-[23px] text-right">ماده 8) تعهدات و تأییدات عامل</h3>
        <p className="mb-3 pr-4 text-[23px]">
          <span className="font-bold">1)</span>
          عامل متعهد است گواهي هاي شراكت موضوع اين قرارداد را بر اساس شرايط تعيين شده توسط فرابورس
          همچنین منطبق با مفاد قرارداد، براي فروش به عموم به عموم عرضه نمايد.
        </p>
        <p className="mb-3 pr-4">
          <span className="font-bold">تبصره 1:</span>
          فروش گواهي هاي شراكت منوط به تأييد طرح توسط شركت فرابورس ايران است. در صورت عدم تأييد طرح،
          عامل تعهدي نسبت به فروش گواهي هاي شراكت نخواهد داشت و كارمزد بند 4-3 مادة ٤ اين قرارداد به
          متقاضي عودت داده مي شود و قرارداد خاتمه مي يابد.
        </p>
        <p className="mb-3 pr-4 text-[23px]">
          <span className="font-bold">2)</span>
          تعهد عامل در خصوص این قرارداد، به نحو تعهد به وسیله است و هيچگونه مسئوليت و تعهدي در خصوص
          موفقيت كمپين ندارد.
        </p>
        <p className="mb-3 pr-4">
          <span className="font-bold">تبصره 2:</span>
          در صورت عدم موفقيت كمپين، مبلغ آورده متقاضي كه نزد عامل مي باشد (موضوع سطر ٢ جدول ماده ٥)
          به همراه كارمزد بند 4-3 ماده ٤ اين قرارداد، عودت داده مي شود و قرارداد خاتمه مي يابد.
        </p>
        <p className="mb-3 pr-4 text-[23px]">
          <span className="font-bold">3)</span>
          عامل پس از موفقيت كمپين، كليه وجوه حاصل از فروش گواهي هاي شراكت را به حسابي كه متقاضي طي
          نامه اي به عامل اعلام مي دارد، واريز مي نمايد و واريز وجه از سوي عامل، به منزله رسيد
          واريزي به حساب متقاضي مي باشد و متقاضی هیچ گونه ادعایی نسبت به عدم تادیه ندارد.
        </p>
        <p className="mb-3 pr-4">
          <span className="font-bold">تبصره 3:</span>
          پرداخت وجوه جمع آوري شده حاصل از موفقيت كمپين به متقاضـي، ناظر به اجراي همه تعهدات مندرج
          در مفاد اين قرارداد توسط متقاضي مي باشد.
        </p>

        <h3 className="font-bold mb-2 text-[23px] text-right">ماده 9) فسخ و انحلال</h3>
        <p className="mb-3 pr-4 text-[23px]">
          <span className="font-bold">الف)</span>
          در صورت عدم ايفاي تعهدات توسط متقاضي در مواعد مقرر شده در هر يك از بازه هاي زماني زير،
          عامل مخير به فسخ قرارداد مي باشد و متقاضي متعهد به:
        </p>
        <p className="mb-3 pr-8 text-[23px]">
          ١-١- از تاريخ شروع قرارداد تا 10 روز كاري پس از تاريخ قرارداد: پرداخت كارمزدي نمي باشد.
        </p>
        <p className="mb-3 pr-8 text-[23px]">
          ٢-١- از زمان اقدام عامل براي تهيه گزارش تا پيش از جمع آوري وجوه: پرداخت كارمزد بند 4-١
          مادة ٤ اين قرارداد مي باشد.
        </p>
        <p className="mb-3 pr-8 text-[23px]">
          ٣-١- از زمان شروع جمع آوري وجوه تا پس از موفقيت كمپين و جمع آوري وجوه: پرداخت كارمزد مادة
          ٤ اين قرارداد و وجه التزامي به ميزان ٥/٢ درصد از مبلغ كل گواهي هاي شراكت مي باشد. لذا
          باقيماندة آوردة متقاضي پس از كسر كارمزد و وجهت التزام مشخص شده در اين بند، عودت داده مي
          شود.
        </p>
      </div>
    </div>
  );
};

Page7.propTypes = {
  agencyContract: PropTypes.object.isRequired,
};

export default Page7;
