import React from 'react';
import { PropTypes } from 'prop-types';

const Page7 = ({ agencyContract }) => {
  if (!agencyContract) return null;

  return (
    <div className="contract-page page-1">
      <div className="text-justify leading-relaxed text-[23px]">
      <p className="mb-3 pr-4 text-[23px]">
          <span className="font-bold">ه) فسخ قرارداد</span>
        </p>
        <p className="mb-3 pr-4 text-[23px]">
          درصورت عدم ایفای هر یک از تعهدات مندرج در این قرارداد از سوی متقاضی، شخص عامل نسبت به
          مطالبه کتبی ایفای تعهدات اقدام و درصورت عدم اقدام متعهد و افزون شدن مجموع موارد تاخیرات از
          3 ماه، عامل حق فسخ یکجانبه قرارداد را دارد. در موارد زیر ضمن اخطار کتبی ظرف 7 روز قبل به
          متقاضی ،شخص عامل، می تواند راساً و بنا به تشخیص خود قرارداد مزبور را فسخ نماید:
        </p>
        <p className="mb-3 pr-8 text-[23px]">
          1. انتقال قرارداد به شخص ثالث از جانب متقاضی ، بدون اجازه کتبی طرف مقابل.
        </p>
        <p className="mb-3 pr-8 text-[23px]">2. صدور حکم ورشکستگی هر یک از طرفین.</p>
        <p className="mb-3 pr-8 text-[23px]">
          3. در صورتي که به هر دلیل اعم از قوه قاهره و غیره مانند رهن ، مصادره ، عمليات اجرائي
          دادگستري و يا اجراي اسناد رسمي، مستحق للغير و غصبـي بودن مورد معامله، فعالیت امکان پذیر
          نباشد.
        </p>
        <p className="mb-3 pr-8 text-[23px]">
          4. تاخیر بیش از 30 روز از تاریخ تنظیم قرارداد برای شروع کار یا ارایه اسناد از جانب متقاضی
        </p>
        <p className="mb-3 pr-8 text-[23px]">5. درصورت عدم اجرای برنامه زمانبندی از جانب متقاضی</p>
        <p className="mb-3 pr-8 text-[23px]">
          6. ضعف اسناد یا رد شدن مدارک متقاضی در فرایند بررسی فرابرس.
        </p>
        <p className="mb-3 pr-8 text-[23px]">
          7. محکومیت قضایی متقاضی به نحوی که باعث اختلال در ایفای تعهدات وی شود.
        </p>
        <p className="mb-3 pr-8 text-[23px]">
          8. در صورتی که عملیات اجرایی توسط متقاضی به مدت یک ماه متوقف گردد یا هر تخلف از تعهدات
          مندرج در قرارداد از طرف متقاضی.
        </p>
        <p className="mb-3 pr-4">
          <span className="font-bold">تبصره 6:</span>
          اعمال حق فسخ به هر علت توسط هر یک از طرفین، بدون نیاز به مراجعه به هیچ مرجع اداری یا قضایی
          و رعایت هرگونه تشریفات قانونی و قضایی و تنها با ارسال مراتب اعلام فسخ بصورت کتبی به طرف
          مقابل، صورت خواهد پذیرفت. اعمال حق فسخ مانع مطالبه خسارات و جریمه‌ها و وجوه التزام پیش
          بینی شده در این قرارداد و الزامات خارج از این قرارداد از سوی طرفین نخواهد بود.
        </p>

        <p className="mb-3 pr-4 text-[23px]">
          <span className="font-bold"> ماده 10) ضمائم قرارداد</span>
        </p>
        <p className="mb-3 pr-4 text-[23px]">
          متقاضی متعهد است اطلاعات زیر را در اختیار عامل قرار دهد:
        </p>
        <p className="mb-3 pr-8 text-[23px]">
          1. مدارک مستندات، اطلاعات، بازه های زمانی پرداخت سرمایه، شرایط و زمان بندی اجرای طرح یا
          برنامه کسب وکار؛
        </p>
        <p className="mb-3 pr-8 text-[23px]">2. مدارک یا مجوزهای مورد نیاز طرح؛</p>
        <p className="mb-3 pr-8 text-[23px]">3. سایر موارد اعلامی توسط کارگروه ارزیابی؛</p>
        <p className="mb-3 pr-8 text-[23px]">
          4. الزامات و گزارش های دوره ای که حسب مورد عامل مقرر می دارد؛
        </p>
        <p className="mb-3 pr-8 text-[23px]">
          5. افشای دعاوی حقوقی و کیفری مطروحه علیه یا له متقاضی یا اعضای هیئت مدیره و مدیرعامل آن؛
        </p>
        <p className="mb-3 pr-8 text-[23px]">6. مشخصات اعضای حقیقی و حقوقی عضو هیئت مدیره؛</p>
        <p className="mb-3 pr-8 text-[23px]">7. مشخصات سهام داران شرکت متقاضی؛</p>
        <p className="mb-3 pr-8 text-[23px]">
          8. امتیازات سهام ممتاز و نصاب سهام سهام داران ممتاز در صورت وجود؛
        </p>
        <p className="mb-3 pr-8 text-[23px]">9. لیست دارایی و بدهی ها؛</p>
        <p className="mb-3 pr-4 text-[23px]">
          <span className="font-bold">تبصره 1:</span>
          حداقل مفاد برنامه کسب وکار متقاضی به شرح پیوست شماره سه این قرارداد است.
        </p>
        <p className="mb-3 pr-4 text-[23px]">
          <span className="font-bold">ماده 11) محرمانگی</span>
        </p>
        <p className="mb-3 pr-4 text-[23px]">
          اصل برمحرمانگی اطلاعات است؛ اما موارد موضوع این ماده اسرار تجاری و اطلاعات محرمانه نیست و
          عامل حق دارد تمام یا بخشی از اطلاعات مندرج در بند فوق را جهت رعایت شفافیت در فرایندهای
          تأمین مالی جمعی، به صورت عمومی نمایش دهد یا در مذاکرات جذب منابع مالی، آنها را به تأمین
          کنندگان ارائه و افشا کند. افشا و انتشار موارد موضوع این بند، مشمول هیچ کدام از تعهدات
          رعایت محرمانگی نبوده و عامل هیچ گونه مسئولیتی در قبال ارائه و انتشار این اطلاعات ندارد.
        </p>
        <p className="mb-3 pr-4 text-[23px]">
          مضافا متقاضی متعهد است تمامی قراردادهای باز برای فروش محصولات مندرج در طرح و همچنین
          محصولات تولید شده با منابع داخلی متقاضی را به اطلاع عامل برساند بدیهی است معیار تولید
          ،فروش این محصولات و سود حاصل شده در طرح بر اساس این اطلاعات و به تشخیص عامل خواهد بود.
        </p>

        <p className="mb-3 pr-4 text-[23px]">
          <span className="font-bold">ماده 12) تضامین و جبران خسارات</span>
        </p>

        <p className="mb-3 pr-8 text-[23px]">
          1. متقاضی متعهد است کلیه خساراتی را که درنتیجه عدم ایفای تعهدات خود به تأمین کنندگان یا
          عامل یا نهاد مالی وارد می گردد پرداخت نماید. ازجمله متقاضی متعهد است درهرصورت پرداخت اصل
          منابع مالی تأمین کنندگان به علاوه سود سرمایه گذاری محقق شده به شرح را تضمین نماید؛ جز در
          مواردی که در این قرارداد صراحتا خلاف آن توافق شده است، در صورت نقض هر کدام از تعهدات مندرج
          در کل این قرارداد توسط متقاضی یا اشخاص طرف قرارداد با وی، متقاضی متعهد است (۱۵۰٪ یکصد و
          پنجاه درصد) مبلغ منابع مالی مورد نیاز اعلامی (سرمایه) را به عنوان وجه التزام به عامل
          بپردازد. مبلغ وجه التزام مندرج در این بند حداقل خسارت است که عامل می تواند با اثبات ورود
          خسارت بیش تر، نسبت به مطالبه آن اقدام نماید. درهرصورت تشخیص عامل، ملاک تعیین میزان خسارات
          وارده خواهد بود.
        </p>

      
      </div>
    </div>
  );
};

Page7.propTypes = {
  agencyContract: PropTypes.object.isRequired,
};

export default Page7;
