import React from 'react';
import { PropTypes } from 'prop-types';

const Page7 = ({ agencyContract }) => {
  if (!agencyContract) return null;

  return (
    <div className="contract-page page-1">
      <div className="text-justify leading-relaxed text-[23px]">
      <p className="mb-3 pr-4 text-[23px]">
          <span className="font-bold">30)</span>
          متقاضی متعهد است گزارشهای مرتبط با کسب وکار خود را طبق فرمت اعلامی و مصوبات کارگروه
          ارزیابی تأمین مالی جمعی در خصوص بازه زمانی و نحوه ارائه گزارش های دوره ای به عامل ارائه
          نماید. بدیهی است پرداخت و نیز برداشت هر میزان وجه، از مبلغ منابع مالی جمع آوری شده به
          متقاضی، منوط و مشروط به تأیید اقدامات متقاضی توسط عامل است. اما در صورت تخلف متقاضی ، عامل
          امکان برداشت هر میزان وجه از مبلغ منابع مالی جمع آوری شده را به متقاضی نخواهد داد.
        </p>

        <p className="mb-3 pr-4 text-[23px]">
          <span className="font-bold">31)</span>
          در صورت عدم انطباق اقدامات متقاضی با برنامه کسب وکار و فراخوان تأمین مالی جمعی یا کشف
          فساد، تدلیس و یا عدم افشای صحیح و واقعی از اطلاعات یا عملکرد متقاضی به تشخیص عامل و
          کارگروه ارزیابی، هیچ میزان از منابع مالی در اختیار متقاضی قرار نخواهد گرفت و در صورت
          پرداخت نیز متقاضی متعهد است از هرگونه تصرفات مادی و حقوقی در این موارد امتناع نماید. در
          صورت نقض این تعهد، متقاضی متعهد است ظرف حداکثر 10 روز کاری از تاریخ اعلام عامل، میزان(
          %150 یکصد و پنجاه درصد) مبلغ سرمایه مورد نیاز را به عنوان وجه التزام ناشی از نقض تعهدات
          قراردادی به عامل پرداخت نماید.
        </p>

        <p className="mb-3 pr-4 text-[23px]">
          <span className="font-bold">32)</span>
          متقاضی متعهد است مقدار حداقل شاخص های کلیدی عملکرد تعیین شده در پیوست این قرارداد را برای
          رسیدن به سود اعلام شده در این قرارداد را محقق نماید؛ درصورتیکه به تشخیص کارگروه ارزیابی و
          عامل، علت عدم دستیابی به این شاخص ها، ارتکاب جرایم و اعمال غیرقانونی یا اموری مانند بی
          احتیاطی در روند امور عادی و متعارف تجارت و کسب وکار باشد، عامل می تواند راسا از محل تضامین
          متقاضی ، ضرر و زیان وارده به خود، نهاد مالی و تأمین کنندگان را مطالبه نماید. در این راستا،
          متقاضی متعهد است ظرف مهلت حداکثر «10» روز کاری از تاریخ اعلام عامل ،( %150 یکصد و پنجاه
          درصد) مبلغ سرمایه مورد نیاز را به عنوان وجه التزام به عامل پرداخت نماید؛ در غیر این صورت
          عامل حق دارد راسا نسبت به مطالبه خسارات وارده از محل تضامین موضوع این قرارداد اقدام کند.
        </p>
        <p className="mb-3 pr-4 text-[23px]">
          <span className="font-bold">33)</span>
          متقاضی متعهد است اقدامات لازم قانونی و اداری برای افتتاح حساب بانکی جدید برای طرح (یا خالی
          کردن موجودی یک حساب بانکی موجود و استفاده طبق شرط آمده در تبصره،) اخذ کد بورسی و ثبت نام
          در سامانه سجام و انعقاد قرارداد با حسابرسان معتمد سازمان بورس و اوراق بهادار (در صورت
          صلاحدید عامل ) را به کار بندد و نتیجه آنها را به عامل اعلام نماید. عامل حق دارد انجام
          موضوع قرارداد در مقابل متقاضیانی که تعهدات مقدماتی موضوع این بند را رعایت ننموده است،
          متوقف کند. تبصره2 : حساب بانکی فوق، انحصارا به امور تأمین مالی جمعی طرح متقاضی طبق این
          قرارداد اختصاص خواهد داشت و متقاضی متعهد است از این حساب بانکی صرفا در راستای همین قرارداد
          بهره برداری نماید. هرگونه واریز و برداشت از این حساب تابع مقررات مربوطه و شرایط قرارداد
          حاضر خواهد بود. متقاضی متعهد است این حساب را طی یک نامه به عامل معرفی کند تا کلیه
          پرداختهای فی مابین عامل و متقاضی از طریق این حساب بانکی انجام پذیرد.
        </p>

        <p className="mb-3 pr-4 text-[23px]">
          <span className="font-bold">34)</span>
          متقاضی متعهد است در راستای انجام امور تبلیغات برای پویش تأمین مالی جمعی مرتبط با طرح خود،
          اقدامات و راهکارهای اعلام شده با هزینه کرد معقول توسط عامل را به کار بندد و از کلیه ظرفیت
          های رسانه ای و تبلیغاتی خود برای موفقیت طرح در جذب سرمایه و اجرای طرح موضوع این پویش ،
          استفاده و بهره برداری نماید.
        </p>

        <p className="mb-3 pr-4 text-[23px]">
          <span className="font-bold">35)</span>
          درصورتیکه به واسطه نقض تعهدات متقاضی، عامل ملزم به پرداخت خساراتی به اشخاص حقیقی و حقوقی
          گردد، متقاضی و اعضای هیئت مدیره آن متضامنا و رأسا مسئول پرداخت و جبران خسارات مادی وارده
          به آن اشخاص است و عامل را از هرگونه حقوق و ادعای این اشخاص مصون و مبرا می دارد. ملاک در
          ارزیابی نقض تعهد و اصل ورود خسارات و میزان خسارات، تشخیص به ترتیب کارگروه ارزیابی و عامل
          هر دو با هم است؛هزینه های اجرای این قرارداد در خصوص تهیه و تنظیم گزارش انتهایی حسابرس
          معتمد سازمان بورس و اوراق بهادار بر عهده متقاضی است و عامل هیچگونه مسئولیتی در این موارد
          نخواهد داشت.
        </p>

        <p className="mb-3 pr-4 text-[23px]">
          <span className="font-bold">36)</span>
          قید عبارت «تحت نظارت شرکت مشاور سرمایه گذاری........... توسط متقاضی برای معرفی طرح و نیز
          هرگونه تبلیغات برای آن تحت هر عنوان و به هر طریق، مستلزم مجوز مکتوب پیشین عامل است. در غیر
          این صورت متقاضی رأسًا مسئول جبران خسارات وارده به عامل ،نهادمالی و ضمانت اجراهای تعیین شده
          توسط آنان است.
        </p>

        <p className="mb-3 pr-4 text-[23px]">
          <span className="font-bold">37)</span>
          متقاضی در دوره اجرای طرح اقدام به انجام عملیات کسب وکار اعلامی خویش تحت نظارت کامل عامل ،
          حسابرس معتمد سازمان بورس و اوراق بهادار (در صورت صلاحدید عامل) و کارگروه ارزیابی می نماید
          و مکلف است نسبت به ارائه گزارش های دورهای از عملکرد خود طبق مقررات سازمان بورس اوراق
          بهادار و دستورالعمل تأمین مالی جمعی و قرارداد حاضر اقدام کند. متقاضی موظف است همواره یک
          نسخه مورد تأیید فرابورس یا کارگروه ارزیابی یا نهاد مالی (طبق سازوکارهای دستورالعمل) از
          گزارش های مزبور را مطابق با ابلاغیه شماره /۲۳۷۷و/ ۹۹مورخ 1399/09/29 را به عامل ارائه
          نماید. درهرحال، لازم است علاوه بر گزارش های مذکور، در پایان هر طرح، بنا بر صلاحدید عامل
          گزارش حسابرسی شده طرح توسط حسابرس( که فاقد قید عدم اظهارنظر یا مردود باشد) ارائه شود و
          متقاضی متعهد است دراین خصوص شرایط مورد نیاز را مهیا نماید.
        </p>

        <p className="mb-3 pr-4 text-[23px]">
          <span className="font-bold">38)</span>
          درصورتیکه متقاضی از ارائه گزارشهای موضوع این قرارداد و سایر گزارشهای مورد درخواست عامل،
          خودداری کند، متعهد است نسبت به پرداخت( %150 یکصد و پنجاه درصد) مبلغ سرمایه مورد نیاز به
          عنوان وجه التزام نقض تعهد به عامل اقدام کند. مطالبه این خسارت نافی اعمال حق فسخ قرارداد
          توسط عامل نیست.
        </p>

        <p className="mb-3 pr-4 text-[23px]">
          <span className="font-bold">39)</span>
          مسئولیت صحت اطلاعات، گزارش ها و اظهارات متقاضی، به عهده متقاضی است و چنانچه از باب نقض این
          تعهد خسارتی به عامل ، نهاد مالی و تأمین کنندگان وارد گردد، متقاضی مسئول جبران آن خواهد
          بود. در این راستا لازم است متقاضی شرایطی را مهیا نماید که حسابداری هر یک از طرح ها در طول
          دوره اجرا به نحو استاندارد و مطلوب مورد قبول حسابرس (در صورت صلاحدید عامل ) صورت پذیرد.
          متقاضی می بایست در ابتدای شروع طرح استانداردهای لازم، نوع و شیوه ارائه اسناد و مدارک مالی
          مورد قبول و دستورالعمل های مقتضی را با حسابرس معتمد سازمان بورس و اوراق بهادار و عامل
          تعیین نماید تا در زمان حسابرسی بر مبنای تأییدات حسابرس و عامل اقدام شده باشد.
        </p>
        <p className="mb-3 pr-4 text-[23px]">
          <span className="font-bold">40)</span>
          تمام مصادیقی که وجه التزام تعیین شده است، معادل 150 درصد از مبلغ کمپین تامین مالی است. که
          خسارت وجه التزام طبق اصل عدم تداخل اسباب، با هم به نحو مجزا، قابل جمع است.
        </p>
       
      </div>
    </div>
  );
};

Page7.propTypes = {
  agencyContract: PropTypes.object.isRequired,
};

export default Page7;
