import React from 'react';
import { PropTypes } from 'prop-types';

const Page7 = ({ agencyContract }) => {
  if (!agencyContract) return null;

  return (
    <div className="contract-page page-1">
      <div className="text-justify leading-relaxed text-[23px]">
      <p className="mb-3 pr-8 text-[23px]">
          3. تمام اختلافات ذکر شده در بالا و مجادلات برآمده یا مرتبط با این قرارداد، قراردادهای فرعی
          و معاملات منعقده طبق آن که طرفین در مهلت«30» روزه یادشده( یا هرمدت بیشتر از آن در صورت
          توافق به اتفاق آرای طرفین) حل وفصل نکرده اند در صلاحیت مرکز داوری بازار بورس و اوراق
          بهادار خواهد بود تا به وسیله داوری نهایی و الزام آور یک داور مطابق با قواعد و آیین داوری
          حل و فصل گردد. علاوه بر قوانین و مقررات الزام آور ،داور باید عرف تجاری مربوطه را نیز مدنظر
          قرار دهد و در صورت عدم رسیدگی محاکم استان یزد صالح به رسیدگی می باشند.
        </p>
        <p className="mb-3 pr-8 text-[23px]">
          4. شرط داوری حاضر موافقت نامه ای مستقل از قرارداد اصلی تلقی می شود و درهرحال لازم الاجرا
          است.
        </p>

        <h3 className="font-bold mb-2 text-[23px] text-right">ماده 17) اقامتگاه قانونی</h3>
        <p className="mb-3 pr-8 text-[23px]">
          اقامتگاه قانوني طرفين قرارداد به شرح مذكور در مادة (١) مي باشد. در صورت تغيير، طرفين
          قرارداد مكلف مي باشند حداكثر ظرف هفت روز يكديگر را كتبا مطلع نمايند. در غير اين صورت ارسال
          هرگونه اسناد و اوراق اداري و قضايي اعم از مرسولات اداري، اخطاريه ها و احضاريه ها به نشاني
          هاي فوق الذكر، دريافت شده محسوب مي گردد.
        </p>

        <h3 className="font-bold mb-2 text-[23px] text-right">ماده 18) عدم انتقال به غیر</h3>
        <p className="mb-3 pr-8 text-[23px]">
          1. این قرارداد قائم به شخص بوده و متقاضی به هیچ نحو حق انتقال با واگذاری موضوع آن را به
          شخص با اشخاص ثالث نخواهد داشت.
        </p>
        <p className="mb-3 pr-8 text-[23px]">
          2. سرمایه اعطا شده در قالب این قرارداد غیر قابل فروش و نقل و انتقال بوده و متقاضی مجاز به
          انتقال و با فروش سرمایه به اشخاص ثالث نمی باشد.
        </p>
        <p className="mb-3 pr-8 text-[23px]">
          3. متقاضی مکلف است حداقل ۱۰ درصد سرمایه مورد نیاز را اصالتاً تأمین و پرداخت نماید و در این
          خصوص، حق اخذ وام، فرض و سایر تسهیلات را ندارد.
        </p>

        <h3 className="font-bold mb-2 text-[23px] text-right">ماده 19) اقاریر متقاضی:</h3>
        <p className="mb-3 pr-8 text-[23px]">
          1. با آگاهی کامل از مفاد قرارداد و رویه اجرایی آن نسبت به امضای قرارداد اقدام نموده است.
        </p>
        <p className="mb-3 pr-8 text-[23px]">
          2. برای انعقاد قرارداد حاضر و اجرای آن با ممنوعیت و محدودیتی مواجه نبوده و از زیر ساخت های
          فنی و قانونی مورد نیاز برای انجام موضوع قرار داد، برخوردار می باشد.
        </p>
        <p className="mb-3 pr-8 text-[23px]">
          3. دارایی های مورد نیاز را تماماً از فروشندگان مجاز خریداری نموده و در صورت اثبات خلاف این
          امر در هر زمان و به هر نحو مسئول پرداخت خسارات تعیین شده خواهد بود.
        </p>
        <p className="mb-3 pr-8 text-[23px]">
          4. در اجرای موضوع این قرارداد الزامات ناشی از مصوبات کارگروه ارزیابی در خصوص سقف تأمین
          مالی جمعی برای متقاضی و اشخاص وابسته به متقاضی را رعایت نموده و تمامی اطلاعات ضروری در این
          خصوص را به عامل ارائه نموده است.
        </p>
        <p className="mb-3 pr-8 text-[23px]">
          5. برای تامین مالی طرح موضوع این قرارداد به طور همزمان در پلتفرم دیگری اقدام نکرده است.
        </p>
        <p className="mb-3 pr-8 text-[23px]">
          6. با آگاهی کامل از موضوع این قرارداد نسبت به خرید دارایی های مورد نیاز و سپس انتقال
          دارایی های خریداری شده به خود اقدام می نماید.
        </p>
        <p className="mb-3 pr-8 text-[23px]">
          7. نسبت به قیمت خرید و فروش دارایی آگاهی و اطلاع کامل داشته و ضمن پذیرش مبلغ اقساط خرید
          دارایی به عنوان بدهی خود، حق هرگونه ادعای عین فاحش با افحش را از خود سلب و ساقط می نماید.
        </p>
        <p className="mb-3 pr-8 text-[23px]">
          8. از زمره دستگاههای اجرایی موضوع ماده ۵ قانون مدیریت خدمات کشوری بانک یا مؤسسه مالی و
          اعتباری نهاد مالی دارای مجوز از سازمان بورس و اوراق بهادار شرکت پذیرفته شده در بورس و
          بازار اول و دوم فرابورس با شرکت درج شده در بازار پایه فرابورس و همچنین مشمول هیچ یک از
          دیگر ممنوعیت های مندرج در دستور العمل نیز نمی باشد.
        </p>
        <p className="mb-3 pr-8 text-[23px]">
          9. تحت هیچ عنوان از موضوع این قرارداد با انتشار فراخوان جمع آوری در پلتفرم جهت امور
          تبلیغاتی و کسب درآمد استفاده ننموده و آن را دستاویز کسب اعتبار خود قرار نمی دهد.
        </p>
        <p className="mb-3 pr-8 text-[23px]">
          10. مسئولیت پرداخت اقساط خرید دارایی و نیز بازپرداخت سرمایه در موعد مقرر بر عهده وی بوده و
          از این بابت هیچگونه مسئولیتی متوجه عامل نمی باشد.
        </p>
        <p className="mb-3 pr-8 text-[23px]">
          11. موضوع فعالیت وی حقوق مادی و معنوی اشخاص ثالث را نقض ننموده و هیچگونه دعاوی مؤثر و با
          اهمیت حقوقی با کیفری علیه شرکت و اعضای هیئت مدیره با مدیر عامل شرکت وجود ندارد.
        </p>
        <p className="mb-3 pr-8 text-[23px]">
          12. مسئولیت کلیه خسارات و ضرر و زبان وارده در نتیجه با در رابطه با عدم صحت اظهارات و ضمانت
          های مقرر در این قرارداد را جبران نماید. این خسارت حداقل به میزان ۱۲۰ درصد سرمایه می‌باشد.
        </p>
        <p className="mb-3 pr-8 text-[23px]">
          <span className="font-bold">ماده 20) قانون حاکم بر قرارداد</span>
          <br />
          کلیه اختلافات ناشی از این قرارداد اعم از و نه محدود به انعقاد صحت بطلان انحلال، فسخ، تأیید
          فسخ و همچنین اختلاف در هر یک از مواد قرارداد و یا تفسیر و اجرای آن وفق مفاد ماده ۳۶ قانون
          بازار اوراق بهادار جمهوری اسلامی ایران حل و فصل خواهد.و در صورت عدم رسیدگی محاکم استان یزد
          صالح به رسیدگی می باشند.
        </p>

        <p className="mb-3 pr-8 text-[23px]">
          <span className="font-bold">ماده 21) تفسیر قرارداد</span>
        </p>

        <p className="mb-3 pr-8 text-[23px]">
          1) بنابر توافق اطراف قرارداد نظم خاص حاکم بر این قرارداد وفق بند &ldquo;ساختار کلی
          قرارداد&rdquo; در مقدمه قرارداد بر این مبنا استوار است.
        </p>

        <p className="mb-3 pr-8 text-[23px]">
          الف) مجموع مبالغی که توسط عامل به حساب متقاضی واریز می گردد، بایستی صرفاً وفق مفاد این
          قرارداد و جهت خرید دارایی های مورد نیاز مصرف گردد.
        </p>

        <p className="mb-3 pr-8 text-[23px]">
          ب) با عنایت به آنکه سرمایه واریز شده به حساب متقاضی حاصل تجمیع مبالغ سرمایه گذاری تأمین
          کنندگان متعدد است. تعهدات متقاضی وفق مفاد این قرارداد به ازای مبلغ تمام سرمایه بوده و تحت
          هیچ عنوان قابل تجزیه نمی باشد.
        </p>

      </div>
    </div>
  );
};

Page7.propTypes = {
  agencyContract: PropTypes.object.isRequired,
};

export default Page7;
