import React from 'react';
import { PropTypes } from 'prop-types';

const Page7 = ({ agencyContract }) => {
  if (!agencyContract) return null;

  return (
    <div className="contract-page page-1">
      <div className="text-justify leading-relaxed text-[23px]">
      <p className="mb-3 pr-8 text-[23px]">
          2. به منظور تضمین ایفای تعهدات مندرج در کل این قرارداد و قوانین و مقررات لازم الاجرا در
          جمهوری اسلامی ایران و شرایط و ضوابط سکوی تأمین مالی جمعی عامل و صرف مبالغ سرمایه در راستای
          امور کسب وکار، طبق تأیید و نظارت عامل، متقاضی متعهد است یک فقره چک صیادی تضمینی به تاریخ
          ابتدای دوره اجرای طرح به مبلغ (۱۵۰٪ یکصد و پنجاه درصد) مجموع منابع مالی مورد نیاز خود را
          به عامل بسپارد تا در صورت نقض هرکدام از تعهدات، عامل از طریق تضمین موضوع این بند، نسبت به
          مطالبه خسارات وارده اقدام کند. متقاضی به صورت غیرقابل برگشت، کلیه حقوق و اختیارات لازم جهت
          اجرای مفاد این بند را بدون نیاز به مراجعه به مراجع قضایی یا داوری به عامل اعطا نموده است و
          حق هرگونه ادعایی دراین خصوص اعم از دعاوی خیانت درامانت یا استرداد وجه را علیه عامل از خود
          سلب و ساقط کرده است.
        </p>

        <p className="mb-3 pr-8 text-[23px]">
          3. در خصوص این تضامین، عامل از این حق برخوردار است که علاوه بر موارد مصرح در قرارداد که
          وصول تضامین به عنوان ضمانت اجرای تعهد خاصی بیان شده، به طورکلی در سایر مواردی نیز که به
          موجب رأی مراجع قضایی متقاضی متعهد به جبران خسارت است، به عنوان وصول بخشی از خسارات مورد
          حکم، از چک های موصوف نیز استفاده نماید.
        </p>

        <p className="mb-3 pr-8 text-[23px]">
          4. در خصوص نحوه ی صدور چکها، خریدار متعهد است چک های فوق را با شرایط زیر به عامل تسلیم
          نماید:
        </p>

        <p className="mb-3 pr-12 text-[23px]">
          الف) لازم است کلیه اعضای صاحب امضاء متقاضی ظهر چک های موضوع این بند را به عنوان ضامن امضا
          نمایند.
          <br />
          ب) کلیه ی چکها در سامانه صیاد بانک مرکزی به ثبت رسیده باشد.
          <br />
          ج) در قسمت «بابت» و «شرح چک» در سامانه صیاد، عبارت «تادیه دیون» انتخاب شده باشد.
          <br />
          د) رونوشت رسید ثبت چکها، هم زمان با تسلیم برگه چکها، به عامل تسلیم شود.
        </p>

        <p className="mb-3 pr-8 text-[23px]">
          5. تضمین مندرج در قرارداد، ظرف مهلت «15» روز کاری از تاریخ احراز و تأیید ایفای کلیه تعهدات
          متقاضی توسط نهاد مالی یا کارگروه ارزیابی، به وی مسترد می گردد.
        </p>
        <h3 className="font-bold mb-2 text-[23px] text-right">
          ماده 13) عدم تضمین موفقیت طرح در جذب سرمایه
        </h3>
        <p className="mb-3 pr-4 text-[23px]">
          عامل تنها بستری جهت تأمین مالی جمعی برای متقاضی و تأمین کنندگان فراهم می نماید؛ ازاین رو
          عامل تحت هیچ عنوان مواردی اعم از موفقیت طرح در جذب سرمایه و مانند آن را تضمین نمی نماید.
        </p>

        <h3 className="font-bold mb-2 text-[23px] text-right">
          ماده 14) گزارش دهی متقاضی و اعمال حق نظارت عامل
        </h3>
        <p className="mb-3 pr-8 text-[23px]">
          1. به منظور اعمال حق نظارت موضوع این قرارداد، عامل ، ناظر فنی قرارداد را به متقاضی معرفی
          می نماید. درصورتیکه ناظر فنی قرارداد تغییر کند، عامل متعهد است ناظر فنی جدید را به متقاضی
          معرفی نماید.
        </p>
        <p className="mb-3 pr-8 text-[23px]">
          2. عامل بدون هرگونه محدودیت و ممنوعیتی از حق نظارت کامل و بدون قیدوشرط نسبت به اعمال و
          اقدامات متقاضی در صرف مبالغ منابع مالی جمع آوری شده و اجرای طرح در هر مقطعی در راستای
          فراخوان تأمین مالی جمعی برخوردار است و می تواند در هر زمان هرگونه گزارش مالی و غیرمالی
          مرتبط با طرح متقاضی را از وی دریافت نماید. عامل به منظور اجرای حق مندرج در این بند،
          می‌تواند از خدمات مؤسسات حسابرسی یا مشاوره اشخاص خبره استفاده نماید.
        </p>
        <p className="mb-3 pr-8 text-[23px]">
          3. صرف و هزینه کردن هرگونه مبالغ از محل منابع مالی جمع آوری شده در نتیجه انتشار فراخوان
          تأمین مالی جمعی در سکوی عامل، منوط و مشروط به ارائه تأییدیه مکتوب عامل است؛ در غیر این
          صورت اقدام متقاضی در بهره برداری و تصرف نسبت به مبالغ و وجوه منابع مالی، نقض تعهدات متقاضی
          محسوب و طبق مقررات و ضمانت اجراهای مندرج در این قرارداد با وی برخورد خواهد شد.
        </p>
        <p className="mb-3 pr-8 text-[23px]">
          4. در پایان دوره اجرای طرح، متقاضی موظف است اطلاعات لازم جهت تهیه گزارش تسویه را مطابق
          سازوکارهای فرابورس یا کارگروه ارزیابی در خصوص گزارشهای مالی مرتبط و وضعیت نهایی میزان
          درآمد طرح و مقدار سود و زیان آن را به تفکیک به اطلاع عامل برساند.
        </p>
        <p className="mb-3 pr-8 text-[23px]">
          5. در صورت عدم تأیید گزارش تسویه از سوی فرابورس و یا کارگروه ارزیابی، متقاضی باید نسبت به
          ارائه اطلاعات صحیح و معتبر مجددا اقدام نماید و در این زمینه کلیه همکاری های لازم را با
          عامل بکار بندد؛ در غیر این صورت مشمول ضمانت اجرای ارائه اطلاعات نادرست و نامعتبر مندرج در
          این قرارداد خواهد بود.
        </p>

        <h3 className="font-bold mb-2 text-[23px] text-right">
          ماده 15) حوادث ناگهانی و فورس ماژور
        </h3>
        <p className="mb-3 pr-4 text-[23px]">
          هرگاه به علت وقوع حوادث غيرمترقبه (به غير از تغيير نرخ ارز، تورم، كرونا و تحريم هاي بين
          المللي) مانند ســـيل، زلزله، و ... هريك از طرفين نتواند تعهدات خود را انجام دهد در صـــورت
          اطلاع حداكثر طي 7 روز تقويمي به طرف مقابل، هيچگونه مســـئوليتي براي وي متصـــور نبوده و
          قرارداد منعقده كماكان به قوّت خود باقي خواهدبود. پس از رفع شرايط فوق، طرفين متعهد به ادامه
        </p>
        <p className="mb-3 pr-4 text-[23px]">
          انجام تعهدات مي باشند. چنانچه پس از مدّتّ يك ماه شــرايط غيرمترقبه برطرف نگرديد عامل به
          صــلاحديد خود نســبت به فســخ قرارداد اقدام نموده و دريافت كارمزد از متقاضــي اقدام مي
          نمايد.
        </p>

        <p className="mb-3 pr-4 text-[23px]">
          <span className="font-bold">تبصره 1:</span>
          چنانچه مانعي پس از انعقاد قرارداد به وجود آيد، كه در زمان عقد قرارداد قابل رفع، پيشگيري و
          پيش بيني نبوده اند و امكان ادامه قرارداد را به صورت كلي از بین مي برد، عامل مخير به فسخ
          قرارداد خواهد بود و به صلاحديد خود متناسب با پيشرفت انجام خدمات نسبت به دريافت كارمزد از
          متقاضي اقدام مي نمايد.
        </p>

        <h3 className="font-bold mb-2 text-[23px] text-right">
          ماده 16) قانون حاکم و حل وفصل اختلافات
        </h3>
        <p className="mb-3 pr-8 text-[23px]">
          1. قرارداد حاضر ازهرجهت تابع قوانین و مقررات لازم الاجرا در جمهوری اسلامی ایران است.
        </p>
        <p className="mb-3 pr-8 text-[23px]">
          2. تمامی اختلافات و دعاوی برآمده از این قرارداد یا مرتبط با آن مشتمل بر( و نه محدود به)
          انعقاد، اعتبار، خاتمه یا نقض، تفسیر یا اعمال آن باید به صورت دوستانه میان طرفین اختلاف یا
          نمایندگان آنها در مهلت « 30» روز از تاریخ ابلاغ اطلاعیه (یا هر مدت بیش تر از آن در صورت
          توافق به اتفاق آرای طرفین) طرف خواهان حل وفصل اختلافات از طریق داوری کارگروه ارزیابی تأمین
          مالی جمعی فرابورس حل گردد.
        </p>
       
      </div>
    </div>
  );
};

Page7.propTypes = {
  agencyContract: PropTypes.object.isRequired,
};

export default Page7;
