/* eslint-disable react/prop-types */
import { formatNumber } from '../../utils/formatters_func';

const Page11 = ({ data }) => {
  if (!data) return null;

  return (
    <div className="contract-page page-1">
      <div className="text-justify leading-relaxed text-[23px] space-y-6">

      <p>
          تبصره 36: درصورت عدم ایفای تعهدات و یا تأخیر در پرداخت هر یک از اقساط، در سررسـیدهـای
          مقـرر و همچنـین اسـتفاده غیـر مجـاز از وجوه دریافتی و یـا سـایر موارد تخلف از مفاد این
          قرارداد، به تشخیص و صلاحدید عامل کلیه دیون متقاضی تبدیل به دین حال شده و عامل می‌تواند طبق
          مفاد قرارداد حاضر از تمامی یا هریک از طرق قانونی یا قراردادی که مصلحت بداند به‌صورت یکجا
          اقدام به وصول کلیه مطالبات خود اعم از اصل، متفرعات، وجوه التزام، جرایم و .... نماید و عامل
          می‌تواند طبق مفاد قرارداد حاضر از تمامی یا هریک از طرق قانونی یا قراردادی که مصلحت بداند
          به‌صورت یکجا اقدام به وصول کلیه مطالبات خود اعم از اصل، متفرعات، وجوه التزام، جرایم و ....
          نماید.
        </p>
        <p>
          2. متقاضی تأیید و اقرار نموده است اظهارات و تشخیص عامل نسبت به میزان مطالبات عامل و تعهدات
          متقاضی و همچنین نسبت به تخلف متقاضی معتبر بوده و مورد قبول متقاضی خواهد بود.
        </p>
        <p>
          تبصره 37: در این قرارداد عامل به وکالت از دارندگان گواهی‌های شراکت می‌باشد. متقاضی، تأیید
          می‌نمایند که در صورت هرگونه تخلف در اجرای طرح و تأخیر در پرداخت اقساط بند 1 ماده 5، عامل
          به وکالت از دارندگان گواهی‌های شراکت رأسا می‌تواند نسبت به وصول مطالبات این اشخاص از محل
          چک‌های تضامین یا ضمانت نامه تعهد پرداخت و یا اوراق بهادار توثیق شده به صورت عرضی اقدام
          نماید. اقدام عامل در این خصوص برای متقاضی غیرقابل اعتراض و لازم الاجرا می‌باشد.
        </p>
        <p>
          تبصره 38: به جهت تضمین پرداخت اصل و متفرعات مبلغ تأمین مالی در مواعد مقرر، متقاضی ضمن این
          قرارداد به استناد این بند به عامل وکالت بلاعزل دادند که در صورت نکول متقاضی در پرداخت
          اقساط و عدم وصول چک‌های پرداخت اقساط و چک‌های تضمین، عامل بدون رعایت تشریفات قضایی
          می‌تواند نسبت به انتقال مالکیت اموال متقاضی به عامل به میزان تأخیر و عدم پرداخت اصل،
          متفرعات، جرایم و وجوه التزام مبلغ تأمین مالی، اقدام نماید. متقاضی متعهد است حداکثر ظرف مدت
          سه روز کاری به تمامی درخواست‌های عامل در این خصوص پاسخ داده و همکاری لازم را در این خصوص
          به‌عمل آورند. در صورت هرگونه تأخیر در همکاری در خصوص این بند از سوی متقاضی بیش از مهلت
          تعیین شده، متقاضی ملزم به پرداخت جریمه‌ای به مبلغ {formatNumber(200000000)} ریال (دویست
          میلیون ریال) روزانه تا زمان تسویه نهایی تعهدات خود خواهد بود.
        </p>

        <p>
          تبصره 39: در این قرارداد عامل به وکالت از دارندگان گواهی‌های شراکت می‌باشد. متقاضی، تأیید
          و اقرار می‌نماید که در صورت هرگونه تخلف در اجرای طرح و تأخیر در پرداخت اقساط بند 1 ماده 5
          و عدم پایبندی به مفاد این قرارداد، به منزله عدم ایفای تعهدات توسط متقاضی است، و عامل به
          وکالت از دارندگان گواهی‌های شراکت رأسا می‌تواند نسبت به وصول مطالبات به هرمبلغی و با
          هرعنوان و جهتی که تشخیص دهد از محل ضمانت‌نامه تعهد پرداخت و یا سایر تضامین اقدام نماید.
          اقدام عامل در این خصوص برای متقاضی غیرقابل اعتراض و لازم الاجرا می‌باشد.
        </p>

        <p>
          تبصره 40: استرداد کلیه تضامین و اسناد تجاری به متقاضی پس از ایفای تمامی تعهدات (شامل
          پرداخت اقساط، اجرای طرح موضوع قرارداد، ارائه گزارش‌های دوره‌ای و صورت‌های مالی حسابرسی
          شده، محاسبه سود قطعی گواهی‌های شراکت و ......) از سوی متقاضی و تأیید عامل انجام خواهد
          شد.در صورت تأخیر در پرداخت اقساط (اصل و متفرعات) چه از سوی متقاضی و چه از سوی بانک
          صادرکننده ضمانت‌نامه تعهد پرداخت، متقاضی متعهد است وجه التزامی به میزان دو دهم مبلغ پرداخت
          نشده به ازای هر روز دیرکرد به عامل بپردازد که از محل تمامی چک‌های اقساط و کلیۀ تضامین
          مندرج در قرارداد و دارایی‌های نامبرده قابل وصول و دریافت توسط عامل می‌باشد.
        </p>

        <p>
          اين قرارداد از زمان امضاي قرارداد، تا 15 روز كاري پس از اتمام مدت فراخوان جمع آوري وجوه از
          اعتبار قانوني برخوردار است. زمان قرارداد به صلاحديد عامل به طور خودكار و طي ارسال نامه
          كتبي به متقاضي قابل تمديد است.
        </p>

        <p className="font-bold">ماده 7) تعهدات ضامن</p>

        <p>
          1. ضامن در کمال صحت عقل و اراده و به قصد ضمانت، اعلام و تضمین می نماید از مفاد تعهدات
          متقاضی در سراسر قرارداد، قوانین و مقررات لازم الاجرا مطلع است و هیچ موردی باقی نمانده است
          تا در برابر آن به عذر عدم اطلاع متعذر گردد.
        </p>

        <p>
          2. مسئولیت ضامن در این قرارداد، از نوع مسئولیت تضامنی است (حتی اگر در بندی از قرارداد به
          نوع این مسئولیت اشاره نشده باشد)؛ لذا متقاضی و ضامن هر دو تماما مسئول ایفای کلیه تعهدات
          مندرج در این قرارداد هستند و متقاضی حق ندارد در برابر سایر طرفین به اموری همچون نقل ذمه به
          ذمه، تبدیل تعهد و غیره استناد نماید.
        </p>

        <p>
          3. ضامن اعلام و تضمین می نماید که در اساسنامه، اسناد تاسیس، مصوبات هیئت مدیره، مجامع
          عمومی، قراردادهای وی و غیره، هیچگونه شرط، مقرره، آیین نامه یا مفادی ذکر نشده است که جهت
          انعقاد قرارداد حاضر و ایفای تعهدات مندرج در آن، محدودیت یا ممنوعیتی ایجاد نماید. درهرصورت
          هرگونه شرط یا کشف وضعیتی خلاف آن ازجمله شامل (و نه محدود به) محدودیت اختیارات مدیران یا
          شرایطی مانند آیین نامه معاملات داخلی و غیره تنها در روابط داخلی ایشان، معتبر و حکم فرما
          است و در مقابل سایر طرفین این قرارداد غیرقاب استناد و اعتنا می باشد.
        </p>

        <p>
          4. ضامن متعهد است ضمن ارائه گواهی عدم سوءپیشینه اعضای هیئت مدیره خود، گواهی اعتبارسنجی
          مالی از سوی موسسات رتبه بندی معتبر تهیه و به عامل ارائه نماید.
        </p>

        <p>
          5. ضامن متعهد است ظهر اسناد تجاری و تضامین متقاضی را به عنوان ضامن امضا نماید. درصورتی که
          امکان ثبت ضمانت در سامانه صیاد فراهم نباشد، ضامن متعهد است راسا نسبت به صدور اسناد تجاری
          تضامین طبق شرایط و مبالغ مندرج در همین قرارداد اقدام نماید. این تضامین جایگزین، بدل یا
          تبدیل تعهد اسناد تضامین متقاضی و تعهدات وی نیستند و عامل حق دارد درهرصورت نسبت به تضامین
          صادره توسط متقاضی و ضامن (یا هر دوی آنها) اجتماعا یا انفرادا اقدام کند.
        </p>

        <p className="font-bold">ماده 8) تاییدات و اقرار متقاضی</p>

        <p>
          1. متقاضی تأیید و اقرار می‌نماید برای انعقاد قرارداد حاضر و اجرای طرح تمامی مجوزهای لازم
          را اخذ نموده است.
        </p>


      </div>
    </div>
  );
};

export default Page11;
