
const page8 = ({ data }) => {
  if (!data) return null;
  const checks = data?.checks?.filter((item) => item.type === 'وجه التزام');
  console.log(checks);

  return (
    <div className="contract-page page-1">
      <div className="text-justify leading-relaxed text-[23px] space-y-6">
        
      <p className="text-justify leading-relaxed text-[23px]">
          45) متقاضی از ابتدای جمع آوری وجوه تامین شده تا انتهای تسویه طرح، حق معاملات ثانویه نسبت
          به گواهی شراکت صادره برای وی نسبت به میزان درصد سرمایه تامین شده توسط متقاضی را از خود سلب
          و ساقط نمود.
        </p>
        <p className="text-justify leading-relaxed text-[23px]">
          46) درصورتی که به واسطه نقض تعهدات متقاضی، عامل یا نهاد مالی ملزم به پرداخت خساراتی به
          اشخاص حقیقی و حقوقی گردند، متقاضی و اعضای هیئت مدیره آن متضامنا و راسا مسئول پرداخت و
          جبران خسارات مادی وارده به آن اشخاص است و عامل و نهاد مالی را از هرگونه حقوق و ادعای این
          اشخاص مصون و مبرا می دارد. ملاک در ارزیابی نقض تعهد و اصل ورود خسارات و میزان خسارات،
          تشخیص به ترتیب کارگروه ارزیابی و عامل هر دو با هم است.
        </p>
        <p className="text-justify leading-relaxed text-[23px]">
          47) هزینه های اجرای این قرارداد درخصوص تهیه و تنظیم گزارش نهایی حسابرس معتمد سازمان بورس و
          اوراق بهادار بر عهده متقاضی است و عامل هیچگونه مسئولیتی در این موارد نخواهد داشت.
        </p>
        <p className="text-justify leading-relaxed text-[23px]">
          48) متقاضی در دوره اجرای طرح اقدام به انجام عملیات کسب وکار اعلامی خویش تحت نظارت کامل
          عامل، حسابرس معتمد سازمان بورس و اوراق بهادار (در صورت صلاحدید عامل) و کارگروه ارزیابی می
          نماید و مکلف است نسبت به ارائه گزارش های دورهای از عملکرد خود طبق مقررات سازمان بورس اوراق
          بهادار و دستورالعمل تامین مالی جمعی و قرارداد حاضر اقدام کند. متقاضی موظف است همواره یک
          نسخه مورد تایید فرابورس یا کارگروه ارزیابی یا نهاد مالی (طبق سازوکارهای دستورالعمل) از
          گزارش های مزبور را مطابق با ابلاغیه شماره /2377و/ 99مورخ 29/09/1399را به عامل ارائه نماید.
          درهرحال، لازم است علاوه بر گزارش های مذکور، در پایان هر طرح، بنا بر صلاحدید عامل گزارش
          حسابرسی شده طرح توسط حسابرس(که فاقد قید عدم اظهارنظر یا مردود باشد) ارائه شود و متقاضی
          متعهد است دراین خصوص شرایط مورد نیاز را مهیا نماید.
        </p>
        <p className="text-justify leading-relaxed text-[23px]">
          تبصره: تمامی طرح های بالای 5 میلیارد تومان طبق دستورالعمل کارگروه ارزیابی ملزم به ارائه
          گزارش حسابرسی در انتهای دوره خواهند بود.
        </p>
        <p className="text-justify leading-relaxed text-[23px]">
          49) درصورتی که متقاضی از ارائه گزارش های موضوع این قرارداد و سایر گزارش های مورد درخواست
          عامل به پیوست شماره 4خودداری کند، متعهد است نسبت به پرداخت150 درصد مبلغ سرمایه موردنیاز به
          عنوان وجه التزام نقض تعهد به عامل اقدام کند. مطالبه این خسارت نافی اعمال حق فسخ قرارداد
          توسط عامل نیست.
        </p>
        <p className="text-justify leading-relaxed text-[23px]">
          50) مسئولیت صحت اطلاعات، گزارش ها و اظهارات متقاضی (به استثنای گزارش های حسابرس مگر در
          مواردی که گزارش حسابرس بر اساس اطلاعات اشتباه و یا ناقص متقاضی تدوین شده باشند) مستقیماً
          بر عهده خود متقاضی است و چنانچه از باب نقض این تعهد خسارتی به عامل، نهاد مالی و تامین
          کنندگان وارد گردد، متقاضی مسئول جبران آن خواهد بود. در این راستا لازم است متقاضی شرایطی را
          مهیا نماید که حسابداری هر یک از طرحها در طول دوره اجرا به نحو استاندارد و مطلوب مورد قبول
          حسابرس (در صورت صلاحدید عامل) صورت پذیرد. متقاضی می بایست در ابتدای شروع طرح استانداردهای
          لازم، نوع و شیوه ارائه اسناد و مدارک مالی مورد قبول و دستورالعمل های مقتضی را با حسابرس
          معتمد سازمان بورس و اوراق بهادار و عامل تعیین نماید تا در زمان حسابرسی بر مبنای تاییدات
          حسابرس و عامل اقدام شده باشد.
        </p>
        <p className="text-justify leading-relaxed text-[23px]">
          51) متقاضی متعهد است درصورتی که در انتهای دوره اجرای طرح، شخصی تمام یا بخشی از کالاها و
          محصولات خریداری یا تولید شده از طریق فرایند تامین مالی جمعی را با قیمت های تضمینی مندرج در
          قرارداد، خریداری ننمود، شخصا و راسا این کالاها را به همان قیمت تضمینی از تامین کنندگان
          خریداری نماید.
        </p>
        <p className="text-justify leading-relaxed text-[23px]">
          52) متقاضی متعهد است (10ده) درصد از مبلغ سرمایه موردنیاز خود را راسا پرداخت نماید. این
          پرداخت در قالب وجه تضمین عدم نقض تعهدات قراردادی و به حساب اعلام شده توسط عامل صورت می
          گیرد و در صورت خاتمه زمان تامین مالی و احراز عدم نقض تعهدات قراردادی متقاضی و احراز عدم
          موفقیت طرح در جذب سرمایه یا حداقل منابع مالی موردنیاز، به وی مسترد می گردد. درصورتی که در
          انتهای مدت نمایش طرح جهت تامین مالی جمعی، متقاضی موفق به جمع آوری کل مبلغ سرمایه موردنیاز
          یا حداقل منابع مالی جمع آوری شده طبق این قرارداد شود، میزان مبلغ موضوع این بند، بهعنوان
          بخشی از سرمایه و منابع مالی موردنیاز در اختیار متقاضی قرار خواهد گرفت. درهرصورت متقاضی
          متعهد است این مبلغ را نیز در راستای طرح هزینه نماید. شرایط و نحوه هزینه کرد این مبلغ تابع
          شرایط و نظارت های مندرج در این قرارداد است.
        </p>
        <p className="text-justify leading-relaxed text-[23px]">
          53) پرداخت مبلغ مندرج در قرارداد، به حسابی که توسط عامل به اطلاع متقاضی می رسد، صورت خواهد
          گرفت.
        </p>
        <p className="text-justify leading-relaxed text-[23px]">
          54) در انتهای دوره طرح متقاضی، نقدی سازی دارائی هایی که در طرح خریداری یا تولید شده اند،
          انجام شده و مبالغ تحصیل شده به عنوان درآمدهای پروژه محاسبه می گردد. درصورتی که کارگروه
          ارزیابی، شیوه نقدی سازی را مشمول تخلف نقدی سازی اعلام کند، متقاضی مسئول جبران کلیه خسارت
          های وارده به عامل، نهاد مالی و تامین کنندگان خواهد بود. درهرصورت متقاضی و ضامن مسئولیت
          خرید تضمینی محصول تولیدشده را به مبلغ و میزان فروش پیش بینی شده دارند؛ همچنین عامل حق دارد
          بدون نیاز به اتخاذ تشریفات قضایی یا اداری و حسب ارزیابی خود از عملکرد متقاضی، از ضمانت
          نامه تعهد پرداخت راسا بهره برداری و تمام وجوه آن را مطالبه نماید.
        </p>
        <p className="text-justify leading-relaxed text-[23px]">
          55) درصورتی که منابع مالی جمع آوری شده، از حداقل منابع مالی جمع آوری شده طبق این قرارداد
          کمتر باشد، در این صورت فرض میگردد که طرح نتوانسته منابع مالی و سرمایه موردنیاز خود را از
          طریق تامین مالی جمعی تامین کند و منابع مالی جمع آوری شده از تامین کنندگان ظرف مهلت 2روز
          کاری از تاریخ خاتمه مهلت فراخوان تامین مالی جمعی به آنها مسترد می شود. درصورتی که منابع
          مالی جمع آوری شده، برابر یا بیشتر از مبلغ حداقل منابع مالی جمع آوری شده تا سقف کل مبلغ
          سرمایه موردنیاز متقاضی طبق این قرارداد باشد، مبالغ پرداختی تامین کننده (تامین کنندگان) بنا
          بر تایید عامل در راستای تامین مالی جمعی طبق این قرارداد مورد استفاده قرار خواهد گرفت.
        </p>
        <p className="text-justify leading-relaxed text-[23px]">
          56) پس از موفقیت طرح در جذب سرمایه و طی فرایندهای اداری و قانونی مربوطه، گواهی شراکت توسط
          شرکت فرابورس ایران برای تامین کنندگان و متناسب با میزان مشارکت هر کدام از آنها صادر می
          گردد.
        </p>
      
      </div>
    </div>
  );
};

export default page8;
