import React from 'react';
import { PropTypes } from 'prop-types';

const Page6 = ({ data }) => {
  if (!data) return null;

  return (
    <div className="contract-page page-1">
      <div className="text-justify leading-relaxed text-[23px] space-y-6">
        <p className="text-justify leading-relaxed text-[23px]">
          25) متقاضی تعهد می‌نماید حسابرسی سود قطعی گواهی‌های شراکت توسط حسابرس متقاضی انجام پذیرد.
          عامل به عنوان ناظر قرارداد، در صورت وجود هرگونه اختلاف در خصوص گزارش ارائه شده، مخیر است
          نسبت به تعیین حسابرس جدید از لیست حسابرسان معتمد سازمان بورس و اوراق بهادار اقدام نماید و
          متقاضی متعهد است تمامی همکاری‌های لازم را با حسابرس جدید جهت محاسبۀ سود قطعی گواهی‌های
          شراکت و حسابرسی ویژه به‌عمل آورد.
        </p>
        <p className="text-justify leading-relaxed text-[23px]">
          26) متقاضی حق هرگونه نقل و انتقال نسبت به تأمین مالی انجام شده را به هر شکل (اعم از اعطای
          وکالت و یا غیر آن) به غیر را جزئاً و کلاً از خود سلب و اسقاط نمود، در غیر اینصورت عامل
          می‌تواند تأمین مالی انجام شده را تبدیل به دین حال نموده و بدون اخطار قبلی اقدام به وصول
          کلیه مطالبات خود از متقاضی متفق یا منفرد اعم از اصل و سود و وجوه التزام و خسارات متعلقه و
          سایر هزینه‌های مربوطه بنماید.
        </p>
        <p className="text-justify leading-relaxed text-[23px]">
          27) متقاضی متعهد است برگزاری هرگونه مجمع را به اطلاع عامل رسانده و یک نسخه از صورتجلسه را
          برای عامل ارسال نماید.
        </p>

        <p className="text-justify leading-relaxed text-[23px]">
          28) کافه خیارات ولو خیار غبن هر چند فاحش یا افحش از متقاضی سلب و اسقاط شد.
        </p>
        <p className="text-justify leading-relaxed text-[23px]">
          30) متقاضی متعهد است درخواست خود را در فرمهای تعیین شده در سکوی عامل تکمیل و ارائه کند.
          کلیه ارتباطات و اطلاعیه ها و مانند آن میان متقاضی و عامل از طریق اطلاعات اعلامی متقاضی در
          سکوی عامل صورت میگیرد.
        </p>
        <p className="text-justify leading-relaxed text-[23px]">
          31) متقاضی اعلام می کند که از ریسک ها و مقررات حاکم ازجمله ریسک های سرمایه گذاری در شرکت
          ها و نیز شرایط و ضوابط فعالیت عامل مندرج در وبگاه عامل کاملاً مطلع است.
        </p>
        <p className="text-justify leading-relaxed text-[23px]">
          32) متقاضی با امضای این قرارداد، همه قوانین، مقررات و اصلاحات مصوب سازمان بورس اوراق
          بهادار، شورای عالی بورس، شرکت فرابورس ایران و کارگروه ارزیابی را می پذیرد و متعهد به ایفای
          تمام وظایف و تعهدات خود مطابق قرارداد و قوانین و مقررات لازمالاجرا است. همچنین متقاضی
          متعهد است به شاخصهای کلیدی عملکرد و اهداف و برنامه های مصوب دست یابد و با ناظر فنی قرارداد
          غیر منتفع (با شرط امضای قرارداد عدم افشای اطلاعات) تعیین شده توسط عامل همکاری نماید.
        </p>
        <p className="text-justify leading-relaxed text-[23px]">
          33) متقاضی متعهد است طبق استانداردهای موجود و مبتنی بر واقعیت و صداقت نسبت به ارائه طرح
          کسب وکار و تکمیل و ارائه اطلاعات مورد درخواست عامل اقدام نماید و از درج اطلاعات نادرست،
          نامعتبر، موهوم و غیرواقعی خودداری کند. متقاضی اقرار میکند مالک پروژه است که در سکوی عامل
          بارگذاری نموده است و این طرح مصون از حقوق و ادعاهای اشخاص ثالث است؛ در غیر این صورت متعهد
          است 150 درصد مبلغ سرمایه موردنیاز را به عنوان وجه التزام به عامل پرداخت نماید.
        </p>
        <p className="text-justify leading-relaxed text-[23px]">
          تبصره: به منظور ارائه اطلاعات موردنیاز برای طرح، متقاضی متعهد است فهرستی از دیون و بدهی
          های شرکت، وضعیت مالیاتی آن، قراردادهای مرتبط با طرح را در تاریخ قرارداد و همچنین شروع
          تامین مالی، به عامل ارائه نماید که به پیوست این قرارداد موجود است. لازم به ذکر است باتوجه
          به اینکه بخشی از منابع مالی موردنیاز از تامین مالی جمعی جمع آوری می شود زمان قابل قبول
          برای هزینه کردها و میزان قابل قبول به تشخیص عامل خواهد بود.
        </p>
        <p className="text-justify leading-relaxed text-[23px]">
          34) متقاضی متعهد است در تمام مدت اعتبار قرارداد و نیز مدتی که کسب وکار خود را در سکوی عامل
          به نمایش گذاشته است و پس از آن در صورت موفقیت طرح در جذب سرمایه، طرح موضوع این قرارداد را
          نزد عامل های دیگر تامین مالی جمعی، ثبت ننماید یا نسبت به تامین مالی جمعی بابت این طرح نزد
          سایر اشخاص اقدام نکند.
        </p>
        <p className="text-justify leading-relaxed text-[23px]">
          35) متقاضی متعهد است پس از تکمیل مبلغ سرمایه موردنیاز توسط تامین کنندگان، به هر تعداد که
          باشند، نسبت به انجام تعهدات خود در مقابل تامین کنندگان متناسب با شیوه اعلام شده در فراخوان
          طرح که جزء لاینفک این قرارداد است، اقدام نماید.
        </p>
        <p className="text-justify leading-relaxed text-[23px]">
          36) متقاضی تضمین می نماید که سهامداران وی در اسناد تاسیس یا اساسنامه خود هیچگونه اصلاح و
          الحاقی که با درخواست ارائه شده به عامل مغایرت دارد یا به نحوی از انحاء در ارائه درخواست یا
          اجرای آن و انعقاد قراردادهای مربوطه با تامین کنندگان مانع یا محدودیتی ایجاد می نماید یا به
          تضییع حقوق قانونی و قراردادی تامین کنندگان منتهی می گردد اعم از تصویب و تقسیم سود سالیانه،
          افزایش یا کاهش سرمایه، ادغام، انحلال یا اعلام ورشکستگی و مانند آن صورت ندهند؛ مگر آنکه
          عامل قبلا با اتخاذ چنین اقداماتی کتبا موافقت نماید.
        </p>
        <p className="text-justify leading-relaxed text-[23px]">
          37) متقاضی تضمین می نماید هیچگونه شرط قراردادی یا مقررهای در اساسنامه یا سایر اسناد تاسیس
          و نیز صورتجلسات مجامع عمومی و هیئت مدیره یا توافق داخلی میان سهامداران یا صاحبان سهم
          الشرکه متقاضی وجود ندارد که به نحوی از انحاء یا تحت هرگونه شرایطی در انعقاد قرارداد با
          عامل، نهاد مالی یا تامین کنندگان محدودیتی ایجاد نماید یا مانع آن شود یا به تضییع حقوق
          قانونی و قراردادی ایشان منتهی گردد. درهرصورت هرگونه شرط یا توافقی که ناقض این بند باشد،
          تنها در روابط میان همان اشخاص معتبر است و در مقابل اشخاص ثالث اعم از تامین کنندگان، عامل و
          نهاد مالی غیرقابل استناد است.
        </p>
        <p className="text-justify leading-relaxed text-[23px]">
          38) متقاضی متعهد است گواهی عدم سوءپیشینه مدیرعامل و اعضای هیئت مدیره خود را که از تاریخ
          صدور آن بیش از یک ماه نگذشته باشد، در تاریخ قرارداد به عامل ارائه نماید و تضمین مینماید که
          مدیرعامل و اعضای هیئت مدیره وی، مشمول هیچگونه محدودیت های قانونی و قضایی یا اداری که بر
          اجرای قرارداد حاضر تاثیر بگذارد، نیستند.
        </p>
        <p className="text-justify leading-relaxed text-[23px]">
          39) متقاضی متعهد است گزارشهای مرتبط با کسب وکار خود را طبق فرمت پیوست شماره 4 و مصوبات
          کارگروه ارزیابی تامین مالی جمعی درخصوص بازه زمانی و نحوه ارائه گزارش های دورهای به عامل
          ارائه نماید. بدیهی است پرداخت و نیز برداشت هر میزان وجه (طبق پیوست شماره 1 از مبلغ منابع
          مالی جمع آوری شده به متقاضی، منوط و مشروط به تایید اقدامات متقاضی توسط عامل (طبق پیوست
          شماره 1) است. اما در صورت تخلف متقاضی، عامل امکان برداشت هیچ میزان وجه از مبلغ منابع مالی
          جمع آوری شده را به متقاضی نخواهد داد. درصورت عدم انطباق اقدامات متقاضی با برنامه کسب وکار
          و فراخوان تامین مالی جمعی یا کشف فساد، تدلیس و یا عدم افشای صحیح و واقعی از اطلاعات یا
          عملکرد متقاضی به تشخیص عامل و کارگروه ارزیابی، هیچ میزان از منابع مالی در اختیار متقاضی
          قرار نخواهد گرفت و در صورت پرداخت نیز متقاضی متعهد است از هرگونه تصرفات مادی و حقوقی در
          این موارد امتناع نماید. در صورت نقض این تعهد، متقاضی متعهد است ظرف حداکثر 10 روز کاری از
          تاریخ اعلام عامل، میزان 150 درصد مبلغ سرمایه موردنیاز را به عنوان وجه التزام ناشی از نقض
          تعهدات قراردادی به عامل پرداخت نماید.
        </p>
      </div>
    </div>
  );
};

Page6.propTypes = {
  data: PropTypes.object.isRequired,
};

export default Page6;
