import React from 'react';
import { PropTypes } from 'prop-types';

const Page13 = ({ data }) => {
  if (!data) return null;
  const formatNumber = (num) => {
    if (!num) return '0';
    return (num / 1000000).toLocaleString('en-US');
  };

  return (
    <div className="contract-page page-1">
      <div className="text-justify leading-relaxed text-[23px] space-y-6">
        <p>
          تبصره 25: کلیه هزینه‌های ضمانت نامه تعهد پرداخت بر عهده متقاضی است و همچنین کلیه روند
          توثیق سهام و نیز هزینه های مرتبط با آن بر عهده متقاضی می باشد.
        </p>

        <p>
          تبصره 26: متقاضی مکلف است نسبت به توثیق اوراق بهادار پذیرفته شده در بازار بورس و فرابورس
          ایران، نسبت به توثیق آن در کارگزاری خود و ارائه مستندات مربوطه، این اوراق را تا پایان
          تعهدات ناشی از این قرارداد نزد عامل بلوکه نماید و تا پایان این تعهدات متقاضی هیچ حق دخل
          وتصرفی در معامله این اوراق نداشته و در صورت عدن ایفای تعهدات عامل می تواند به صورت عرضی
          این اوراق را در وجه تعهدات این قراداد وصول نماید.
        </p>

        <p>
          تبصره 27: متقاضی تأیید و اقرار می‌نماید در صورت نکول در پرداخت متفرعات توسط متقاضی، عامل
          مخیر است در صورت حتی یک نکول متقاضی در پرداخت متفرعات، کل مبلغ ضمانت‌نامه صادر شده بابت
          فرع مبلغ تأمین مالی را به یکباره از بانک مطالبه و دریافت نماید و متقاضی به موجب این تبصره
          حق هرگونه اعتراضی را از خود سلب و اسقاط نمود.
        </p>

        <p>
          تبصره 28: سررسید ضمانت‌نامه تعهد پرداخت صادر شده بابت ضمانت اصل مبلغ تأمین مالی، باید
          حداقل سه روز کاری پس از موعد پرداخت اصل مبلغ تأمین مالیِ مندرج در جدول بند 1 مادۀ 5 این
          قرارداد باشد، در صورتیکه موعد سررسید ضمانت‌نامه صادر شده پیش از موعد مقرر در جدول بند 1
          مادۀ 5 این قرارداد باشد، عامل رأسا نسبت به تمدید ضمانت‌نامه اقدام می‌نماید و در صورتیکه
          شرایط تمدید توسط متقاضی فراهم نشود یا بانک نتواند ضمانت‌نامه را تمدید کند، عامل در همان
          تاریخ کل وجه را از بانک مطالبه نموده و دریافت می‌نماید. متقاضی حق هرگونه اعتراضی را از خود
          سلب و اسقاط نمود.
        </p>

        <p>
          تبصره 29: ضمانت‌نامه تعهد پرداخت صادر شده توسط بانک بابت ضمانت اصل، باید قابلیت دریافت وجه
          ضمانت‌نامه به محض تقاضا را توسط عامل (ذینفع) داشته باشد و به‌صورت عندالمطالبه باشد.
        </p>

        <p>
          تبصره 30: متقاضی و ضامن تأیید و اقرار می‌نماید، در صورت عدم واریز وجه ضمانت‌نامه مطالبه
          شده در حواله‌کرد عامل توسط بانک صادرکننده ضمانت‌نامه تعهد پرداخت، سایر ضمانت های وی
          متضامناً به صورت عرضی و منفرداً در برابر عامل مسئول بوده و عامل می‌تواند عندالاقتضاء به
          تشخیص خود از متقاضی جهت وصول کلیه مطالبات خود و خسارات وارده مراجعه نماید.
        </p>

        <p>
          تبصره 31: در این قرارداد عامل به وکالت از دارندگان گواهی‌های شراکت می‌باشد. متقاضی،¬ تأیید
          و اقرار می‌نماید که در صورت هرگونه تخلف در اجرای طرح و تأخیر در پرداخت اقساط بند 1 ماده 5
          و عدم پایبندی به مفاد این قرارداد، به منزله عدم ایفای تعهدات توسط متقاضی است، و عامل به
          وکالت از دارندگان گواهی‌های شراکت رأسا می‌تواند نسبت به وصول مطالبات به هرمبلغی و با
          هرعنوان و جهتی که تشخیص دهد از محل ضمانت‌نامه تعهد پرداخت و یا سایر تضامین اقدام نماید.
          اقدام عامل در این خصوص برای متقاضی غیرقابل اعتراض و لازم الاجرا می‌باشد.
        </p>

        <p>
          تبصره 32: درصورت عدم ایفای تعهدات و یا تأخیر در پرداخت هر یک از اقساط، در سررسـیدهـای
          مقـرر و همچنـین اسـتفاده غیـر مجـاز از وجوه دریافتی و یـا سـایر موارد تخلف از مفاد این
          قرارداد، به تشخیص و صلاحدید عامل کلیه دیون متقاضی تبدیل به دین حال شده
        </p>

        <p>
          تبصره 33: متقاضی و ضامن تأیید و اقرار می‌نماید در صورت نکول در پرداخت متفرعات توسط متقاضی،
          عامل مخیر است در صورت حتی یک نکول متقاضی در پرداخت متفرعات، کل ارزش اوراق بهادار توثیق شده
          نزد خود را بابت فرع مبلغ تأمین مالی را به یکباره از کارگزار مربوطه مطالبه و دریافت نماید و
          متقاضی به موجب این تبصره حق هرگونه اعتراضی را از خود سلب و اسقاط نمود.
        </p>

        <p>
          تبصره 34: سررسید چک ضمانت بابت ضمانت اصل مبلغ تأمین مالی، باید حداقل سه روز کاری پس از
          موعد پرداخت اصل مبلغ تأمین مالیِ مندرج در جدول بند 1 مادۀ 5 این قرارداد باشد، در صورتیکه
          موعد سررسید چک ضمانت پیش از موعد مقرر در جدول بند 1 مادۀ 5 این قرارداد باشد، عامل رأسا
          نسبت به تمدید چک ضمانت اقدام می‌نماید و در صورتیکه شرایط تمدید توسط متقاضی فراهم نشود،
          عامل در همان تاریخ کل وجه را از بانک مطالبه نموده و دریافت می‌نماید. متقاضی حق هرگونه
          اعتراضی را از خود سلب و اسقاط نموده است.
        </p>

        <p>
          تبصره 35: در این قرارداد عامل به وکالت از دارندگان گواهی‌های شراکت می‌باشد. متقاضی،¬ تأیید
          می‌نمایند که در صورت هرگونه تخلف در اجرای طرح و تأخیر در پرداخت اقساط بند 1 ماده 5، عامل
          به وکالت از دارندگان گواهی‌های شراکت رأسا می‌تواند نسبت به وصول مطالبات این اشخاص از محل
          چک‌های تضامین یا ضمانت نامه تعهد پرداخت و یا اوراق بهادار توثیق شده به صورت عرضی اقدام
          نماید. اقدام عامل در این خصوص برای متقاضی غیرقابل اعتراض و لازم الاجرا می‌باشد.
        </p>
        <p>
          تبصره 36: درصورت عدم ایفای تعهدات و یا تأخیر در پرداخت هر یک از اقساط، در سررسـیدهـای
          مقـرر و همچنـین اسـتفاده غیـر مجـاز از وجوه دریافتی و یـا سـایر موارد تخلف از مفاد این
          قرارداد، به تشخیص و صلاحدید عامل کلیه دیون متقاضی تبدیل به دین حال شده و عامل می‌تواند طبق
          مفاد قرارداد حاضر از تمامی یا هریک از طرق قانونی یا قراردادی که مصلحت بداند به‌صورت یکجا
          اقدام به وصول کلیه مطالبات خود اعم از اصل، متفرعات، وجوه التزام، جرایم و .... نماید و عامل
          می‌تواند طبق مفاد قرارداد حاضر از تمامی یا هریک از طرق قانونی یا قراردادی که مصلحت بداند
          به‌صورت یکجا اقدام به وصول کلیه مطالبات خود اعم از اصل، متفرعات، وجوه التزام، جرایم و ....
          نماید.
        </p>
        <p>
          2. متقاضی تأیید و اقرار نموده است اظهارات و تشخیص عامل نسبت به میزان مطالبات عامل و تعهدات
          متقاضی و همچنین نسبت به تخلف متقاضی معتبر بوده و مورد قبول متقاضی خواهد بود.
        </p>

        <p>
          تبصره 37: در این قرارداد عامل به وکالت از دارندگان گواهی‌های شراکت می‌باشد. متقاضی، تأیید
          می‌نمایند که در صورت هرگونه تخلف در اجرای طرح و تأخیر در پرداخت اقساط بند 1 ماده 5، عامل
          به وکالت از دارندگان گواهی‌های شراکت رأسا می‌تواند نسبت به وصول مطالبات این اشخاص از محل
          چک‌های تضامین یا ضمانت نامه تعهد پرداخت و یا اوراق بهادار توثیق شده به صورت عرضی اقدام
          نماید. اقدام عامل در این خصوص برای متقاضی غیرقابل اعتراض و لازم الاجرا می‌باشد.
        </p>
      </div>
    </div>
  );
};

Page13.propTypes = {
  data: PropTypes.object.isRequired,
};

export default Page13;
