import React from 'react';
import { PropTypes } from 'prop-types';

const Page7 = ({ data }) => {
  if (!data) return null;

  return (
    <div className="contract-page page-1">
      <div className="text-justify leading-relaxed text-[23px] space-y-6">
        <p className="text-justify leading-relaxed text-[23px]">
          40) متقاضی متعهد است مقدار حد اقل شاخص های کلیدی عملکرد تعیین شده در پیوست شماره دو برای
          رسیدن به سود اعلام شده در این قرارداد را محقق نماید؛ درصورتیکه به تشخیص کارگروه ارزیابی و
          عامل، علت عدم دستیابی به این شاخص ها، ارتکاب جرایم و اعمال غیرقانونی یا اموری مانند بی
          احتیاطی یا بی مبالاتی در روند امور عادی و متعارف تجارت و کسب وکار باشد، عامل می تواند راسا
          از محل تضامین متقاضی، ضرر و زیان وارده به خود، نهاد مالی و تامین کنندگان را جبران نماید.
          در این راستا، متقاضی متعهد است ظرف مهلت حداکثر 10روز کاری از تاریخ اعلام عامل،150 درصد
          مبلغ سرمایه موردنیاز را به عنوان وجه التزام به عامل پرداخت نماید؛ در غیر این صورت عامل حق
          دارد راسا نسبت به مطالبه خسارات وارده از محل تضامین موضوع این قرارداد اقدام کند. عامل می
          تواند علاوه بر سایر تضامین این قرارداد، از محل وجه تضمین اولیه مندرج در قرارداد نیز
          استفاده نماید.
        </p>
        <p className="text-justify leading-relaxed text-[23px]">
          41) متقاضی متعهد است اقدامات لازم قانونی و اداری برای افتتاح حساب بانکی جدید برای طرح (یا
          خالی کردن موجودی یک حساب بانکی موجود و استفاده طبق شرط آمده در تبصره)، اخذ کد بورسی و ثبت
          نام در سامانه سجام و انعقاد قرارداد با حسابرسان معتمد سازمان بورس و اوراق بهادار (در صورت
          صلاحدید عامل) و صدور و تودیع ضمانت نامه تعهد پرداخت معتبر را بکار بندد و نتیجه آنها را به
          عامل اعلام نماید. عامل حق دارد انجام موضوع قرارداد در مقابل متقاضی ای که تعهدات مقدماتی
          موضوع این بند را رعایت ننموده است، متوقف کند.
        </p>
        <p className="text-justify leading-relaxed text-[23px]">
          تبصره: حساب بانکی موضوع قرارداد را به امور تامین مالی جمعی طرح متقاضی طبق این قرارداد
          اختصاص خواهد داشت و متقاضی متعهد است از این حساب بانکی صرفا در راستای همین قرارداد بهره
          برداری نماید. هرگونه واریز و برداشت از این حساب تابع مقررات مربوطه و شرایط قرارداد حاضر
          خواهد بود. متقاضی متعهد است این حساب را طی یک نامه به عامل معرفی کند تا کلیه پرداخت های فی
          مابین عامل و متقاضی از طریق این حساب بانکی انجام پذیرد. درهرصورت متقاضی متعهد است در صورت
          اعلام عامل گزارش جامعی از حساب های افراد یا حساب های دیگر متقاضی، حسب اعلام عامل به عامل
          تحویل دهد.
        </p>
        <p className="text-justify leading-relaxed text-[23px]">
          42) متقاضی متعهد است در راستای انجام امور تبلیغات برای پویش تامین مالی جمعی مرتبط با طرح
          خود، اقدامات و راهکارهای اعلام شده با هزینه کرد معقول توسط عامل را به کار بندد و از کلیه
          ظرفیت های رسانه ای و تبلیغاتی خود برای موفقیت طرح در جذب سرمایه و اجرای طرح موضوع این
          پویش، استفاده و بهره برداری نماید.
        </p>
        <p className="text-justify leading-relaxed text-[23px]">
          43) متقاضی متعهد است کلیه خسارات وارده به تامین کنندگان بابت اصل سرمایه از کل مبلغ منابع
          مالی موردنیاز به عنوان وجه التزام نقض تعهدات از محل تمام اموال و دارایی ها از جمله موجودی
          کالاهای تولیدی قبل از انعقاد این قرارداد به صورت رایگان بپردازد و جبران کند.
        </p>
        <p className="text-justify leading-relaxed text-[23px]">
          44) تبصره-متقاضی متعهد است مطابق برنامه زمان بندی مندرج در این قرارداد اقدام به عرضه محصول
          به بازار وفروش آن نماید و به هرتقدیر حق فروش و عرضه احتمالی محصولات قبلی تولیدی موجود در
          انبار خود و یا محصولات تولیدی مشابه خارج از این طرح را تا زمان فروش محصولات تولیدی ناشی از
          این قرارداد از خود سلب و ساقط نمود.
        </p>



        <p className="text-justify leading-relaxed text-[23px]">
          45) متقاضی از ابتدای جمع آوری وجوه تامین شده تا انتهای تسویه طرح، حق معاملات ثانویه نسبت
          به گواهی شراکت صادره برای وی نسبت به میزان درصد سرمایه تامین شده توسط متقاضی را از خود سلب
          و ساقط نمود.
        </p>
        <p className="text-justify leading-relaxed text-[23px]">
          46) درصورتی که به واسطه نقض تعهدات متقاضی، عامل یا نهاد مالی ملزم به پرداخت خساراتی به
          اشخاص حقیقی و حقوقی گردند، متقاضی و اعضای هیئت مدیره آن متضامنا و راسا مسئول پرداخت و
          جبران خسارات مادی وارده به آن اشخاص است و عامل و نهاد مالی را از هرگونه حقوق و ادعای این
          اشخاص مصون و مبرا می دارد. ملاک در ارزیابی نقض تعهد و اصل ورود خسارات و میزان خسارات،
          تشخیص به ترتیب کارگروه ارزیابی و عامل هر دو با هم است.
        </p>
        <p className="text-justify leading-relaxed text-[23px]">
          47) هزینه های اجرای این قرارداد درخصوص تهیه و تنظیم گزارش نهایی حسابرس معتمد سازمان بورس و
          اوراق بهادار بر عهده متقاضی است و عامل هیچگونه مسئولیتی در این موارد نخواهد داشت.
        </p>
        <p className="text-justify leading-relaxed text-[23px]">
          48) متقاضی در دوره اجرای طرح اقدام به انجام عملیات کسب وکار اعلامی خویش تحت نظارت کامل
          عامل، حسابرس معتمد سازمان بورس و اوراق بهادار (در صورت صلاحدید عامل) و کارگروه ارزیابی می
          نماید و مکلف است نسبت به ارائه گزارش های دورهای از عملکرد خود طبق مقررات سازمان بورس اوراق
          بهادار و دستورالعمل تامین مالی جمعی و قرارداد حاضر اقدام کند. متقاضی موظف است همواره یک
          نسخه مورد تایید فرابورس یا کارگروه ارزیابی یا نهاد مالی (طبق سازوکارهای دستورالعمل) از
          گزارش های مزبور را مطابق با ابلاغیه شماره /2377و/ 99مورخ 29/09/1399را به عامل ارائه نماید.
          درهرحال، لازم است علاوه بر گزارش های مذکور، در پایان هر طرح، بنا بر صلاحدید عامل گزارش
          حسابرسی شده طرح توسط حسابرس(که فاقد قید عدم اظهارنظر یا مردود باشد) ارائه شود و متقاضی
          متعهد است دراین خصوص شرایط مورد نیاز را مهیا نماید.
        </p>
        <p className="text-justify leading-relaxed text-[23px]">
          تبصره: تمامی طرح های بالای 5 میلیارد تومان طبق دستورالعمل کارگروه ارزیابی ملزم به ارائه
          گزارش حسابرسی در انتهای دوره خواهند بود.
        </p>
        <p className="text-justify leading-relaxed text-[23px]">
          49) درصورتی که متقاضی از ارائه گزارش های موضوع این قرارداد و سایر گزارش های مورد درخواست
          عامل به پیوست شماره 4خودداری کند، متعهد است نسبت به پرداخت150 درصد مبلغ سرمایه موردنیاز به
          عنوان وجه التزام نقض تعهد به عامل اقدام کند. مطالبه این خسارت نافی اعمال حق فسخ قرارداد
          توسط عامل نیست.
        </p>
        <p className="text-justify leading-relaxed text-[23px]">
          50) مسئولیت صحت اطلاعات، گزارش ها و اظهارات متقاضی (به استثنای گزارش های حسابرس مگر در
          مواردی که گزارش حسابرس بر اساس اطلاعات اشتباه و یا ناقص متقاضی تدوین شده باشند) مستقیماً
          بر عهده خود متقاضی است و چنانچه از باب نقض این تعهد خسارتی به عامل، نهاد مالی و تامین
          کنندگان وارد گردد، متقاضی مسئول جبران آن خواهد بود. در این راستا لازم است متقاضی شرایطی را
          مهیا نماید که حسابداری هر یک از طرحها در طول دوره اجرا به نحو استاندارد و مطلوب مورد قبول
          حسابرس (در صورت صلاحدید عامل) صورت پذیرد. متقاضی می بایست در ابتدای شروع طرح استانداردهای
          لازم، نوع و شیوه ارائه اسناد و مدارک مالی مورد قبول و دستورالعمل های مقتضی را با حسابرس
          معتمد سازمان بورس و اوراق بهادار و عامل تعیین نماید تا در زمان حسابرسی بر مبنای تاییدات
          حسابرس و عامل اقدام شده باشد.
        </p>
        <p className="text-justify leading-relaxed text-[23px]">
          51) متقاضی متعهد است درصورتی که در انتهای دوره اجرای طرح، شخصی تمام یا بخشی از کالاها و
          محصولات خریداری یا تولید شده از طریق فرایند تامین مالی جمعی را با قیمت های تضمینی مندرج در
          قرارداد، خریداری ننمود، شخصا و راسا این کالاها را به همان قیمت تضمینی از تامین کنندگان
          خریداری نماید.
        </p>
      </div>
    </div>
  );
};

Page7.propTypes = {
  data: PropTypes.object.isRequired,
};

export default Page7;
