import React from 'react';
import { PropTypes } from 'prop-types';

const Page13 = ({ data }) => {
  if (!data) return null;

  return (
    <div className="contract-page page-1">
      <div className="text-justify leading-relaxed text-[23px] space-y-6">
        <p className="text-[23px]">
          5-2. افزایش نرخ سود: در صورت افزایش عمومی نرخ سود سپرده‌های متناظر بانکی و اوراق مشابه،
          عامل رأساً می‌تواند با اعلام کتبی به متقاضی درخواست افزایش نرخ سود گواهی‌های شراکت موضوع
          این قرارداد را بنماید. متقاضی متعهد می‌گردد ظرف 7 روز از تاریخ درخواست عامل حسب مورد نسبت
          به افزایش نرخ سود گواهی‌های شراکت به میزان افزایش عمومی نرخ سود سپرده‌های متناظر بانکی و
          اوراق مشابه اقدام نماید. در غیر این صورت متقاضی ملزم به پرداخت وجه التزامی معادل میزان
          افزایش نرخ سود سپرده‌های متناظر بانکی و اوراق مشابه به صورت دوره های پرداخت3 ماهه می‌باشد.
        </p>
        <p className="text-[23px]">
          5-3. محاسبه سود قطعی: متقاضی متعهد است حداکثر پس از دو هفته از پایان عمر گواهی‌های شراکت،
          نسبت به محاسبه سود قطعی گواهی‌های شراکت اقدام نماید. همچنین حسابرس حداکثر یک ماه پس از
          اعلام سود قطعی توسط متقاضی اظهار نظر خواهد نمود.
          <br />
          تبصره 19: عامل به عنوان ناظر قرارداد، پس از اظهار نظر حسابرس، در خصوص سود قطعی حاصل از
          گواهی‌های شراکت، حق دارد نسبت به تأیید یا تعیین حسابرس جدید (حسابرس رسمی) و حسابرسی مجدد
          سود قطعی گواهی‌های شراکت اظهار نظر خود را حداکثر طی دو هفته اعلام نماید.
        </p>

        <p className="text-[23px]">
          5-4. عدم وجود دعاوی: متقاضی تأیید و تعهد می‌کند که دعاوی مؤثر با اهمیت حقوقی یا کیفری علیه
          شرکت/موسسه و اعضای هیئت مدیره یا مدیرعامل وی وجود ندارد. در صورت کشف هرگونه دعاوی مؤثر،
          عامل مخیر به فسخ قرارداد خواهد بود و متقاضی روال اتمام قرارداد را طی خواهد کرد.
        </p>

        <p className="text-[23px]">
          5-5. متقاضی متعهد می‌گردد کلیۀ هزینه‌های لازم جهت انجام موضوع این قرارداد و اخذ مجوزهای
          لازم و سایر مقدمات لازم را به موجب این قرارداد بپردازد.
        </p>

        <p className="text-[23px]">
          5-6. متقاضی متعهد می‌شود پیش از انجام هر نوع اقدام توافق نشده در خصوص موضوع قرارداد، عامل
          را کتباً یا از طریق نامه رسمی در جریان امور قرار دهد و نسبت به دریافت تأییدیه از عامل
          اقدام نماید. در صورت عدم موافقت عامل، متقاضی حق هیچگونه اقدامی در این راستا نخواهد داشت.
        </p>

        <p className="text-[23px]">
          5-7. متقاضی متعهد می‌گردد در چارچوب قوانین مالیاتی کشور، در صورت لزوم نسبت به پرداخت هرنوع
          مالیات موضوع ماده 3 قرارداد رأساً اقدام نماید.
        </p>

        <p className="text-[23px]">
          5-8. متقاضی تعهد می‌نماید بدون کسب مجوز کتبی از عامل، کل یا بخشی از موضوع یا تعهدات این
          قرارداد را به شخص یا اشخاص حقیقی یا حقوقی دیگر منتقل یا واگذار نکند در غیر اینصورت عامل
          مخیر به فسخ قرارداد خواهد بود.
        </p>

        <h3 className="text-[23px] font-bold mt-4 mb-2">5. پرداخت هزینه‌ها</h3>
        <p className="text-[23px]">
          متقاضی متعهد می‌گردد کلیه هزینه‌های لازم جهت انجام موضوع این قرارداد و اخذ مجوزهای لازم و
          سایر مقدمات لازم را به موجب این قرارداد بپردازد.
        </p>
        <h3 className="text-[23px] font-bold mt-4 mb-2">6. اطلاع‌رسانی به عامل</h3>
        <p className="text-[23px]">
          متقاضی متعهد می‌شود پیش از انجام هر نوع اقدام توافق نشده در خصوص موضوع قرارداد، عامل را
          کتباً یا از طریق نامه رسمی در جریان امور قرار دهد و نسبت به دریافت تأییدیه از عامل اقدام
          نماید. در صورت عدم موافقت عامل، متقاضی حق هیچگونه اقدامی در این راستا نخواهد داشت.
        </p>

        <h3 className="text-[23px] font-bold mt-4 mb-2">7. پرداخت مالیات</h3>

        <p className="text-justify leading-relaxed text-[23px]">
          7) متقاضی متعهد می‌گردد در چارچوب قوانین مالیاتی کشور، در صورت لزوم نسبت به پرداخت هرنوع
          مالیات موضوع ماده 3 قرارداد رأساً اقدام نماید.
        </p>

        <p className="text-justify leading-relaxed text-[23px] mt-8">
          8) متقاضی تعهد می‌نماید بدون کسب مجوز کتبی از عامل، کل یا بخشی از موضوع یا تعهدات این
          قرارداد را به شخص یا اشخاص حقیقی یا حقوقی دیگر منتقل یا واگذار نکند در غیر اینصورت عامل
          مخیر به فسخ قرارداد خواهد بود.
        </p>

        <p className="text-justify leading-relaxed text-[23px]">
          9) چنانچه مشخص شود طرح محدودیت یا منع قانونی، قراردادی یا قضایی برای اجرا دارد، قرارداد
          خود به خود منفسخ می‌شود و متقاضی مکلف است سود علی‌الحساب به میزان دوره نگهداری بعلاوه اصل
          مبلغ قرارداد را به طور کامل به عامل بازگرداند. در صورت عدم عودت، متقاضی ملزم به پرداخت
          روزانه وجه التزامی معادل دو هزارم مبلغ پرداخت نشده به عامل تا زمان ایفای تعهدات خود، خواهد
          بود.
        </p>

        <p className="text-justify leading-relaxed text-[23px]">
          10) متقاضی متعهد می‌گردد تمام مسئولیت‌های مرتبط با موضوع قرارداد را تا سررسید گواهی‌های
          شراکت بر عهده گیرد.
        </p>

        <p className="text-justify leading-relaxed text-[23px]">
          <span className="font-bold text-[23px]">تبصره 17:</span>
          به غیر از موارد پیش‌بینی شده در این قرارداد، چنانچه متقاضی در اثنای مدت این قرارداد به
          تشخیص عامل، از مفاد این قرارداد تخلف نماید، از تاریخ تخلف و به محض اعلام عامل می‌بایست سود
          علی‌الحساب را به ازای دوره زمانی نگهداری مبلغ قرارداد به‌علاوه اصل مبلغ تأمین مالی و
          جریمه‌ای معادل 2/5 درصد مبلغ کل قرارداد به عنوان وجه التزام به عامل پرداخت نماید و عامل
          مخیر به فسخ قرارداد می‌باشد.
        </p>
        <p className="text-justify leading-relaxed text-[23px]">
          11) در صورتی که در خصوص اجرای موضوع ماده 3 قرارداد هرگونه مشکلاتی به وجود آید که مانع
          اجرای موضوع ماده 3 گردد، و درصورتی که جز فورس‌ماژور نباشد، متقاضی موظف است تمامی خسارت‌های
          ناشی از عدم اجرای موضوع ماده 3، اعم از اصل به‌همراه متفرعات و وجه التزامی به میزان 2/5
          درصد مبلغ کل گواهی‌های شراکت این قرارداد را به عامل بپردازد و عامل مخیر به فسخ قرارداد
          می‌باشد.
        </p>
        <p className="text-justify leading-relaxed text-[23px]">
          <span className="font-bold text-[23px]">تبصره 18:</span>
          در تمام این قرارداد، جبران خسارت اعم از عدم‌النفع و تفویت منفعت است.
        </p>

        <p className="text-justify leading-relaxed text-[23px]">
          12) متقاضی متعهد می‌شود که موضوع ماده 3 این قرارداد را با در نظر گرفتن کامل مفاد این
          قرارداد و در تطابق با قوانین و سیاست‌های جمهوری اسلامی ایران اجرا کند. متقاضی در هیچ صورتی
          نمی‌تواند با عذر عدم اطلاع از قوانین و مقررات مربوط به طرح خود متعذر شود، وی متعهد است
          اقدامات لازم را جهت اجرای موضوع ماده 3 قرارداد به‌عمل آورد.
        </p>

 
      </div>
    </div>
  );
};

Page13.propTypes = { data: PropTypes.object.isRequired };

export default Page13;
