/* eslint-disable react/prop-types */
const Page14 = ({ data }) => {
  if (!data) return null;

  return (
    <div className="contract-page page-1">
      <div className="text-justify leading-relaxed text-[23px] space-y-6">
      <p>
          <strong>ماده 17) گزارش دهی متقاضی و اعمال حق نظارت عامل</strong>
          <br />
          1. به منظور اعمال حق نظارت موضوع این قرارداد، عامل ناظر فنی قرارداد را به متقاضی معرفی
          مینماید. درصورتیکه ناظر فنی قرارداد تغییر کند، عامل متعهد است ناظر فنی جدید را به متقاضی
          معرفی نماید.
          <br />
          2. عامل بدون هرگونه محدودیت و ممنوعیتی از حق نظارت کامل و بدون قید و شرط نسبت به اعمال و
          اقدامات متقاضی در صرف مبالغ منابع مالی جمع آوری شده و اجرای طرح در هر مقطعی در راستای
          فراخوان تامین مالی جمعی برخوردار است و میتواند در هر زمان هرگونه گزارش مالی و غیرمالی
          مرتبط با طرح متقاضی را از وی دریافت نماید. عامل بهمنظور اجرای حق مندرج در این بند، میتواند
          از خدمات موسسات حسابرسی یا مشاوره اشخاص خبره استفاده نماید.
          <br />
          3. صرف و هزینه کردن هرگونه مبالغ از محل منابع مالی جمع آوری شده در نتیجه انتشار فراخوان
          تامین مالی جمعی در سکوی عامل، منوط و مشروط به ارائه تاییدیه مکتوب عامل است (طبق پیوست
          شماره1) در غیر این صورت اقدام متقاضی در بهره برداری و تصرف نسبت به مبالغ و وجوه منابع
          مالی، نقض تعهدات متقاضی محسوب و طبق مقررات و ضمانت اجراهای مندرج در این قرارداد با وی
          برخورد خواهد شد.
          <br />
          4. در پایان دوره اجرای طرح، متقاضی موظف است اطلاعات لازم جهت تهیه گزارش تسویه را مطابق
          سازوکارهای فرابورس یا کارگروه ارزیابی در خصوص گزارش های مالی مرتبط و وضعیت نهایی میزان
          درآمد طرح و مقدار سود و زیان آن را به تفکیک به اطلاع عامل برساند.
          <br />
          5. در صورت عدم تایید گزارش تسویه از سوی فرابورس و یا کارگروه ارزیابی، متقاضی باید نسبت به
          ارائه اطلاعات صحیح و معتبر مجددا اقدام نماید و در این زمینه کلیه همکاری های لازم را با
          عامل بکار بندد؛ در غیر این صورت مشمول ضمانت اجرای ارائه اطلاعات نادرست و نامعتبر مندرج در
          این قرارداد خواهد بود.
        </p>

        <p>
          <strong>ماده 18) قانون حاکم و حل وفصل اختلافات</strong>
          <br />
          1. قرارداد حاضر ازهرجهت تابع قوانین و مقررات لازم الاجرا در جمهوری اسلامی ایران است.
          <br />
          2. تمامی اختلافات و دعاوی برآمده از این قرارداد یا مرتبط با آن مشتمل بر (و نه محدود به)
          انعقاد، اعتبار، فسخ، تفاسخ، خاتمه یا نقض، تفسیر، اجرا یا اعمال آن و مجادلات برآمده یا
          مرتبط با این قرارداد، قراردادهای فرعی و معاملات منعقده طبق آن، در صلاحیت هیئت داوری بورس و
          اوراق بهادار خواهد بود تابه وسیله رسیدگی نهایی و الزام آور مطابق با قواعد و آیین داوری حل
          وفصل گردد. علاوه بر قوانین و مقررات الزام آور، داور باید عرف تجاری مربوطه را نیز مدنظر
          قرار دهد. داوری می تواند از نشانی های مندرج در این قرارداد ازجمله نشانی رایانامه طرفین جهت
          امر ابلاغ استفاده نماید.
          <br />
          3. شرط داوری حاضر موافقت نامه ای مستقل از قرارداد اصلی تلقی می شود و درهرحال لازمالاجرا
          است.
          <br />
          4. حقوق، امتیازات و شیوه های مطالبه مذکور در قانون اصلاح قانون صدور چک مصوب 1397 برای
          دارنده چک های صیادی (عامل) به قوت و اعتبار خود باقی است.
        </p>

        <p>
          <strong>ماده 19) اقامتگاه قانونی طرفین</strong>
          <br />
          اقامتگاه طرفین همان است که در ماده یک قرارداد ذکر شده است. متقاضی و تامین کننده در صورت
          تغییر نشانی متعهد است اقامتگاه جدید خود را ظرف مدت حداکثر 7روز پس از تغییر به عامل اطلاع
          دهد. تا زمانی که نشانی جدید اعلام نشده، مکاتبات به آدرس قبلی ارسال می شوند و ابلاغ شده
          تلقی می شوند درهرصورت ابلاغ کلیه ابلاغ ها، مکاتبات، اعلامیه ها و اخطاریه های و نامه های
          مرتبط با این قرارداد به نشانی ایمیل طرفین مندرج در ماده 2این قرارداد، صحیحا و قانونا ابلاغ
          شده تلقی میگردد
        </p>
        <p>
          <strong>ماده 20) راه ارتباطی طرفین قرارداد</strong>
          <br />
          1) تمامی مواردی که بعد از عقد قرارداد نیاز مند پیگیری و تعامل و ارتباط فی مابین طرفین
          قرارداد می باشد .اعم از معرفی ناظر ،ارسال مدارک ،وامثالهم از طریق راه های ارتباطی زیر می
          باشد.
          <br />
          2) شماره تلفن ثابت03591090088
          <br />
          3) ایمیل به نشانیinfo@isatiscrowd.ir
          <br />
          4) اظهارنامه رسمی
        </p>

        <p>
          <strong>ماده 21) اعتبار قرارداد</strong>
          <br />
          این قرارداد در 21ماده و 49 تبصره، بدون پیوست در سه نسخه واحد تنظیم گردید که پس از امضاء
          کلیه نسخ آن در حکم واحد بوده و لازم‌الاجرا می‌باشند.
        </p>
      </div>
    </div>
  );
};

export default Page14;
