/* eslint-disable react/prop-types */
const Page11 = ({ data }) => {
  if (!data) return null;

  return (
    <div className="contract-page page-1">
      <div className="text-justify leading-relaxed text-[23px] space-y-6">
      <p>
          تبصره 32: درصورت عدم ایفای تعهدات و یا تأخیر در پرداخت هر یک از اقساط، در سررسـیدهـای
          مقـرر و همچنـین اسـتفاده غیـر مجـاز از وجوه دریافتی و یـا سـایر موارد تخلف از مفاد این
          قرارداد، به تشخیص و صلاحدید عامل کلیه دیون متقاضی تبدیل به دین حال شده
        </p>

        <p>
          تبصره 33: متقاضی و ضامن تأیید و اقرار می‌نماید در صورت نکول در پرداخت متفرعات توسط متقاضی،
          عامل مخیر است در صورت حتی یک نکول متقاضی در پرداخت متفرعات، کل ارزش اوراق بهادار توثیق شده
          نزد خود را بابت فرع مبلغ تأمین مالی را به یکباره از کارگزار مربوطه مطالبه و دریافت نماید و
          متقاضی به موجب این تبصره حق هرگونه اعتراضی را از خود سلب و اسقاط نمود.
        </p>

        <p>
          تبصره 34: سررسید چک ضمانت بابت ضمانت اصل مبلغ تأمین مالی، باید حداقل سه روز کاری پس از
          موعد پرداخت اصل مبلغ تأمین مالیِ مندرج در جدول بند 1 مادۀ 5 این قرارداد باشد، در صورتیکه
          موعد سررسید چک ضمانت پیش از موعد مقرر در جدول بند 1 مادۀ 5 این قرارداد باشد، عامل رأسا
          نسبت به تمدید چک ضمانت اقدام می‌نماید و در صورتیکه شرایط تمدید توسط متقاضی فراهم نشود،
          عامل در همان تاریخ کل وجه را از بانک مطالبه نموده و دریافت می‌نماید. متقاضی حق هرگونه
          اعتراضی را از خود سلب و اسقاط نموده است.
        </p>

        <p>
          تبصره 35: در این قرارداد عامل به وکالت از دارندگان گواهی‌های شراکت می‌باشد. متقاضی،¬ تأیید
          می‌نمایند که در صورت هرگونه تخلف در اجرای طرح و تأخیر در پرداخت اقساط بند 1 ماده 5، عامل
          به وکالت از دارندگان گواهی‌های شراکت رأسا می‌تواند نسبت به وصول مطالبات این اشخاص از محل
          چک‌های تضامین یا ضمانت نامه تعهد پرداخت و یا اوراق بهادار توثیق شده به صورت عرضی اقدام
          نماید. اقدام عامل در این خصوص برای متقاضی غیرقابل اعتراض و لازم الاجرا می‌باشد.
        </p>
        <p>
          تبصره 36: درصورت عدم ایفای تعهدات و یا تأخیر در پرداخت هر یک از اقساط، در سررسـیدهـای
          مقـرر و همچنـین اسـتفاده غیـر مجـاز از وجوه دریافتی و یـا سـایر موارد تخلف از مفاد این
          قرارداد، به تشخیص و صلاحدید عامل کلیه دیون متقاضی تبدیل به دین حال شده و عامل می‌تواند طبق
          مفاد قرارداد حاضر از تمامی یا هریک از طرق قانونی یا قراردادی که مصلحت بداند به‌صورت یکجا
          اقدام به وصول کلیه مطالبات خود اعم از اصل، متفرعات، وجوه التزام، جرایم و .... نماید و عامل
          می‌تواند طبق مفاد قرارداد حاضر از تمامی یا هریک از طرق قانونی یا قراردادی که مصلحت بداند
          به‌صورت یکجا اقدام به وصول کلیه مطالبات خود اعم از اصل، متفرعات، وجوه التزام، جرایم و ....
          نماید.
        </p>
        <p>
          2. متقاضی تأیید و اقرار نموده است اظهارات و تشخیص عامل نسبت به میزان مطالبات عامل و تعهدات
          متقاضی و همچنین نسبت به تخلف متقاضی معتبر بوده و مورد قبول متقاضی خواهد بود.
        </p>
        <p>
          تبصره 37: در این قرارداد عامل به وکالت از دارندگان گواهی‌های شراکت می‌باشد. متقاضی، تأیید
          می‌نمایند که در صورت هرگونه تخلف در اجرای طرح و تأخیر در پرداخت اقساط بند 1 ماده 5، عامل
          به وکالت از دارندگان گواهی‌های شراکت رأسا می‌تواند نسبت به وصول مطالبات این اشخاص از محل
          چک‌های تضامین یا ضمانت نامه تعهد پرداخت و یا اوراق بهادار توثیق شده به صورت عرضی اقدام
          نماید. اقدام عامل در این خصوص برای متقاضی غیرقابل اعتراض و لازم الاجرا می‌باشد.
        </p>
        <p>
          تبصره 38: به جهت تضمین پرداخت اصل و متفرعات مبلغ تأمین مالی در مواعد مقرر، متقاضی ضمن این
          قرارداد به استناد این بند به عامل وکالت بلاعزل دادند که در صورت نکول متقاضی در پرداخت
          اقساط و عدم وصول چک‌های پرداخت اقساط و چک‌های تضمین، عامل بدون رعایت تشریفات قضایی
          می‌تواند نسبت به انتقال مالکیت اموال متقاضی به عامل به میزان تأخیر و عدم پرداخت اصل،
          متفرعات، جرایم و وجوه التزام مبلغ تأمین مالی، اقدام نماید. متقاضی متعهد است حداکثر ظرف مدت
          سه روز کاری به تمامی درخواست‌های عامل در این خصوص پاسخ داده و همکاری لازم را در این خصوص
          به‌عمل آورند. در صورت هرگونه تأخیر در همکاری در خصوص این بند از سوی متقاضی بیش از مهلت
          تعیین شده، متقاضی ملزم به پرداخت جریمه‌ای به مبلغ 200,000,000 ریال روزانه
          تا زمان تسویه نهایی تعهدات خود خواهد بود.
        </p>
        <p>
          تبصره 40: استرداد کلیه تضامین و اسناد تجاری به متقاضی پس از ایفای تمامی تعهدات (شامل
          پرداخت اقساط، اجرای طرح موضوع قرارداد، ارائه گزارش‌های دوره‌ای و صورت‌های مالی حسابرسی
          شده، محاسبه سود قطعی گواهی‌های شراکت و ......) از سوی متقاضی و تأیید عامل انجام خواهد
          شد.در صورت تأخیر در پرداخت اقساط (اصل و متفرعات) چه از سوی متقاضی و چه از سوی بانک
          صادرکننده ضمانت‌نامه تعهد پرداخت، متقاضی متعهد است وجه التزامی به میزان دو دهم مبلغ پرداخت
          نشده به ازای هر روز دیرکرد به عامل بپردازد که از محل تمامی چک‌های اقساط و کلیۀ تضامین
          مندرج در قرارداد و دارایی‌های نامبرده قابل وصول و دریافت توسط عامل می‌باشد.
        </p>

      <p>
          اين قرارداد از زمان امضاي قرارداد، تا 15 روز كاري پس از اتمام مدت فراخوان جمع آوري وجوه از
          اعتبار قانوني برخوردار است. زمان قرارداد به صلاحديد عامل به طور خودكار و طي ارسال نامه
          كتبي به متقاضي قابل تمديد است.
        </p>

        <p className="font-bold">ماده 7) تعهدات ضامن</p>

        <p>
          1. ضامن در کمال صحت عقل و اراده و به قصد ضمانت، اعلام و تضمین می نماید از مفاد تعهدات
          متقاضی در سراسر قرارداد، قوانین و مقررات لازم الاجرا مطلع است و هیچ موردی باقی نمانده است
          تا در برابر آن به عذر عدم اطلاع متعذر گردد.
        </p>

        <p>
          2. مسئولیت ضامن در این قرارداد، از نوع مسئولیت تضامنی است (حتی اگر در بندی از قرارداد به
          نوع این مسئولیت اشاره نشده باشد)؛ لذا متقاضی و ضامن هر دو تماما مسئول ایفای کلیه تعهدات
          مندرج در این قرارداد هستند و متقاضی حق ندارد در برابر سایر طرفین به اموری همچون نقل ذمه به
          ذمه، تبدیل تعهد و غیره استناد نماید.
        </p>
     
      </div>
    </div>
  );
};

export default Page11;
