/* eslint-disable react/prop-types */
const Page14 = ({ data }) => {
  if (!data) return null;

  return (
    <div className="contract-page page-1">
      <div className="text-justify leading-relaxed text-[23px] space-y-6">
        <p>
          <strong>ماده 14) عدم تضمین موفقیت طرح در جذب سرمایه</strong>
          <br />
          عامل تنها بستری جهت تامین مالی جمعی برای متقاضی و تامین کنندگان فراهم می نماید. ازاین رو
          عامل تحت هیچ عنوان مواردی اعم از موفقیت طرح در جذب سرمایه و مانند آن را تضمین نمی نماید.
        </p>

        <p>
          <strong>ماده 15) حوادث ناگهانی و فورس ماژور</strong>
          <br />
          1. هرگاه اجرای تمام یا بخشی از قرارداد به واسطه علتی خارجی، مقاومت ناپذیر و غیر قابل پیش
          بینی غیرممکن شود یا به تاخیر افتد، عامل یا متقاضی که در این وضعیت قرار گرفته است مسئول
          جبران خسارات ناشی از عدم اجرا یا تاخیر در اجرای قرارداد نیست. در این صورت وی مکلف است در
          اسرع وقت( حداکثر 7روز) از تاریخ اطلاع از شرایط فورس ماژور، مراتب را کتباً به طرف مقابل
          اطلاع دهد.
          <br />
          2. معافیت از مسئولیت موضوع این ماده، شامل تعهد مندرج در قرارداد نیست.
          <br />
          3. تعهد متقاضی و ضامن نسبت به این بند در مقابل تامین کنندگان از جنس تعهد به نتیجه است.
        </p>

        <p>
          <strong>ماده 16) فسخ قرارداد</strong>
          <br />
          1. قرارداد حاضر عقدی لازم الاتباع و لازم الاجراست و تنها در موارد زیر منحل می گردد:
          <br />
          الف) درصورت نقض هر یک از شروط قرارداد توسط متقاضی یا تامین کننده، عامل حق فسخ قرارداد حاضر
          را (بدون نیاز به اجرای تشریفات قضایی الزام به اجرای عین تعهد) دارد؛ درصورتی که عامل
          قرارداد را در مقابل هرکدام از تامین کنندگان فسخ کند، این قرارداد صرفا در مقابل همان تامین
          کننده، فسخ می گردد.
          <br />
          ب) درصورت انحلال ضامن یا متقاضی یا صدور حکم ورشکستگی هرکدام از ایشان، عامل می تواند
          قرارداد حاضر را ظرف مهلت 15 روز از تاریخ اطلاع از تحقق هر کدام از این موارد فسخ نماید.
          <br />
          2. طرفین می توانند با توافق با یکدیگر قرارداد حاضر را اقاله نمایند.
          <br />
          3. اعمال حق فسخ مندرج در این قرارداد توسط عامل، مانع مطالبه خسارات وارده به وی نیست.
          <br />
          4. متقاضی، ضامن، تامین کننده و نهاد مالی حق فسخ قرارداد حاضر را جز در مواقعی که کارگروه
          ارزیابی عدم اجرای تعهدات عامل را تایید کند، از خود سلب و ساقط نموده اند.
          <br />
          5. متقاضی از تاریخ امضای این قرارداد حق انصراف از اجرای قرارداد را جز در حالتی که عامل
          موافقت کتبی پیشین خود را اعلام کرده باشد ندارد و در غیر این صورت مصداق نقض تعهدات متقاضی
          بوده و وی متعهد به پرداخت 150 درصد اصل سرمایه حداکثر تا 10 روز پس از نامه کتبی عامل به
          متقاضی به عنوان وجه التزام می باشد.
        </p>

        <p>
          <strong>ماده 17) گزارش دهی متقاضی و اعمال حق نظارت عامل</strong>
          <br />
          1. به منظور اعمال حق نظارت موضوع این قرارداد، عامل ناظر فنی قرارداد را به متقاضی معرفی
          مینماید. درصورتیکه ناظر فنی قرارداد تغییر کند، عامل متعهد است ناظر فنی جدید را به متقاضی
          معرفی نماید.
          <br />
          2. عامل بدون هرگونه محدودیت و ممنوعیتی از حق نظارت کامل و بدون قید و شرط نسبت به اعمال و
          اقدامات متقاضی در صرف مبالغ منابع مالی جمع آوری شده و اجرای طرح در هر مقطعی در راستای
          فراخوان تامین مالی جمعی برخوردار است و میتواند در هر زمان هرگونه گزارش مالی و غیرمالی
          مرتبط با طرح متقاضی را از وی دریافت نماید. عامل بهمنظور اجرای حق مندرج در این بند، میتواند
          از خدمات موسسات حسابرسی یا مشاوره اشخاص خبره استفاده نماید.
          <br />
          3. صرف و هزینه کردن هرگونه مبالغ از محل منابع مالی جمع آوری شده در نتیجه انتشار فراخوان
          تامین مالی جمعی در سکوی عامل، منوط و مشروط به ارائه تاییدیه مکتوب عامل است (طبق پیوست
          شماره1) در غیر این صورت اقدام متقاضی در بهره برداری و تصرف نسبت به مبالغ و وجوه منابع
          مالی، نقض تعهدات متقاضی محسوب و طبق مقررات و ضمانت اجراهای مندرج در این قرارداد با وی
          برخورد خواهد شد.
          <br />
          4. در پایان دوره اجرای طرح، متقاضی موظف است اطلاعات لازم جهت تهیه گزارش تسویه را مطابق
          سازوکارهای فرابورس یا کارگروه ارزیابی در خصوص گزارش های مالی مرتبط و وضعیت نهایی میزان
          درآمد طرح و مقدار سود و زیان آن را به تفکیک به اطلاع عامل برساند.
          <br />
          5. در صورت عدم تایید گزارش تسویه از سوی فرابورس و یا کارگروه ارزیابی، متقاضی باید نسبت به
          ارائه اطلاعات صحیح و معتبر مجددا اقدام نماید و در این زمینه کلیه همکاری های لازم را با
          عامل بکار بندد؛ در غیر این صورت مشمول ضمانت اجرای ارائه اطلاعات نادرست و نامعتبر مندرج در
          این قرارداد خواهد بود.
        </p>

        <p>
          <strong>ماده 18) قانون حاکم و حل وفصل اختلافات</strong>
          <br />
          1. قرارداد حاضر ازهرجهت تابع قوانین و مقررات لازم الاجرا در جمهوری اسلامی ایران است.
          <br />
          2. تمامی اختلافات و دعاوی برآمده از این قرارداد یا مرتبط با آن مشتمل بر (و نه محدود به)
          انعقاد، اعتبار، فسخ، تفاسخ، خاتمه یا نقض، تفسیر، اجرا یا اعمال آن و مجادلات برآمده یا
          مرتبط با این قرارداد، قراردادهای فرعی و معاملات منعقده طبق آن، در صلاحیت هیئت داوری بورس و
          اوراق بهادار خواهد بود تابه وسیله رسیدگی نهایی و الزام آور مطابق با قواعد و آیین داوری حل
          وفصل گردد. علاوه بر قوانین و مقررات الزام آور، داور باید عرف تجاری مربوطه را نیز مدنظر
          قرار دهد. داوری می تواند از نشانی های مندرج در این قرارداد ازجمله نشانی رایانامه طرفین جهت
          امر ابلاغ استفاده نماید.
          <br />
          3. شرط داوری حاضر موافقت نامه ای مستقل از قرارداد اصلی تلقی می شود و درهرحال لازمالاجرا
          است.
          <br />
          4. حقوق، امتیازات و شیوه های مطالبه مذکور در قانون اصلاح قانون صدور چک مصوب 1397 برای
          دارنده چک های صیادی (عامل) به قوت و اعتبار خود باقی است.
        </p>

        <p>
          <strong>ماده 19) اقامتگاه قانونی طرفین</strong>
          <br />
          اقامتگاه طرفین همان است که در ماده یک قرارداد ذکر شده است. متقاضی و تامین کننده در صورت
          تغییر نشانی متعهد است اقامتگاه جدید خود را ظرف مدت حداکثر 7روز پس از تغییر به عامل اطلاع
          دهد. تا زمانی که نشانی جدید اعلام نشده، مکاتبات به آدرس قبلی ارسال می شوند و ابلاغ شده
          تلقی می شوند درهرصورت ابلاغ کلیه ابلاغ ها، مکاتبات، اعلامیه ها و اخطاریه های و نامه های
          مرتبط با این قرارداد به نشانی ایمیل طرفین مندرج در ماده 2این قرارداد، صحیحا و قانونا ابلاغ
          شده تلقی میگردد
        </p>


      </div>
    </div>
  );
};

export default Page14;
