import React from 'react';
import { PropTypes } from 'prop-types';

const Page1 = ({ agencyContract, qrValue }) => {
  if (!agencyContract) return null;
  console.log(agencyContract);

  return (
    <div className="contract-page page-1">
      <div className="text-justify leading-relaxed text-[10px]">
        <h3 className="font-bold mb-2 text-[10px]">مقدمه </h3>
        <p className="mb-3 pr-4 text-[10px]">
          <span className="font-bold text-[10px]">1)</span>
          تأمین مالی جمعی (Crowd funding) در معنای فراهم نمودن منابع مالی مورد نیاز شرکت‌ها از طریق
          جمع‌آوری سرمایه‌های خرد، یکی از ابزارهای نوین تأمین مالی در چارچوب بازار سرمایه به شمار
          می‌رود؛{' '}
        </p>

        <p className="mb-3 pr-4 text-[10px]">
          <span className="font-bold text-[10px]">2)</span>
          شرکت گروه سیوان تجارت یزد، فعال در حوزه بازرگانی مواد غذایی، در راستای بهبود عملکرد و
          توسعه کسب و کار خود، نیازمند جذب سرمایه به میزان{' '}
          {(agencyContract?.investor_request?.amount_of_investment || 0 / 1000).toLocaleString()}
          میلیون ریال می‌باشد؛
        </p>

        <p className="mb-3 pr-4 text-[10px]">
          <span className="font-bold text-[10px]">3)</span>
          شرکت سبدگردان ایساتیس پویا کیش به عنوان یکی از عاملین مجاز تأمین مالی جمعی، دارای مجوز
          تأمین مالی جمعی از شرکت فرابورس ایران به شماره 1008438/5/03 ، مورخ 15/05/1403 میباشد؛
        </p>

        <p className="mb-3 pr-4 text-[10px]">
          <span className="font-bold text-[10px]">4)</span>
          وفق توافقات طرفین، مقرر گردید شرکت سبدگردان ایساتیس پویا کیش، در چارچوب مفاد قرارداد حاضر
          و با رعایت مقررات مربوطه، ضمن قبولی سمت به عنوان عامل تأمین مالی جمعی، شرکت گروه سیوان
          تجارت یزد را در مسیر تأمین مالی و جذب سرمایه مورد نیاز، همراهی نماید؛
        </p>

        <p className="mb-3 pr-4 text-[10px]">
          <span className="font-bold text-[10px]">5)</span>
          سرمایه‌گذار با ثبت‌نام در سکوی تأمین مالی جمعی و واریز مبلغ سرمایه‌گذاری، ضمن امضاء و
          تأیید مفاد قرارداد حاضر، از طریق مشارکت در تأمین سرمایه در گردش متقاضی، نسبت به تأمین
          سرمایه مورد نیاز وی اقدام می‌نماید؛
        </p>

        <p className="mb-3 pr-4 text-[10px]">
          قرارداد &quot;تأمین مالی جمعی (Crowdfunding)&quot; حاضر (که از این پس به عنوان قرارداد
          مورد ارجاع قرار خواهد گرفت)، به استناد قوانین و مقررات مربوطه اعم از بند ب ماده 7 و ماده
          21 دستورالعمل تأمین مالی جمعی (مصوب 25/02/1397) و نیز مواد 10 و 219 قانون مدنی، میان اطراف
          زیر با آگاهی ایشان نسبت به شرایط و مقررات حاکم بر موضوع قرارداد، منعقد گردید. این قرارداد
          به همراه ضمائم آن که عضو لاینفک قرارداد می‌باشد، برای اطراف آن و نیز وراث و قائم‌مقام
          قانونی آنان الزام‌آور بوده و موجد حقوق و تعهدات مربوطه ایشان می‌باشد. هدف از نگارش این
          بند، بیان ساختار کلی قرارداد که نشانگر مبانی توافقات، انگیزه و قصد طرفین در اجرای این
          قرارداد است، می‌باشد. بدین ترتیب، اجرای قرارداد بر اساس حقوق و تعهدات مندرج در مواد آتی
          صورت پذیرفته و بند حاضر، صرفاً مبنای تفسیر و تبیین رویه اجرایی قرارداد می‌باشد.
        </p>

        <h3 className="font-bold  text-[10px]">ساختار کلی قرارداد </h3>
        <p className="mb-3 pr-4 text-[9px]">
          شرکت گروه سیوان تجارت یزد به منظور رشد، توسعه و تحقق برنامه‌های تجاری خود، نیازمند اجرای
          طرحی مشتمل بر خرید لیستی از دارایی‌ها (به شرح مذکور در پیوست 1) مجموعاً به مبلغ
          200,000,000,000 ریال، معادل 20,000,000,000 تومان میباشد که وفق قوانین و مقررات مربوطه،
          شرکت شخصاً، موظف به تأمین 10 درصد از مبلغ مزبور به میزان 20,000,000,000 ریال می‌باشد. بدین
          ترتیب، از مجموع سرمایه مورد نیاز، حداکثر 90 درصد از عموم اشخاص حقیقی و حقوقی قابل‌تأمین
          است. لذا شرکت قصد دارد سرمایه مورد نیاز را از مجرای بازار سرمایه و در چارچوب مقررات مربوط
          به تأمین مالی جمعی، فراهم آورد. بنابر توافق اطراف قرارداد، نحوه تأمین مالی وفق مفاد این
          قرارداد بر پایه مشارکت سرمایه‌گذاران در تأمین مالی شرکت از طریق خرید دارایی‌های مورد نیاز
          توسط متقاضی به وکالت از سرمایه‌گذار به مبلغ 20,000,000,000 ریال و فروش دارایی‌های خریداری‌
          شده به خود به وکالت از سرمایه‌گذار به مبلغ 281،000،000،000ریال و بدین شکل خواهد بود که
          سرمایه‌گذار، وفق ضوابط و مقررات استفاده از خدمات سکوی تأمین مالی جمعی عامل، اقدام به
          سرمایه‌گذاری در طرح متقاضی به میزان مدنظر خود مینماید. متعاقب سرمایه گذاری و واریز وجه
          توسط تأمین‌کننده، گواهی سرمایه گذاری به میزان رقم سرمایه‌گذاری شده برای تأمین‌کننده صادر و
          ایشان به تناسب رقم مندرج در گواهی مذکور، وفق مفاد این قرارداد طرف حق و تکلیف واقع می‌گردد.
          سرمایه‌گذار تا تاریخ اتمام طرح،حق مطالبه مبلغ سرمایه گذاری را نداشته و طی این مدت، تنها
          مستحق دریافت اقساط خرید دارایی به تناسب مبلغ یادشده، خواهدبود. تأمین کننده همزمان با
          سرمایه گذاری و صدورگواهی سرمایه گذاری به نام خود ، به سرمایه پذیر وکالت همزمان در خرید
          دارایی های مورد نیاز به مبلغ 281،000،000،000 ریال و فروش دارایی های خریداری شده به خود
          (سرمایه پذیر)به مبلغ 281،000،000،000 ریال اعطا می نماید. بدین ترتیب، به مجرد سرمایه گذاری
          تأمین کننده در طرح کسب و کار متقاضی، رابطه وکیل و موکل میان سرمایه گذار و سرمایه پذیر
          برقرار شده و سرمایه‌پذیر، وکیلِ سرمایه گذار در خرید دارایی های مورد نیاز با استفاده از
          مبلغ سرمایه گذاری تأمین کننده و نیز فروش دارایی های خریداری شده به خود (سرمایه پذیر) می
          باشد. پس از سرمایه گذاری و اعطای وکالت مزبور، سرمایه پذیر، اقساط دارایی های خریداری شده را
          وفق مفاد این قرارداد و در مواعد مقرر، به تناسب مشارکت هر سرمایه گذار در تأمین مالی و رقم
          سرمایه گذاری، به وی پرداخت خواهد نمود. شرکت سبدگردان ایساتیس پویا ، به عنوان عامل تأمین
          مالی جمعی، حافظ منافع سرمایه گذار در این مسیر بوده و تأمین کننده با سرمایه گذاری و امضای
          ذیل این قرارداد، به عامل وکالت در اخذ اقساط دوره ای از سرمایه پذیر و واریز به حساب خود
          (سرمایه گذار) و نیز وکالت در پیگیری حقوق خود در برابرسرمایه پذیر را اعطا می نماید.
          بنابراین، سرمایه گذار، به مجرد سرمایه گذاری و امضای این قرارداد، تحت هیچ عنوان، شخصاً حق
          پیگیری امور مربوط به این قرارداد از قبیل طرح دعوا نسبت به پرداخت اقساط دوره ای و بازپرداخت
          مبلغ سرمایه گذاری را نداشته و با سرمایه گذاری و اعطای وکالت با حق توکیل به غیر و انتخاب
          وکیل دادگستری به عامل، حق انجام موضوع وکالت را تا پایان مدت طرح متقاضی از خود سلب و ساقط
          می نماید.
        </p>
      </div>
    </div>
  );
};

Page1.propTypes = {
  agencyContract: PropTypes.object.isRequired,
  qrValue: PropTypes.string.isRequired,
};

export default Page1;
