/* eslint-disable react/prop-types */
const Page14 = ({ data }) => {
  if (!data) return null;

  return (
    <div className="contract-page page-1">
      <div className="text-justify leading-relaxed text-[23px] space-y-6">
        <p>
          <strong>ماده 13) افشای اطلاعات</strong>
          <br />
          الف) متقاضی متعهد است اطلاعات زیر را در اختیار عامل قرار دهد:
          <br />
          1. مدارک مستندات، اطلاعات، بازه های زمانی پرداخت سرمایه، شرایط و زمان بندی اجرای طرح یا
          برنامه کسب وکار
          <br />
          2. مدارک یا مجوزهای موردنیاز طرح؛ تبصره- مسئولیت اخذ کلیه پروانه ها و مجوزهای قانونی
          موردنیاز طرح با متقاضی است و درصورتی که به واسطه عدم طی تشریفات قانونی موردنیاز برای اخذ
          این موارد به هر علت اعم از تصمیم یک طرفه مراجع قانونی ذی صلاح جهت اعطای مجوزهای قانونی
          مزبور، این مجوزها تحصیل نگردد یا به هر علت مجوزهای اعطایی پیشین لغو شوند، این امر تاثیری
          در تعهدات متقاضی مندرج در ماده 9فوق ندارد و مسئولیت جبران خسارات وارده به عامل و تامین
          کنندگان و نهاد مالی با متقاضی است.
          <br />
          3. سایر موارد اعلامی توسط کارگروه ارزیابی.
          <br />
          4. الزامات و گزارش های دورهای که حسب مورد عامل مقرر میدارد.
          <br />
          5. افشای دعاوی حقوقی و کیفری مطروحه علیه یا له متقاضی یا اعضای هیئت مدیره و مدیرعامل آن یا
          طرح.
          <br />
          6. مشخصات اعضای حقیقی و حقوقی عضو هیئت مدیره.
          <br />
          7. مشخصات سهامداران شرکت متقاضی.
          <br />
          8. امتیازات سهام ممتاز و نصاب سهام سهامداران ممتاز در صورت وجود.
          <br />
          9. لیست دارایی و بدهیها.
          <br />
          تبصره- حداقل مفاد برنامه کسب وکار متقاضی به شرح پیوست شماره سه این قرارداد است.
          <br />
          ب)موارد موضوع این ماده اسرار تجاری و اطلاعات محرمانه نیست و عامل حق دارد تمام یا بخشی از
          اطلاعات مندرج در بند فوق را جهت رعایت شفافیت در فرایندهای تامین مالی جمعی، به صورت عمومی
          نمایش دهد یا در مذاکرات جذب منابع مالی، آنها را به تامین کنندگان ارائه و افشا کند. افشا و
          انتشار موارد موضوع این بند، مشمول هیچکدام از تعهدات رعایت محرمانگی نبوده و عامل هیچگونه
          مسئولیتی در قبال ارائه و انتشار این اطلاعات ندارد.
          <br />
          <p>
            ج)متقاضی متعهد است تمامی قراردادهای باز برای فروش محصولات مندرج در طرح و همچنین محصولات
            تولید شده با منابع داخلی شرکت را به اطلاع عامل برساند بدیهی است معیار تولید، فروش این
            محصولات و سود حاصل شده در طرح بر اساس این اطلاعات و به تشخیص عامل خواهد بود. از زمان
            امضا، تمامی درآمدهای حاصل از فروش این محصول در قبل یا بعد تاریخ قرارداد به این قرارداد
            منتقل می شود.
          </p>
        </p>
        <p>
          <strong>ماده 14) عدم تضمین موفقیت طرح در جذب سرمایه</strong>
          <br />
          عامل تنها بستری جهت تامین مالی جمعی برای متقاضی و تامین کنندگان فراهم می نماید. ازاین رو
          عامل تحت هیچ عنوان مواردی اعم از موفقیت طرح در جذب سرمایه و مانند آن را تضمین نمی نماید.
        </p>
        <p>
          <strong>ماده 15) حوادث ناگهانی و فورس ماژور</strong>
          <br />
          1. هرگاه اجرای تمام یا بخشی از قرارداد به واسطه علتی خارجی، مقاومت ناپذیر و غیر قابل پیش
          بینی غیرممکن شود یا به تاخیر افتد، عامل یا متقاضی که در این وضعیت قرار گرفته است مسئول
          جبران خسارات ناشی از عدم اجرا یا تاخیر در اجرای قرارداد نیست. در این صورت وی مکلف است در
          اسرع وقت( حداکثر 7روز) از تاریخ اطلاع از شرایط فورس ماژور، مراتب را کتباً به طرف مقابل
          اطلاع دهد.
          <br />
          2. معافیت از مسئولیت موضوع این ماده، شامل تعهد مندرج در قرارداد نیست.
          <br />
          3. تعهد متقاضی و ضامن نسبت به این بند در مقابل تامین کنندگان از جنس تعهد به نتیجه است.
        </p>
        <p>
          <strong>ماده 16) فسخ قرارداد</strong>
          <br />
          1. قرارداد حاضر عقدی لازم الاتباع و لازم الاجراست و تنها در موارد زیر منحل می گردد:
          <br />
          الف) درصورت نقض هر یک از شروط قرارداد توسط متقاضی یا تامین کننده، عامل حق فسخ قرارداد حاضر
          را (بدون نیاز به اجرای تشریفات قضایی الزام به اجرای عین تعهد) دارد؛ درصورتی که عامل
          قرارداد را در مقابل هرکدام از تامین کنندگان فسخ کند، این قرارداد صرفا در مقابل همان تامین
          کننده، فسخ می گردد.
          <br />
          ب) درصورت انحلال ضامن یا متقاضی یا صدور حکم ورشکستگی هرکدام از ایشان، عامل می تواند
          قرارداد حاضر را ظرف مهلت 15 روز از تاریخ اطلاع از تحقق هر کدام از این موارد فسخ نماید.
          <br />
          2. طرفین می توانند با توافق با یکدیگر قرارداد حاضر را اقاله نمایند.
          <br />
          3. اعمال حق فسخ مندرج در این قرارداد توسط عامل، مانع مطالبه خسارات وارده به وی نیست.
          <br />
          4. متقاضی، ضامن، تامین کننده و نهاد مالی حق فسخ قرارداد حاضر را جز در مواقعی که کارگروه
          ارزیابی عدم اجرای تعهدات عامل را تایید کند، از خود سلب و ساقط نموده اند.
          <br />
          5. متقاضی از تاریخ امضای این قرارداد حق انصراف از اجرای قرارداد را جز در حالتی که عامل
          موافقت کتبی پیشین خود را اعلام کرده باشد ندارد و در غیر این صورت مصداق نقض تعهدات متقاضی
          بوده و وی متعهد به پرداخت 150 درصد اصل سرمایه حداکثر تا 10 روز پس از نامه کتبی عامل به
          متقاضی به عنوان وجه التزام می باشد.
        </p>
      </div>
    </div>
  );
};

export default Page14;
