import React from 'react';
import { PropTypes } from 'prop-types';

const Page5 = ({ data }) => {
  if (!data) return null;
  return (
    <div className="contract-page page-1">
      <div className="text-justify leading-relaxed text-[23px] space-y-6">
        <p className="text-justify leading-relaxed text-[23px]">
          13) در صورت قصور یا تقصیر متقاضی نسبت به هر یک تعهدات خود در هر یک از مفاد این قرارداد، یا
          عدم اجرای تعهدات به هر دلیلی به جز موارد مندرج در ماده 10 (حوادث ناگهانی و فورس‌ماژور)،
          تهیه کلیه لوازم و مقدمات حقوقی و کلیه هزینه‌های مربوط به وصول مطالبات، اجرای تضامین، اعم
          از هزینه‌ها و کارمزدهای دادرسی، اداری، بانکی و حق الوكاله، هزینه‌های نمایندگان قضایی،
          هزینه‌های اجرایی و ثبتی، واخواست، اخذ مجوزهای مربوطه و کارشناسی اموال و هرنوع هزینه دیگری
          در جهت وصول مطالبات به عهده متقاضی بوده و متقاضی ملزم به پرداخت آن می‌باشند. متقاضی ضمن
          عقد لازم حاضر به عامل وکالت و اختیار دادند تا عامل، کلیه هزینه‌های مربوطه را تحت هر عنوان
          که باشد حسب تشخیص خود از محل هرگونه وجوه و دارائی وحساب نامبردگان برداشت نماید.
        </p>
        <p className="text-justify leading-relaxed text-[23px]">
          14) متقاضی متعهـد ملتـزم گردیده وجـه التـزام تـأخیر تأدیـه و سایر خسـارات و جرایم را بدون
          هرگونه اعتراض و براساس محاسبات و تشخیص عامل پرداخت نماینـد و پرداخـت وجـه التـزام و
          خسـارات و جرایم مذکور در ایـن قرارداد از سـوی متقاضی، بـدل از هیچکـدام از تعهـدات آنهـا در
          قبـال عامل نمـی‌باشـد و متقاضی این قرارداد، به موجب این قرارداد و ضمن عقد صلح بلاعوض خارج
          لازم حـق هرگونـه ایـراد، اعتـراض و ادعـایی را در این زمینه از خود سلب و ساقط می‌نماید.
        </p>

        <p className="text-justify leading-relaxed text-[23px]">
          15) تخلف تؤامان متقاضی، در پرداخت هر یک از اقساط بند 1 ماده 5 این قرارداد، موجب زوال مواعد
          اقساط و حال شدن دیون می‌شود و عامل الزامی در انتظار حلول مواعد مقرر در قراردادها جهت وصول
          حقوق و مطالبات خود نخواهد داشت.
        </p>

        <p className="text-justify leading-relaxed text-[23px]">
          16) متقاضی مسئول جبران خسارت وارده به دارندگان گواهی‌های شراکت به واسطه قصور، یا تقصیر یا
          عدم رعایت قوانین و مقررات می‌باشد. در این صورت متقاضی متعهد است کلیه مبالغ پیش‌بینی شده در
          بند مربوط به روال اتمام قرارداد را اعم از اصل، متفرعات و جریمه را پرداخت نماید. در این
          صورت ادامه یا خاتمه قرارداد با تصمیم عامل انجام می‌پذیرد و برای متقاضی لازم الاجراست.
        </p>
        <p className="text-justify leading-relaxed text-[23px]">
          17) متقاضی موظف است کلیه تعهدات خود در رابطه با این قرارداد را با رعایت صرفه و صلاح عامل و
          دارندگان گواهی‌های شراکت به انجام برساند و با رعایت امانت نسبت به هزینه کرد وجوه جمع‌آوری
          شده اقدام نماید. در غیر این صورت، متقاضی مسئول کلیه خساراتی است که از این طریق به عامل و
          دارندگان گواهی‌های شراکت وارد می‌شود.
        </p>

        <p className="text-justify leading-relaxed text-[23px]">
          18) متقاضی متعهد است در نگهداری اموال و دارایی‌های موضوع طرح به نحو متعارف بکوشد. در غیر
          این صورت، متقاضی، ضامن خسارات وارده می‌باشد.
        </p>

        <p className="text-justify leading-relaxed text-[23px]">
          19) متقاضی متعهد است در چارچوب قوانین کشور نسبت به پرداخت کلیه هزینه‌های بیمه اعم از بیمه
          مربوط به دارایی‌های طرح و ....، مالیات، عوارض و... رأسا اقدام نماید و دریافت مفاصا
          حساب‌های مالیاتی، بیمه، عوارض و .. ناشی از انجام این قرارداد بر عهده متقاضی است.
        </p>

        <p className="text-justify leading-relaxed text-[23px]">
          20) متقاضی متعهد است تا نسبت به تهیه و ارائه گزارش‌های دوره‌ای سه ماهه اجرای طرح از تاریخ
          موفقیت کمپین با مهلت ارائه گزارش حداکثر 10 روز پس از تاریخ‌های درخواستی عامل اقدام نماید.
        </p>

        <p className="text-justify leading-relaxed text-[23px]">
          21) متقاضی متعهد است نسبت به ارائه صورت‌های مالی حسابرسی شده/نشده شش ماهه طرح موضوع
          قرارداد از تاریخ موفقیت کمپین با مهلت ارائه صورت‌های مالی حداکثر 20 روز پس از تاریخ‌های
          اعلام شده توسط عامل اقدام نماید.
        </p>
        <p className="text-justify leading-relaxed text-[23px]">
          22) متقاضی متعهد است نسبت به ارائه صورت‌های مالی حسابرسی شده سالیانه طرح موضوع قرارداد و
          پس از پایان طرح، از تاریخ موفقیت کمپین با مهلت ارائه صورت‌های مالی حسابرسی شده حداکثر 30
          روز پس از تاریخ‌های اعلام شده توسط عامل اقدام نماید.
        </p>

        <p className="text-justify leading-relaxed text-[23px]">
          <span className="font-bold text-[23px]">تبصره 18:</span>
          مواعد ارائه گزارش‌های دوره‌ای و صورت‌های مالی طرح موضوع قرارداد، پس از موفقیت کمپین توسط
          عامل طی نامه کتبی به متقاضی اعلام می‌گردد و متقاضی متعهد به ارائه آنها است. در صورت عدم
          ارائه موارد مطروحه در بندهای 20، 21 و22 این ماده در مواعد مقرر، متقاضی ملزم به پرداخت وجه
          التزام روزانه به مبلغ 20,000,000 (بیست میلیون ریال) به ازای هر روز تأخیر خواهد بود.
        </p>

        <p className="text-justify leading-relaxed text-[23px]">
          <span className="font-bold text-[23px]">تبصره 19:</span>
          در صورت ارائه گزارش‌ها و صورت‌های مالی صوری و خلاف واقع توسط متقاضی، متقاضی ملزم به پرداخت
          وجه التزام به مبلغ 500,000,000 ریال معادل (پانصد میلیون ریال) خواهد بود و متعهد است سریعاً
          ظرف مدت حداکثر 5 روز کاری نسبت به اصلاح گزارش/صورت مالی اقدام نماید. در صورت عدم ارائه
          گزارش/صورت مالی اصلاح شده در موعد مقرر که به تأیید عامل نیز رسیده باشد، عامل می‌تواند
          رأساً نسبت به فسخ قرارداد اقدام نماید و حق شکایت کیفری و حقوقی در خصوص ارائه گزارش و صورت
          مالی صوری و خلاف واقع برای عامل محفوظ است.
        </p>
        <p className="text-justify leading-relaxed text-[23px]">
          23) متقاضی متعهد است بصورت سه ماه یک بار همزمان با مواعد پرداخت اقساط مندرج در بند 1 این
          ماده، نسبت به ارائه حساب معین چهار ستونی شرکت اصلی اقدام نماید.
        </p>

        <p className="text-justify leading-relaxed text-[23px]">
          <span className="font-bold text-[23px]">تبصره 20:</span>
          در صورت عدم ارائه حساب معین چهار ستونی شرکت اصلی در مواعد مقرر توسط متقاضی، عامل مخیر به
          فسخ قرارداد است و در صورت فسخ، متقاضی متعهد است روال اتمام قرارداد را طی نماید.
        </p>

        <p className="text-justify leading-relaxed text-[23px]">
          <span className="font-bold text-[23px]">تبصره 21:</span>
          عملکرد متقاضی توسط عامل بصورت مستمر بر اساس حساب معین چهار ستونی شرکت اصلی، پایش و نظارت
          می‌گردد، در صورت مشاهده هرگونه انحراف از سودآوری پیش‌بینی شده و شناسایی زیان، عامل مخیر به
          فسخ قرارداد است و در صورت فسخ، اصل مبلغ قرارداد و متفرعات به میزان دوره نگهداری از متقاضی
          اخذ می‌گردد و متقاضی متعهد است روال اتمام قرارداد را طی کند.
        </p>
        <p className="text-justify leading-relaxed text-[23px]">
          <span className="font-bold text-[23px]">تبصره 22:</span>
          عامل هیچگونه تعهدی نسبت به زیان شناسایی نشده در حساب معین چهار ستونی و اظهار آن در
          گزارش‌های دوره‌ای آتی متقاضی ندارد و متقاضی حق هرگونه ادعایی را در این خصوص از خود سلب و
          اسقاط نموده است.
        </p>
        <p className="text-justify leading-relaxed text-[23px]">
          24) متقاضی که اقدام به امضای این قرارداد نموده‌است، متضامناً مسئول پرداخت کلیه مبالغ بند 1
          موضوع ماده 5 این قرارداد به عامل می باشد.
        </p>
      </div>
    </div>
  );
};

Page5.propTypes = {
  data: PropTypes.object.isRequired,
};

export default Page5;
