/* eslint-disable react/prop-types */
const Page11 = ({ data }) => {
  if (!data) return null;

  return (
    <div className="contract-page page-1">
      <div className="text-justify leading-relaxed text-[23px] space-y-6">
      <p>
          اين قرارداد از زمان امضاي قرارداد، تا 15 روز كاري پس از اتمام مدت فراخوان جمع آوري وجوه از
          اعتبار قانوني برخوردار است. زمان قرارداد به صلاحديد عامل به طور خودكار و طي ارسال نامه
          كتبي به متقاضي قابل تمديد است.
        </p>

        <p className="font-bold">ماده 7) تعهدات ضامن</p>

        <p>
          1. ضامن در کمال صحت عقل و اراده و به قصد ضمانت، اعلام و تضمین می نماید از مفاد تعهدات
          متقاضی در سراسر قرارداد، قوانین و مقررات لازم الاجرا مطلع است و هیچ موردی باقی نمانده است
          تا در برابر آن به عذر عدم اطلاع متعذر گردد.
        </p>

        <p>
          2. مسئولیت ضامن در این قرارداد، از نوع مسئولیت تضامنی است (حتی اگر در بندی از قرارداد به
          نوع این مسئولیت اشاره نشده باشد)؛ لذا متقاضی و ضامن هر دو تماما مسئول ایفای کلیه تعهدات
          مندرج در این قرارداد هستند و متقاضی حق ندارد در برابر سایر طرفین به اموری همچون نقل ذمه به
          ذمه، تبدیل تعهد و غیره استناد نماید.
        </p>
      <p>
          3. ضامن اعلام و تضمین می نماید که در اساسنامه، اسناد تاسیس، مصوبات هیئت مدیره، مجامع
          عمومی، قراردادهای وی و غیره، هیچگونه شرط، مقرره، آیین نامه یا مفادی ذکر نشده است که جهت
          انعقاد قرارداد حاضر و ایفای تعهدات مندرج در آن، محدودیت یا ممنوعیتی ایجاد نماید. درهرصورت
          هرگونه شرط یا کشف وضعیتی خلاف آن ازجمله شامل (و نه محدود به) محدودیت اختیارات مدیران یا
          شرایطی مانند آیین نامه معاملات داخلی و غیره تنها در روابط داخلی ایشان، معتبر و حکم فرما
          است و در مقابل سایر طرفین این قرارداد غیرقاب استناد و اعتنا می باشد.
        </p>

        <p>
          4. ضامن متعهد است ضمن ارائه گواهی عدم سوءپیشینه اعضای هیئت مدیره خود، گواهی اعتبارسنجی
          مالی از سوی موسسات رتبه بندی معتبر تهیه و به عامل ارائه نماید.
        </p>

        <p>
          5. ضامن متعهد است ظهر اسناد تجاری و تضامین متقاضی را به عنوان ضامن امضا نماید. درصورتی که
          امکان ثبت ضمانت در سامانه صیاد فراهم نباشد، ضامن متعهد است راسا نسبت به صدور اسناد تجاری
          تضامین طبق شرایط و مبالغ مندرج در همین قرارداد اقدام نماید. این تضامین جایگزین، بدل یا
          تبدیل تعهد اسناد تضامین متقاضی و تعهدات وی نیستند و عامل حق دارد درهرصورت نسبت به تضامین
          صادره توسط متقاضی و ضامن (یا هر دوی آنها) اجتماعا یا انفرادا اقدام کند.
        </p>

        <p className="font-bold">ماده 8) تاییدات و اقرار متقاضی</p>

        <p>
          1. متقاضی تأیید و اقرار می‌نماید برای انعقاد قرارداد حاضر و اجرای طرح تمامی مجوزهای لازم
          را اخذ نموده است.
        </p>
        <p>
          2. متقاضی تأیید و اقرار می‌نماید اجرای طرح موضوع ماده 3 این قرارداد، قطعاً سودآور خواهد
          بود. به استناد این بند عامل مخیر به فسخ قرارداد است.
        </p>

        <p>
          3. در صورت عدم ایفای تعهدات در موعد مقرر توسط متقاضی، مراتب به استحضار متقاضی رسیده و
          تضامین جهت اجرا در دستور کار قرار می‌گیرد.
        </p>

        <p>
          4. متقاضی تأیید و اقرار می‌نماید اطلاعات مالی ارسالی به عامل تماماً از دفتر اصلی متقاضی
          خواهد بود.
        </p>

        <p>
          تبصره: در صورت هرگونه تخلف متقاضی در ثبت وقایع مالی شرکت در دفتر اصلی و عدم ارائه اطلاعات
          به عامل از دفتر اصلی، عامل مخیر به فسخ قرارداد و اقدامات قانونی لازم خواهد بود.
        </p>

        <p>
          5. متقاضی تأیید و اقرار می‌نماید که عامل حق دارد نظارت بر اجرای موضوع ماده 3 قرارداد را پس
          از تأمین مالی به صورت دوره‌ای انجام دهد و در صورت دریافت گزارش هرگونه انحراف از برنامه
          کسب‌و‌کار با اهداف تعیین شده، مراتب را به استحضار دارندگان گواهی‌های شراکت و متقاضی برساند
          و در صورت عدم اصلاح توسط متقاضی، مراتب را به مراجع ذیصلاح ارجاع دهد.
        </p>

        <p>
          6. متقاضی تأیید و اقرار می‌نماید که عامل مختار به اقدام قانونی علیه هرگونه تقلب یا پنهان
          کاری کشف شده از متقاضی در هر زمانی است.
        </p>

        <p>
          7. متقاضی تأیید و اقرار می‌نماید که عامل حق دارد کلیه عملیات تجاری، محاسباتی و مالی متقاضی
          را در خصوص این قرارداد در هر زمان بازرسی و رسیدگی کند، متقاضی موظف است به محض درخواست عامل
          این اسناد و مدارک را در اختیار وی قرار دهد.
        </p>

        <p>
          8. متقاضی تأیید و اقرار می‌نماید که عامل می‌تواند کلیه گزارشات و صورت‌های مالی را که از
          طرف متقاضی به وی واصل شده است، منتشر کند و متقاضی نمی‌تواند هیچ‌گونه ادعایی در رابطه با
          نقض محرمانگی این اطلاعات داشته باشد.
        </p>
        <p>
          9. متقاضی تأیید و اقرار می‌نماید که در کلیه امور این قرارداد، عامل به وکالت از دارندگان
          گواهی‌های شراکت می‌باشد، لذا در صورت هرگونه تخلف متقاضی، عامل رأسا و بدون هیچ قید و شرطی
          به اجرا گذاشتن تضامین در جهت بازگرداندن اصل و سود سرمایه دارندگان گواهی‌های شراکت و سایر
          هزینه‌ها و خسارت‌ها اقدام نموده و حسب مورد امکان پیگیری‌های اداری و قضایی لازم را دارد.
        </p>

        <p>
          10. متقاضی تأیید و اقرار نمود که عامل حـق دارد از هرگونـه وجـوهی کـه در ازای عدم ایفای
          تعهدات ناشـی از ایـن قـرارداد از طـرف متقاضی پرداخت می‌گردد و یا از حساب‌ها و اموال و
          اسناد برداشت می‌شود، ابتدا کل هزینه‌های دادرسی و قضایی و ثبتی و بیمه و حق الوکاله متعلقـه
          و هزینه‌های پرداختی از قبیل کارشناسی، ارزیابی و کارمزد تا آن تاریخ را کسر و محاسبه نموده و
          متقاضی حق هرگونه ایراد و اعتراض نسبت به تشخیص عامل و محاسبات به عمـل آمـده را از خود سلب و
          اسقاط نمود.
        </p>

       


      </div>
    </div>
  );
};

export default Page11;
