import React from 'react';
import { PropTypes } from 'prop-types';

const Page6 = ({ data }) => {
  if (!data) return null;

  return (
    <div className="contract-page page-1">
      <div className="text-justify leading-relaxed text-[23px] space-y-6">
      <p className="text-justify leading-relaxed text-[23px]">
          <span className="font-bold text-[23px]">تبصره 19:</span>
          در صورت ارائه گزارش‌ها و صورت‌های مالی صوری و خلاف واقع توسط متقاضی، متقاضی ملزم به پرداخت
          وجه التزام به مبلغ 500,000,000 ریال معادل (پانصد میلیون ریال) خواهد بود و متعهد است سریعاً
          ظرف مدت حداکثر 5 روز کاری نسبت به اصلاح گزارش/صورت مالی اقدام نماید. در صورت عدم ارائه
          گزارش/صورت مالی اصلاح شده در موعد مقرر که به تأیید عامل نیز رسیده باشد، عامل می‌تواند
          رأساً نسبت به فسخ قرارداد اقدام نماید و حق شکایت کیفری و حقوقی در خصوص ارائه گزارش و صورت
          مالی صوری و خلاف واقع برای عامل محفوظ است.
        </p>
        <p className="text-justify leading-relaxed text-[23px]">
          23) متقاضی متعهد است بصورت سه ماه یک بار همزمان با مواعد پرداخت اقساط مندرج در بند 1 این
          ماده، نسبت به ارائه حساب معین چهار ستونی شرکت اصلی اقدام نماید.
        </p>

        <p className="text-justify leading-relaxed text-[23px]">
          <span className="font-bold text-[23px]">تبصره 20:</span>
          در صورت عدم ارائه حساب معین چهار ستونی شرکت اصلی در مواعد مقرر توسط متقاضی، عامل مخیر به
          فسخ قرارداد است و در صورت فسخ، متقاضی متعهد است روال اتمام قرارداد را طی نماید.
        </p>

        <p className="text-justify leading-relaxed text-[23px]">
          <span className="font-bold text-[23px]">تبصره 21:</span>
          عملکرد متقاضی توسط عامل بصورت مستمر بر اساس حساب معین چهار ستونی شرکت اصلی، پایش و نظارت
          می‌گردد، در صورت مشاهده هرگونه انحراف از سودآوری پیش‌بینی شده و شناسایی زیان، عامل مخیر به
          فسخ قرارداد است و در صورت فسخ، اصل مبلغ قرارداد و متفرعات به میزان دوره نگهداری از متقاضی
          اخذ می‌گردد و متقاضی متعهد است روال اتمام قرارداد را طی کند.
        </p>
        <p className="text-justify leading-relaxed text-[23px]">
          <span className="font-bold text-[23px]">تبصره 22:</span>
          عامل هیچگونه تعهدی نسبت به زیان شناسایی نشده در حساب معین چهار ستونی و اظهار آن در
          گزارش‌های دوره‌ای آتی متقاضی ندارد و متقاضی حق هرگونه ادعایی را در این خصوص از خود سلب و
          اسقاط نموده است.
        </p>
        <p className="text-justify leading-relaxed text-[23px]">
          24) متقاضی که اقدام به امضای این قرارداد نموده‌است، متضامناً مسئول پرداخت کلیه مبالغ بند 1
          موضوع ماده 5 این قرارداد به عامل می باشد.
        </p>

        <p className="text-justify leading-relaxed text-[23px]">
          25) متقاضی تعهد می‌نماید حسابرسی سود قطعی گواهی‌های شراکت توسط حسابرس متقاضی انجام پذیرد.
          عامل به عنوان ناظر قرارداد، در صورت وجود هرگونه اختلاف در خصوص گزارش ارائه شده، مخیر است
          نسبت به تعیین حسابرس جدید از لیست حسابرسان معتمد سازمان بورس و اوراق بهادار اقدام نماید و
          متقاضی متعهد است تمامی همکاری‌های لازم را با حسابرس جدید جهت محاسبۀ سود قطعی گواهی‌های
          شراکت و حسابرسی ویژه به‌عمل آورد.
        </p>
        <p className="text-justify leading-relaxed text-[23px]">
          26) متقاضی حق هرگونه نقل و انتقال نسبت به تأمین مالی انجام شده را به هر شکل (اعم از اعطای
          وکالت و یا غیر آن) به غیر را جزئاً و کلاً از خود سلب و اسقاط نمود، در غیر اینصورت عامل
          می‌تواند تأمین مالی انجام شده را تبدیل به دین حال نموده و بدون اخطار قبلی اقدام به وصول
          کلیه مطالبات خود از متقاضی متفق یا منفرد اعم از اصل و سود و وجوه التزام و خسارات متعلقه و
          سایر هزینه‌های مربوطه بنماید.
        </p>
        <p className="text-justify leading-relaxed text-[23px]">
          27) متقاضی متعهد است برگزاری هرگونه مجمع را به اطلاع عامل رسانده و یک نسخه از صورتجلسه را
          برای عامل ارسال نماید.
        </p>

        <p className="text-justify leading-relaxed text-[23px]">
          28) متقاضی تضمین می نماید هیچگونه شرط قراردادی یا مقررهای در اساسنامه یا سایر اسناد تاسیس
          و نیز صورتجلسات مجامع عمومی و هیئت مدیره یا توافق داخلی میان سهامداران یا صاحبان سهم
          الشرکه متقاضی وجود ندارد که به نحوی از انحاء یا تحت هرگونه شرایطی در انعقاد قرارداد با
          عامل، نهاد مالی یا تامین کنندگان محدودیتی ایجاد نماید یا مانع آن شود یا به تضییع حقوق
          قانونی و قراردادی ایشان منتهی گردد. درهرصورت هرگونه شرط یا توافقی که ناقض این بند باشد،
          تنها در روابط میان همان اشخاص معتبر است و در مقابل اشخاص ثالث اعم از تامین کنندگان، عامل و
          نهاد مالی غیرقابل استناد است.
        </p>

        <p className="text-justify leading-relaxed text-[23px]">
          29) کافه خیارات ولو خیار غبن هر چند فاحش یا افحش از متقاضی سلب و اسقاط شد.
        </p>
        <p className="text-justify leading-relaxed text-[23px]">
          30) متقاضی متعهد است درخواست خود را در فرمهای تعیین شده در سکوی عامل تکمیل و ارائه کند.
          کلیه ارتباطات و اطلاعیه ها و مانند آن میان متقاضی و عامل از طریق اطلاعات اعلامی متقاضی در
          سکوی عامل صورت میگیرد.
        </p>
        <p className="text-justify leading-relaxed text-[23px]">
          31) متقاضی اعلام می کند که از ریسک ها و مقررات حاکم ازجمله ریسک های سرمایه گذاری در شرکت
          ها و نیز شرایط و ضوابط فعالیت عامل مندرج در وبگاه عامل کاملاً مطلع است.
        </p>
        <p className="text-justify leading-relaxed text-[23px]">
          32) متقاضی با امضای این قرارداد، همه قوانین، مقررات و اصلاحات مصوب سازمان بورس اوراق
          بهادار، شورای عالی بورس، شرکت فرابورس ایران و کارگروه ارزیابی را می پذیرد و متعهد به ایفای
          تمام وظایف و تعهدات خود مطابق قرارداد و قوانین و مقررات لازمالاجرا است. همچنین متقاضی
          متعهد است به شاخصهای کلیدی عملکرد و اهداف و برنامه های مصوب دست یابد و با ناظر فنی قرارداد
          غیر منتفع (با شرط امضای قرارداد عدم افشای اطلاعات) تعیین شده توسط عامل همکاری نماید.
        </p>
        <p className="text-justify leading-relaxed text-[23px]">
          33) متقاضی متعهد است طبق استانداردهای موجود و مبتنی بر واقعیت و صداقت نسبت به ارائه طرح
          کسب وکار و تکمیل و ارائه اطلاعات مورد درخواست عامل اقدام نماید و از درج اطلاعات نادرست،
          نامعتبر، موهوم و غیرواقعی خودداری کند. متقاضی اقرار میکند مالک پروژه است که در سکوی عامل
          بارگذاری نموده است و این طرح مصون از حقوق و ادعاهای اشخاص ثالث است؛ در غیر این صورت متعهد
          است 150 درصد مبلغ سرمایه موردنیاز را به عنوان وجه التزام به عامل پرداخت نماید.
        </p>
        <p className="text-justify leading-relaxed text-[23px]">
          تبصره: به منظور ارائه اطلاعات موردنیاز برای طرح، متقاضی متعهد است فهرستی از دیون و بدهی
          های شرکت، وضعیت مالیاتی آن، قراردادهای مرتبط با طرح را در تاریخ قرارداد و همچنین شروع
          تامین مالی، به عامل ارائه نماید که به پیوست این قرارداد موجود است. لازم به ذکر است باتوجه
          به اینکه بخشی از منابع مالی موردنیاز از تامین مالی جمعی جمع آوری می شود زمان قابل قبول
          برای هزینه کردها و میزان قابل قبول به تشخیص عامل خواهد بود.
        </p>
        


      </div>
    </div>
  );
};

Page6.propTypes = {
  data: PropTypes.object.isRequired,
};

export default Page6;
