import React from 'react';
import { PropTypes } from 'prop-types';

const Page16 = ({ data }) => {
  if (!data) return null;

  return (
    <div className="contract-page page-1">
      <div className="text-justify leading-relaxed text-[23px] space-y-6">
        <div>
          <h3 className="font-bold">ماده 9)شرایط اتمام قرارداد</h3>
          <h4 className="font-bold mr-4">1. شرایط فسخ:</h4>
          <div className="mr-8">
            <p>
              1-1- پس از موفقیت کمپین، متقاضی صرفاً با ارائه ادله مکفی و پذیرش عامل، مجاز به ارائه
              درخواست فسخ خواهد بود. عامل در پذیرش یا رد درخواست فسخ مختار خواهد بود. در این صورت
              متقاضی ضمن پرداخت کارمزد ماده 4 قرارداد عاملیت به شماره 13702295421/12/03روال اتمام
              قرارداد را طی خواهد نمود.
            </p>
            <p>
              1-2- عامل مجاز است در صورت مشاهده هرگونه انحراف از اهداف تعیین شده، بنا بر صلاحدید خود
              و به صرف اعلام به متقاضی، قرارداد را فسخ نماید. در این صورت متقاضی روال اتمام قرارداد
              را مطابق بند 4 این ماده طی خواهد نمود.
            </p>
            <p>
              1-3- در صورت تخطی متقاضی از تعهدات یا روح این قرارداد (اعم از تأخیر یا عدم پرداخت
              اقساط، تأخیر یا عدم اجرای طرح، تخلف در اجرای طرح، عدم ارائه گزارش‌های دوره‌ای و
              صورت‌های مالی، ارائه گزارش‌ها و صورت‌های مالی خلاف واقع و ......) یا بیشتر شدن مجموع
              جرائم متقاضی طبق مفاد این قرارداد از 2 درصد مبلغ کل قرارداد، به صورت يكطرفه به عامل
              اجازه فسخ قرارداد داده می‌شود. در این صورت متقاضی روال اتمام قرارداد را مطابق بند 4
              این ماده طی خواهد نمود.
            </p>
            <p>1-4- ورشکستگی یا انحلال متقاضی</p>
            <p>1-5- محکومیت کیفری برای اعضای هیأت مدیره و مدیر عامل متقاضی</p>
            <p>1-6- تأخیر در اجرای بلافاصله‌ی طرح به غیر از شرایط فورس‌ماژور</p>
          </div>

          <p className="font-bold">تبصره41:</p>
          <p className="mr-8">
            در صورت اعمال حق فسخ از سوی عامل در خصوص رخداد هر یک از موارد بند 1 این ماده کلیه دیون
            متقاضی ناشی از این قرارداد حال شده و در این صورت متقاضی متعهد است کلیه مطالبات را حداکثر
            ظرف ۵ روز کاری به عامل پرداخت نماید. در غیر اینصورت عامل حق دارد مطالبات خود و دارندگان
            گواهی‌های شراکت را طبق روال اتمام قرارداد دریافت نماید.
          </p>

          <h4 className="font-bold mr-4">2. انفساخ:</h4>
          <p className="mr-8">
            در شرایط مقرر در مواد این قرارداد، قرارداد منفسخ و ضمانت اجراهای پیش‌بینی شده در مواد
            این قرارداد به اجرا گذاشته می‌شود و این موضوع مانع اعمال تبصره بند 4 این ماده نخواهد
            بود.
          </p>

          <h4 className="font-bold mr-4">3. اقاله:</h4>
          <p className="mr-8">
            در صورت توافق طرفین، قرارداد اقاله شده و روال اتمام قرارداد مطابق بند 4 این ماده طی
            خواهد شد.
          </p>

          <h4 className="font-bold mr-4">4. روال اتمام قرارداد:</h4>
          <p className="mr-8">
            در کلیه صور مختلف اتمام قرارداد (فسخ، انفساخ و اقاله قرارداد)، طرفین روال زیر را طی 5
            روز کاری انجام خواهند داد:
          </p>
          <div className="mr-12">
            <p>
              4-1- متفرعات مبلغ قرارداد به میزان دوره‌ی نگهداری و اصل مبلغ قرارداد از سوی متقاضی به
              عامل مسترد می‌گردد؛
            </p>
            <p>
              4-2- متقاضی متعهد است وجه التزامی معادل 5/2 درصد مبلغ کل تأمین مالی به عنوان جریمه به
              عامل پرداخت نماید.
            </p>
            <p>
              4-3- تحویل گزارشات توسط متقاضی و تأیید کلیه گزارش‌ها توسط عامل به میزان دوره نگهداری
            </p>
            <p>4-4- ارائه صورت مالی طرح و تأیید آن توسط حسابرس</p>
            <p>
              4-5- استرداد کلیه تضامین و اسناد تجاری از سوی عامل به متقاضی پس از رعایت بندهای فوق از
              سوی متقاضی.
            </p>
          </div>

          <p className="font-bold">تبصره 42:</p>
          <p className="mr-8">
            در موادی که ضمانت اجرایی برای شرایط فسخ و انفساخ دیده شده است، متقاضی ملزم است علاوه بر
            اجرای ضمانت مندرج در آن ماده، بند 1-4 این ماده را نیز اجرا نماید.
          </p>
        </div>

        <div>
          <h3 className="font-bold">ماده 10) حوادث ناگهانی و فورس ماژور</h3>
          <p className="mr-8">
            هرگاه به علت وقوع حوادث غیرمترقبه مانند سیل، زلزله، و..... هريك از طرفين نتواند تعهدات
            خود را انجام دهد هیچگونه مسئولیتی برای وی در دوره زمانی مذکور متصور نبوده و قرارداد
            منعقده کماکان به قوّت خود باقی خواهد بود. پس از رفع شرایط فوق، طرفین متعهد به ادامه
            انجام تعهدات می‌باشند. چنانچه پس از مدّت یک ماه شرایط غیرمترقبه برطرف نگردید با تشخیص و
            صلاحدید عامل قرارداد فسخ می‌گردد و اصل مبلغ قرارداد از متقاضی اخذ می‌گردد.
          </p>

          <p className="font-bold">تبصره 43:</p>
          <p className="mr-8">
            چنانچه موانعی پس از انعقاد قرارداد به وجود آید، که در زمان عقد قرارداد قابل رفع، پیشگیری
            و پیش‌بینی نبوده‌اند و امکان ادامه قرارداد را به صورت کلی از بین می‌برد، قرارداد منفسخ
            می‌گردد و اصل مبلغ قرارداد از متقاضی اخذ می‌گردد.
          </p>
        </div>
        <div className="text-justify leading-relaxed text-[23px] space-y-6">
          <p>
            تبصره 44: تغییر نرخ ارز، تورم، کرونا و تحریم‌های بین‌المللی فورس ماژور تلقی نمی‌شود.
          </p>
          <p>
            <strong>ماده 11) حل اختلاف</strong>
            <br />
            در صورت بروز هرگونه اختلاف در اجرای مفاد این قرارداد، موضوع بدواً از طریق مذاکره میان
            طرف‌های قرارداد بررسی و رفع خواهد شد. در صورت عدم حصول توافق از طریق مذاکره، موضوع به
            داور انتخاب شده از سوی &quot;عامل&quot; ارجاع می‌گردد تا نسبت به حل و فصل اختلاف اقدام
            گردد.
          </p>
          <p>
            <strong>ماده 12) اقامتگاه قانونی</strong>
            <br />
            اقامتگاه قانوني طرفين قرارداد به شرح مذكور در مادة (١) ميباشد. در صورت تغيير، طرفين
            قرارداد مكلف ميباشند حداكثر ظرف هفت روز يكديگر را كتبا مطلع نمايند. در غير اين صورت
            ارسال هرگونه اسناد و اوراق اداري و قضايي اعم از مرسولات اداري، اخطاريه ها و احضاريه ها
            به نشاني هاي فوقالذكر، دريافت شده محسوب ميگردد.
          </p>
          <p>
            <strong>ماده 13) اعتبار قرارداد</strong>
            <br />
            این قرارداد‏ در 13 ماده و 44 تبصره، بدون پیوست در سه نسخه واحد تنظیم گردید که پس از
            امضاء کلیه نسخ آن در حکم واحد بوده و لازم‌الاجرا می‌باشند.
          </p>
        </div>
      </div>
    </div>
  );
};

Page16.propTypes = {
  data: PropTypes.object.isRequired,
};

export default Page16;
