import React from 'react';
import { PropTypes } from 'prop-types';

const Page15 = ({ data }) => {
  if (!data) return null;

  const formatNumber = (num) => {
    if (!num) return '0';
    return (num / 1000000).toLocaleString('en-US');
  };
  return (
    <div className="contract-page page-1">
      <div className="text-justify leading-relaxed text-[23px] space-y-6">
      <p>
          تبصره 37: در این قرارداد عامل به وکالت از دارندگان گواهی‌های شراکت می‌باشد. متقاضی، تأیید
          می‌نمایند که در صورت هرگونه تخلف در اجرای طرح و تأخیر در پرداخت اقساط بند 1 ماده 5، عامل
          به وکالت از دارندگان گواهی‌های شراکت رأسا می‌تواند نسبت به وصول مطالبات این اشخاص از محل
          چک‌های تضامین یا ضمانت نامه تعهد پرداخت و یا اوراق بهادار توثیق شده به صورت عرضی اقدام
          نماید. اقدام عامل در این خصوص برای متقاضی غیرقابل اعتراض و لازم الاجرا می‌باشد.
        </p>
        <p>
          تبصره 38: به جهت تضمین پرداخت اصل و متفرعات مبلغ تأمین مالی در مواعد مقرر، متقاضی ضمن این
          قرارداد به استناد این بند به عامل وکالت بلاعزل دادند که در صورت نکول متقاضی در پرداخت
          اقساط و عدم وصول چک‌های پرداخت اقساط و چک‌های تضمین، عامل بدون رعایت تشریفات قضایی
          می‌تواند نسبت به انتقال مالکیت اموال متقاضی به عامل به میزان تأخیر و عدم پرداخت اصل،
          متفرعات، جرایم و وجوه التزام مبلغ تأمین مالی، اقدام نماید. متقاضی متعهد است حداکثر ظرف مدت
          سه روز کاری به تمامی درخواست‌های عامل در این خصوص پاسخ داده و همکاری لازم را در این خصوص
          به‌عمل آورند. در صورت هرگونه تأخیر در همکاری در خصوص این بند از سوی متقاضی بیش از مهلت
          تعیین شده، متقاضی ملزم به پرداخت جریمه‌ای به مبلغ {formatNumber(200000000)} ریال (دویست
          میلیون ریال) روزانه تا زمان تسویه نهایی تعهدات خود خواهد بود.
        </p>

        <p>
          تبصره 39: متقاضی حق رجوع از اختیارات داده شده و همچنین حق ضم امین و اختیار وکیل را در
          اجرای اختیارات ارائه شده به عامل را در خصوص قرارداد حاضر تا وصول کامل مطالبات عامل از خود
          سلب و ساقط نمودند.
        </p>

        <p>
          تبصره 40: استرداد کلیه تضامین و اسناد تجاری به متقاضی پس از ایفای تمامی تعهدات (شامل
          پرداخت اقساط، اجرای طرح موضوع قرارداد، ارائه گزارش‌های دوره‌ای و صورت‌های مالی حسابرسی
          شده، محاسبه سود قطعی گواهی‌های شراکت و ......) از سوی متقاضی و تأیید عامل انجام خواهد
          شد.در صورت تأخیر در پرداخت اقساط (اصل و متفرعات) چه از سوی متقاضی و چه از سوی بانک
          صادرکننده ضمانت‌نامه تعهد پرداخت، متقاضی متعهد است وجه التزامی به میزان دو هزارم مبلغ
          پرداخت نشده به ازای هر روز دیرکرد به عامل بپردازد که از محل تمامی چک‌های اقساط و کلیۀ
          تضامین مندرج در قرارداد و دارایی‌های نامبرده قابل وصول و دریافت توسط عامل می‌باشد.
        </p>

        <p>
          اين قرارداد از زمان امضاي قرارداد، تا 15 روز كاري پس از اتمام مدت فراخوان جمع آوري وجوه از
          اعتبار قانوني برخوردار است. زمان قرارداد به صلاحديد عامل به طور خودكار و طي ارسال نامه
          كتبي به متقاضي قابل تمديد است.
        </p>

        <p className="font-bold">ماده 7) تاییدات و اقرار متقاضی</p>

        <p>
          1. متقاضی تأیید و اقرار می‌نماید برای انعقاد قرارداد حاضر و اجرای طرح تمامی مجوزهای لازم
          را اخذ نموده است.
        </p>

        <p>
          2. متقاضی تأیید و اقرار می‌نماید اجرای طرح موضوع ماده 3 این قرارداد، قطعاً سودآور خواهد
          بود. به استناد این بند عامل مخیر به فسخ قرارداد است.
        </p>

        <p>
          3. در صورت عدم ایفای تعهدات در موعد مقرر توسط متقاضی، مراتب به استحضار متقاضی رسیده و
          تضامین جهت اجرا در دستور کار قرار می‌گیرد.
        </p>

        <p>
          4. متقاضی تأیید و اقرار می‌نماید اطلاعات مالی ارسالی به عامل تماماً از دفتر اصلی متقاضی
          خواهد بود.
        </p>

        <p>
          تبصره: در صورت هرگونه تخلف متقاضی در ثبت وقایع مالی شرکت در دفتر اصلی و عدم ارائه اطلاعات
          به عامل از دفتر اصلی، عامل مخیر به فسخ قرارداد و اقدامات قانونی لازم خواهد بود.
        </p>

        <p>
          5. متقاضی تأیید و اقرار می‌نماید که عامل حق دارد نظارت بر اجرای موضوع ماده 3 قرارداد را پس
          از تأمین مالی به صورت دوره‌ای انجام دهد و در صورت دریافت گزارش هرگونه انحراف از برنامه
          کسب‌و‌کار با اهداف تعیین شده، مراتب را به استحضار دارندگان گواهی‌های شراکت و متقاضی برساند
          و در صورت عدم اصلاح توسط متقاضی، مراتب را به مراجع ذیصلاح ارجاع دهد.
        </p>

        <p>
          6. متقاضی تأیید و اقرار می‌نماید که عامل مختار به اقدام قانونی علیه هرگونه تقلب یا پنهان
          کاری کشف شده از متقاضی در هر زمانی است.
        </p>

        <p>
          7. متقاضی تأیید و اقرار می‌نماید که عامل حق دارد کلیه عملیات تجاری، محاسباتی و مالی متقاضی
          را در خصوص این قرارداد در هر زمان بازرسی و رسیدگی کند، متقاضی موظف است به محض درخواست عامل
          این اسناد و مدارک را در اختیار وی قرار دهد.
        </p>

        <p>
          8. متقاضی تأیید و اقرار می‌نماید که عامل می‌تواند کلیه گزارشات و صورت‌های مالی را که از
          طرف متقاضی به وی واصل شده است، منتشر کند و متقاضی نمی‌تواند هیچ‌گونه ادعایی در رابطه با
          نقض محرمانگی این اطلاعات داشته باشد.
        </p>
        <p>
          9. متقاضی تأیید و اقرار می‌نماید که در کلیه امور این قرارداد، عامل به وکالت از دارندگان
          گواهی‌های شراکت می‌باشد، لذا در صورت هرگونه تخلف متقاضی، عامل رأسا و بدون هیچ قید و شرطی
          به اجرا گذاشتن تضامین در جهت بازگرداندن اصل و سود سرمایه دارندگان گواهی‌های شراکت و سایر
          هزینه‌ها و خسارت‌ها اقدام نموده و حسب مورد امکان پیگیری‌های اداری و قضایی لازم را دارد.
        </p>

        <p>
          10. متقاضی تأیید و اقرار نمود که عامل حـق دارد از هرگونـه وجـوهی کـه در ازای عدم ایفای
          تعهدات ناشـی از ایـن قـرارداد از طـرف متقاضی پرداخت می‌گردد و یا از حساب‌ها و اموال و
          اسناد برداشت می‌شود، ابتدا کل هزینه‌های دادرسی و قضایی و ثبتی و بیمه و حق الوکاله متعلقـه
          و هزینه‌های پرداختی از قبیل کارشناسی، ارزیابی و کارمزد تا آن تاریخ را کسر و محاسبه نموده و
          متقاضی حق هرگونه ایراد و اعتراض نسبت به تشخیص عامل و محاسبات به عمـل آمـده را از خود سلب و
          اسقاط نمود.
        </p>

        <div>
          <h3 className="font-bold">ماده 8) مدت قرارداد</h3>
          <p>
            این قرارداد از زمان موفقیت کمپین تا سه ماه پس از زمان سررسید گواهی‌های شراکت از اعتبار
            قانونی برخوردار است که این مدت زمان می‌تواند به صلاحدید عامل تمدید، و طی نامه‌ای کتبی به
            اطلاع متقاضی رسانده شود.
          </p>
        </div>
        
      </div>
    </div>
  );
};

Page15.propTypes = {
  data: PropTypes.object.isRequired,
};

export default Page15;
