/* eslint-disable react/prop-types */
const Page11 = ({ data }) => {
  if (!data) return null;

  return (
    <div className="contract-page page-1">
      <div className="text-justify leading-relaxed text-[23px] space-y-6">
        <p>
          2. متقاضی تأیید و اقرار می‌نماید اجرای طرح موضوع ماده 3 این قرارداد، قطعاً سودآور خواهد
          بود. به استناد این بند عامل مخیر به فسخ قرارداد است.
        </p>

        <p>
          3. در صورت عدم ایفای تعهدات در موعد مقرر توسط متقاضی، مراتب به استحضار متقاضی رسیده و
          تضامین جهت اجرا در دستور کار قرار می‌گیرد.
        </p>

        <p>
          4. متقاضی تأیید و اقرار می‌نماید اطلاعات مالی ارسالی به عامل تماماً از دفتر اصلی متقاضی
          خواهد بود.
        </p>

        <p>
          تبصره: در صورت هرگونه تخلف متقاضی در ثبت وقایع مالی شرکت در دفتر اصلی و عدم ارائه اطلاعات
          به عامل از دفتر اصلی، عامل مخیر به فسخ قرارداد و اقدامات قانونی لازم خواهد بود.
        </p>

        <p>
          5. متقاضی تأیید و اقرار می‌نماید که عامل حق دارد نظارت بر اجرای موضوع ماده 3 قرارداد را پس
          از تأمین مالی به صورت دوره‌ای انجام دهد و در صورت دریافت گزارش هرگونه انحراف از برنامه
          کسب‌و‌کار با اهداف تعیین شده، مراتب را به استحضار دارندگان گواهی‌های شراکت و متقاضی برساند
          و در صورت عدم اصلاح توسط متقاضی، مراتب را به مراجع ذیصلاح ارجاع دهد.
        </p>

        <p>
          6. متقاضی تأیید و اقرار می‌نماید که عامل مختار به اقدام قانونی علیه هرگونه تقلب یا پنهان
          کاری کشف شده از متقاضی در هر زمانی است.
        </p>

        <p>
          7. متقاضی تأیید و اقرار می‌نماید که عامل حق دارد کلیه عملیات تجاری، محاسباتی و مالی متقاضی
          را در خصوص این قرارداد در هر زمان بازرسی و رسیدگی کند، متقاضی موظف است به محض درخواست عامل
          این اسناد و مدارک را در اختیار وی قرار دهد.
        </p>

        <p>
          8. متقاضی تأیید و اقرار می‌نماید که عامل می‌تواند کلیه گزارشات و صورت‌های مالی را که از
          طرف متقاضی به وی واصل شده است، منتشر کند و متقاضی نمی‌تواند هیچ‌گونه ادعایی در رابطه با
          نقض محرمانگی این اطلاعات داشته باشد.
        </p>
        <p>
          9. متقاضی تأیید و اقرار می‌نماید که در کلیه امور این قرارداد، عامل به وکالت از دارندگان
          گواهی‌های شراکت می‌باشد، لذا در صورت هرگونه تخلف متقاضی، عامل رأسا و بدون هیچ قید و شرطی
          به اجرا گذاشتن تضامین در جهت بازگرداندن اصل و سود سرمایه دارندگان گواهی‌های شراکت و سایر
          هزینه‌ها و خسارت‌ها اقدام نموده و حسب مورد امکان پیگیری‌های اداری و قضایی لازم را دارد.
        </p>

        <p>
          10. متقاضی تأیید و اقرار نمود که عامل حـق دارد از هرگونـه وجـوهی کـه در ازای عدم ایفای
          تعهدات ناشـی از ایـن قـرارداد از طـرف متقاضی پرداخت می‌گردد و یا از حساب‌ها و اموال و
          اسناد برداشت می‌شود، ابتدا کل هزینه‌های دادرسی و قضایی و ثبتی و بیمه و حق الوکاله متعلقـه
          و هزینه‌های پرداختی از قبیل کارشناسی، ارزیابی و کارمزد تا آن تاریخ را کسر و محاسبه نموده و
          متقاضی حق هرگونه ایراد و اعتراض نسبت به تشخیص عامل و محاسبات به عمـل آمـده را از خود سلب و
          اسقاط نمود.
        </p>

        <div>
          <h3 className="font-bold">ماده 8) مدت قرارداد</h3>
          <p>
            1. این قرارداد از زمان موفقیت کمپین تا سه ماه پس از زمان سررسید گواهی‌های شراکت از
            اعتبار قانونی برخوردار است که این مدت زمان می‌تواند به صلاحدید عامل تمدید، و طی نامه‌ای
            کتبی به اطلاع متقاضی رسانده شود.
          </p>
          <p>
            2. قرارداد حاضر به صورت عقدی لازم الاتباع از تاریخ انعقاد آغاز می شود و برای مدت یک ماه
            پس از تسویه و استرداد مبالغ تامین کنندگان مشارکت کننده در طرح معتبر و لازم الاجرا است.
            در صورت نیاز در پایان، مدت قرارداد حاضر برای مدتی که توسط عامل تعیین می گردد، تمدید می
            شود.
          </p>
          <p>
            3. خاتمه مدت قرارداد، تاثیری در تعهد متقاضی و ضامن به پرداخت مبلغ قرارداد و نیز ایفای
            تعهدات ایشان در برابر عامل، تامین کنندگان و نهاد مالی ندارد.
          </p>
        </div>

        <div>
          <h3 className="font-bold">ماده 9) شرایط اتمام قرارداد</h3>
          <h4 className="font-bold mr-4">1. شرایط فسخ:</h4>
          <div className="mr-8">
            <p>
              1-1- پس از موفقیت کمپین، متقاضی صرفاً با ارائه ادله مکفی و پذیرش عامل، مجاز به ارائه
              درخواست فسخ خواهد بود. عامل در پذیرش یا رد درخواست فسخ مختار خواهد بود. در این صورت
              متقاضی ضمن پرداخت کارمزد ماده 4 قرارداد عاملیت به شماره{' '}
              {`1${data.investor_request.contract_number}`} روال اتمام قرارداد را طی خواهد نمود.
            </p>
            <p>
              1-2- عامل مجاز است در صورت مشاهده هرگونه انحراف از اهداف تعیین شده، بنا بر صلاحدید خود
              و به صرف اعلام به متقاضی، قرارداد را فسخ نماید. در این صورت متقاضی روال اتمام قرارداد
              را مطابق بند 4 این ماده طی خواهد نمود.
            </p>
            <p>
              1-3- در صورت تخطی متقاضی از تعهدات یا روح این قرارداد (اعم از تأخیر یا عدم پرداخت
              اقساط، تأخیر یا عدم اجرای طرح، تخلف در اجرای طرح، عدم ارائه گزارش‌های دوره‌ای و
              صورت‌های مالی، ارائه گزارش‌ها و صورت‌های مالی خلاف واقع و ...) یا بیشتر شدن مجموع
              جرائم متقاضی طبق مفاد این قرارداد از 2 درصد مبلغ کل قرارداد، به صورت یک‌طرفه به عامل
              اجازه فسخ قرارداد داده می‌شود. در این صورت متقاضی روال اتمام قرارداد را مطابق بند 4
              این ماده طی خواهد نمود.
            </p>
            <p>1-4- ورشکستگی یا انحلال متقاضی</p>
            <p>1-5- محکومیت کیفری برای اعضای هیأت مدیره و مدیر عامل متقاضی</p>
            <p>1-6- تأخیر در اجرای بلافاصله‌ی طرح به غیر از شرایط فورس‌ماژور</p>
          </div>

          <p className="mr-8">
            تبصره 41: در صورت اعمال حق فسخ از سوی عامل در خصوص رخداد هر یک از موارد بند 1 این ماده،
            کلیه دیون متقاضی ناشی از این قرارداد حال شده و در این صورت متقاضی متعهد است کلیه مطالبات
            را حداکثر ظرف ۵ روز کاری به عامل پرداخت نماید. در غیر این‌صورت عامل حق دارد مطالبات خود
            و دارندگان گواهی‌های شراکت را طبق روال اتمام قرارداد دریافت نماید.
          </p>

          <p className="mr-8">
            2. انفساخ: در شرایط مقرر در مواد این قرارداد، قرارداد منفسخ و ضمانت اجراهای پیش‌بینی شده
            در مواد این قرارداد به اجرا گذاشته می‌شود و این موضوع مانع اعمال تبصره بند 4 این ماده
            نخواهد بود.
          </p>
        </div>

        <p className="mr-8">
          3. اقال: در صورت توافق طرفین، قرارداد اقاله شده و روال اتمام قرارداد مطابق بند 4 این ماده
          طی خواهد شد.
        </p>
      </div>
    </div>
  );
};

export default Page11;
