import { formatRials } from '../../utils/formatters_func';

const page8 = ({ data }) => {
  if (!data) return null;
  const checks = data?.checks?.filter((item) => item.type === 'وجه التزام');
  console.log(checks);

  return (
    <div className="contract-page page-1">
      <div className="text-justify leading-relaxed text-[23px] space-y-6">
        <p className="text-justify leading-relaxed text-[23px]">
          48) متقاضی در دوره اجرای طرح اقدام به انجام عملیات کسب وکار اعلامی خویش تحت نظارت کامل
          عامل، حسابرس معتمد سازمان بورس و اوراق بهادار (در صورت صلاحدید عامل) و کارگروه ارزیابی می
          نماید و مکلف است نسبت به ارائه گزارش های دورهای از عملکرد خود طبق مقررات سازمان بورس اوراق
          بهادار و دستورالعمل تامین مالی جمعی و قرارداد حاضر اقدام کند. متقاضی موظف است همواره یک
          نسخه مورد تایید فرابورس یا کارگروه ارزیابی یا نهاد مالی (طبق سازوکارهای دستورالعمل) از
          گزارش های مزبور را مطابق با ابلاغیه شماره /2377و/ 99مورخ 29/09/1399را به عامل ارائه نماید.
          درهرحال، لازم است علاوه بر گزارش های مذکور، در پایان هر طرح، بنا بر صلاحدید عامل گزارش
          حسابرسی شده طرح توسط حسابرس(که فاقد قید عدم اظهارنظر یا مردود باشد) ارائه شود و متقاضی
          متعهد است دراین خصوص شرایط مورد نیاز را مهیا نماید.
        </p>
        <p className="text-justify leading-relaxed text-[23px]">
          تبصره: تمامی طرح های بالای 5 میلیارد تومان طبق دستورالعمل کارگروه ارزیابی ملزم به ارائه
          گزارش حسابرسی در انتهای دوره خواهند بود.
        </p>
        <p className="text-justify leading-relaxed text-[23px]">
          49) درصورتی که متقاضی از ارائه گزارش های موضوع این قرارداد و سایر گزارش های مورد درخواست
          عامل به پیوست شماره 4خودداری کند، متعهد است نسبت به پرداخت150 درصد مبلغ سرمایه موردنیاز به
          عنوان وجه التزام نقض تعهد به عامل اقدام کند. مطالبه این خسارت نافی اعمال حق فسخ قرارداد
          توسط عامل نیست.
        </p>
        <p className="text-justify leading-relaxed text-[23px]">
          50) مسئولیت صحت اطلاعات، گزارش ها و اظهارات متقاضی (به استثنای گزارش های حسابرس مگر در
          مواردی که گزارش حسابرس بر اساس اطلاعات اشتباه و یا ناقص متقاضی تدوین شده باشند) مستقیماً
          بر عهده خود متقاضی است و چنانچه از باب نقض این تعهد خسارتی به عامل، نهاد مالی و تامین
          کنندگان وارد گردد، متقاضی مسئول جبران آن خواهد بود. در این راستا لازم است متقاضی شرایطی را
          مهیا نماید که حسابداری هر یک از طرحها در طول دوره اجرا به نحو استاندارد و مطلوب مورد قبول
          حسابرس (در صورت صلاحدید عامل) صورت پذیرد. متقاضی می بایست در ابتدای شروع طرح استانداردهای
          لازم، نوع و شیوه ارائه اسناد و مدارک مالی مورد قبول و دستورالعمل های مقتضی را با حسابرس
          معتمد سازمان بورس و اوراق بهادار و عامل تعیین نماید تا در زمان حسابرسی بر مبنای تاییدات
          حسابرس و عامل اقدام شده باشد.
        </p>
        <p className="text-justify leading-relaxed text-[23px]">
          51) متقاضی متعهد است درصورتی که در انتهای دوره اجرای طرح، شخصی تمام یا بخشی از کالاها و
          محصولات خریداری یا تولید شده از طریق فرایند تامین مالی جمعی را با قیمت های تضمینی مندرج در
          قرارداد، خریداری ننمود، شخصا و راسا این کالاها را به همان قیمت تضمینی از تامین کنندگان
          خریداری نماید.
        </p>
        <p className="text-justify leading-relaxed text-[23px]">
          52) متقاضی متعهد است (10ده) درصد از مبلغ سرمایه موردنیاز خود را راسا پرداخت نماید. این
          پرداخت در قالب وجه تضمین عدم نقض تعهدات قراردادی و به حساب اعلام شده توسط عامل صورت می
          گیرد و در صورت خاتمه زمان تامین مالی و احراز عدم نقض تعهدات قراردادی متقاضی و احراز عدم
          موفقیت طرح در جذب سرمایه یا حداقل منابع مالی موردنیاز، به وی مسترد می گردد. درصورتی که در
          انتهای مدت نمایش طرح جهت تامین مالی جمعی، متقاضی موفق به جمع آوری کل مبلغ سرمایه موردنیاز
          یا حداقل منابع مالی جمع آوری شده طبق این قرارداد شود، میزان مبلغ موضوع این بند، بهعنوان
          بخشی از سرمایه و منابع مالی موردنیاز در اختیار متقاضی قرار خواهد گرفت. درهرصورت متقاضی
          متعهد است این مبلغ را نیز در راستای طرح هزینه نماید. شرایط و نحوه هزینه کرد این مبلغ تابع
          شرایط و نظارت های مندرج در این قرارداد است.
        </p>
        <p className="text-justify leading-relaxed text-[23px]">
          53) پرداخت مبلغ مندرج در قرارداد، به حسابی که توسط عامل به اطلاع متقاضی می رسد، صورت خواهد
          گرفت.
        </p>
        <p className="text-justify leading-relaxed text-[23px]">
          54) در انتهای دوره طرح متقاضی، نقدی سازی دارائی هایی که در طرح خریداری یا تولید شده اند،
          انجام شده و مبالغ تحصیل شده به عنوان درآمدهای پروژه محاسبه می گردد. درصورتی که کارگروه
          ارزیابی، شیوه نقدی سازی را مشمول تخلف نقدی سازی اعلام کند، متقاضی مسئول جبران کلیه خسارت
          های وارده به عامل، نهاد مالی و تامین کنندگان خواهد بود. درهرصورت متقاضی و ضامن مسئولیت
          خرید تضمینی محصول تولیدشده را به مبلغ و میزان فروش پیش بینی شده دارند؛ همچنین عامل حق دارد
          بدون نیاز به اتخاذ تشریفات قضایی یا اداری و حسب ارزیابی خود از عملکرد متقاضی، از ضمانت
          نامه تعهد پرداخت راسا بهره برداری و تمام وجوه آن را مطالبه نماید.
        </p>
        <p className="text-justify leading-relaxed text-[23px]">
          55) درصورتی که منابع مالی جمع آوری شده، از حداقل منابع مالی جمع آوری شده طبق این قرارداد
          کمتر باشد، در این صورت فرض میگردد که طرح نتوانسته منابع مالی و سرمایه موردنیاز خود را از
          طریق تامین مالی جمعی تامین کند و منابع مالی جمع آوری شده از تامین کنندگان ظرف مهلت 2روز
          کاری از تاریخ خاتمه مهلت فراخوان تامین مالی جمعی به آنها مسترد می شود. درصورتی که منابع
          مالی جمع آوری شده، برابر یا بیشتر از مبلغ حداقل منابع مالی جمع آوری شده تا سقف کل مبلغ
          سرمایه موردنیاز متقاضی طبق این قرارداد باشد، مبالغ پرداختی تامین کننده (تامین کنندگان) بنا
          بر تایید عامل در راستای تامین مالی جمعی طبق این قرارداد مورد استفاده قرار خواهد گرفت.
        </p>
        <p className="text-justify leading-relaxed text-[23px]">
          56) پس از موفقیت طرح در جذب سرمایه و طی فرایندهای اداری و قانونی مربوطه، گواهی شراکت توسط
          شرکت فرابورس ایران برای تامین کنندگان و متناسب با میزان مشارکت هر کدام از آنها صادر می
          گردد.
        </p>
        <p className="text-justify leading-relaxed text-[23px]">
          تبصره: عامل نماینده تامین کنندگان است. متقاضی و تامین کنندگان و نهاد مالی و ضامن ضمن عقد
          خارج لازم به صورت غیرقابل رجوع به عامل به عنوان نماینده اجازه و حق دادند که هرگونه مطالبات
          ناشی از این قرارداد اعم از اصل و سود محقق شده سرمایه گذاری، وصول خسارات و جریمه های
          احتمالی و هزینه های فسخ قرارداد را پس از سررسید یا انحلال این قرارداد یا تحقق شرایط مندرج
          در این قرارداد و فقط در صورت عدم پرداخت متقاضی و ضامن، از وثایق و تضامین متقاضی و ضامن نزد
          عامل و ضمانت نامه تعهد پرداخت متقاضی نزد عامل و یا از طریق اعطای وکالت یا کارگزار بدون هیچ
          قید و شرطی و بدون نیاز به حکم قضایی یا اجرایی برداشت نموده و به حساب بدهی متقاضی و ضامن
          منظور نماید. اقدام عامل دراین خصوص برای متقاضی و ضامن غیرقابلاعتراض و لازم الاجرا می باشد.
          همچنین تامین کنندگان ضمن عقد خارج لازم هرگونه اقدام درخصوص موارد موضوع این تبصره را از خود
          سلب و ساقط نمودند و کلیه اختیارات دراین خصوص را به عامل و کارگزار عامل واگذار کردند.
        </p>
        <p className="text-justify leading-relaxed text-[23px]">
          {checks.map((check, index) => (
            <p key={index}>
              متقاضی در فرض عدم ارایه گزارش طبق قرارداد حاضر، ملزم به تادیه مبلغ وجه التزام به مبلغ
              {formatRials(check.amount)} ریال معادل یک میلیارد تومان است. بر این اساس، متقاضی باید
              مبلغ مزبور رابا ارایه نمودن یک فقره چک به مبلغ {formatRials(check.amount)} به شماره{' '}
              {check.fishing_id}
              به تاریخ {check?.date ? new Date(check.date).toLocaleDateString('fa-IR') : 'N/A'}{' '}
              تضمین کند. لذا در فرض عدم ایفای تعهد بیان شده، متقاضی به عامل وکالت و وکالت در توکیل
              داد تا نسبت به وصول چک مزبور اقدام کند که وصول چک، نافی حق فسخ نبوده و متقاضی نسبت به
              وصول چک مزبور از طرف عامل، هیچ گونه اعتراض یا ادعایی ندارد.
            </p>
          ))}
        </p>
      </div>
    </div>
  );
};

export default page8;
