import React from 'react';
import { PropTypes } from 'prop-types';

const Page18 = ({ data }) => {
  if (!data) return null;
  return (
    <div className="contract-page page-1">
      <div className="text-justify leading-relaxed text-[23px] space-y-6">
        <p>تبصره 44: تغییر نرخ ارز، تورم، کرونا و تحریم‌های بین‌المللی فورس ماژور تلقی نمی‌شود.</p>
        <p>
          <strong>ماده 11) حل اختلاف</strong>
          <br />
          در صورت بروز هرگونه اختلاف در اجرای مفاد این قرارداد، موضوع بدواً از طریق مذاکره میان
          طرف‌های قرارداد بررسی و رفع خواهد شد. در صورت عدم حصول توافق از طریق مذاکره، موضوع به داور
          انتخاب شده از سوی &quot;عامل&quot; ارجاع می‌گردد تا نسبت به حل و فصل اختلاف اقدام گردد.
        </p>
        <p>
          <strong>ماده 12) اقامتگاه قانونی</strong>
          <br />
          اقامتگاه قانوني طرفين قرارداد به شرح مذكور در مادة (١) ميباشد. در صورت تغيير، طرفين
          قرارداد مكلف ميباشند حداكثر ظرف هفت روز يكديگر را كتبا مطلع نمايند. در غير اين صورت ارسال
          هرگونه اسناد و اوراق اداري و قضايي اعم از مرسولات اداري، اخطاريه ها و احضاريه ها به نشاني
          هاي فوقالذكر، دريافت شده محسوب ميگردد.
        </p>
        <p>
          <strong>ماده 13) اعتبار قرارداد</strong>
          <br />
          این قرارداد‏ در 13 ماده و 44 تبصره، بدون پیوست در سه نسخه واحد تنظیم گردید که پس از امضاء
          کلیه نسخ آن در حکم واحد بوده و لازم‌الاجرا می‌باشند.
        </p>
      </div>
    </div>
  );
};

Page18.propTypes = {
  data: PropTypes.object.isRequired,
};

export default Page18;
