/* eslint-disable react/prop-types */
const Page12 = ({ data }) => {
  if (!data) return null;

  return (
    <div className="contract-page page-1">
      <div className="text-justify leading-relaxed text-[23px] space-y-6">
        <h4 className="font-bold mr-4">4. روال اتمام قرارداد:</h4>
        <p className="mr-8">
          در کلیه صور مختلف اتمام قرارداد (فسخ، انفساخ و اقاله قرارداد)، طرفین روال زیر را طی 5 روز
          کاری انجام خواهند داد:
        </p>
        <div className="mr-12">
          <p>
            4-1- متفرعات مبلغ قرارداد به میزان دوره‌ی نگهداری و اصل مبلغ قرارداد از سوی متقاضی به
            عامل مسترد می‌گردد؛
          </p>
          <p>
            4-2- متقاضی متعهد است وجه التزامی معادل 2/5 درصد مبلغ کل تأمین مالی به عنوان جریمه به
            عامل پرداخت نماید.
          </p>
          <p>
            4-3- تحویل گزارشات توسط متقاضی و تأیید کلیه گزارش‌ها توسط عامل به میزان دوره نگهداری
          </p>
          <p>4-4- ارائه صورت مالی طرح و تأیید آن توسط حسابرس</p>
          <p>
            4-5- استرداد کلیه تضامین و اسناد تجاری از سوی عامل به متقاضی پس از رعایت بندهای فوق از
            سوی متقاضی.
          </p>
        </div>

        <p className="mr-8">
          تبصره 42: در موادی که ضمانت اجرایی برای شرایط فسخ و انفساخ دیده شده است، متقاضی ملزم است
          علاوه بر اجرای ضمانت مندرج در آن ماده، بند 1-4 این ماده را نیز اجرا نماید.
        </p>

        <p className="mr-8">
          تبصره 43: متقاضی حق رجوع از اختیارات داده شده و همچنین حق ضم امین و اختیار وکیل را در
          اجرای اختیارات ارائه شده به عامل را در خصوص قرارداد حاضر تا وصول کامل مطالبات عامل از خود
          سلب و ساقط نمودند.
        </p>
      </div>

      <div className="text-justify leading-relaxed text-[23px] space-y-6">
        <div>
          <h3 className="font-bold">ماده 10) حوادث ناگهانی و فورس ماژور</h3>
          <p className="mr-8">
            هرگاه به علت وقوع حوادث غیرمترقبه مانند سیل، زلزله و ... هریک از طرفین نتواند تعهدات خود
            را انجام دهد، هیچگونه مسئولیتی برای وی در دوره زمانی مذکور متصور نبوده و قرارداد منعقده
            کماکان به قوّت خود باقی خواهد بود. پس از رفع شرایط فوق، طرفین متعهد به ادامه انجام
            تعهدات می‌باشند. چنانچه پس از مدّت یک ماه شرایط غیرمترقبه برطرف نگردید، با تشخیص و
            صلاحدید عامل قرارداد فسخ می‌گردد و اصل مبلغ قرارداد از متقاضی اخذ می‌گردد.
          </p>

          <p className="mr-8">
            تبصره 44: چنانچه موانعی پس از انعقاد قرارداد به وجود آید که در زمان عقد قرارداد قابل
            رفع، پیشگیری و پیش‌بینی نبوده‌اند و امکان ادامه قرارداد را به صورت کلی از بین می‌برد،
            قرارداد منفسخ می‌گردد و اصل مبلغ قرارداد از متقاضی اخذ می‌گردد.
          </p>
        </div>
        <p>تبصره 45: تغییر نرخ ارز، تورم، کرونا و تحریم‌های بین‌المللی فورس ماژور تلقی نمی‌شود.</p>
        <p>
          <strong>ماده 11) حل اختلاف</strong>
          <br />
          در صورت بروز هرگونه اختلاف در اجرای مفاد این قرارداد، موضوع بدواً از طریق مذاکره میان
          طرف‌های قرارداد بررسی و رفع خواهد شد. در صورت عدم حصول توافق از طریق مذاکره، موضوع به داور
          انتخاب شده از سوی &quot;عامل&quot; ارجاع می‌گردد تا نسبت به حل و فصل اختلاف اقدام گردد.در
          صورت لزوم رسیدگی در مراجع قضایی،محاکم استان یزد صالح به رسیدگی می باشند.
        </p>
        <p>
          <strong>ماده 12) اقامتگاه قانونی</strong>
          <br />
          اقامتگاه قانونی طرفین قرارداد به شرح مذکور در ماده (١) می‌باشد. در صورت تغییر، طرفین
          قرارداد مکلف می‌باشند حداکثر ظرف هفت روز یکدیگر را کتباً مطلع نمایند. در غیر این صورت
          ارسال هرگونه اسناد و اوراق اداری و قضایی اعم از مرسولات اداری، اخطاریه‌ها و احضاریه‌ها به
          نشانی‌های فوق‌الذکر، دریافت شده محسوب می‌گردد.
        </p>
        <p>
          <strong>ماده 13) افشای اطلاعات</strong>
          <br />
          الف) متقاضی متعهد است اطلاعات زیر را در اختیار عامل قرار دهد:
          <br />
          1. مدارک مستندات، اطلاعات، بازه های زمانی پرداخت سرمایه، شرایط و زمان بندی اجرای طرح یا
          برنامه کسب وکار
          <br />
          2. مدارک یا مجوزهای موردنیاز طرح؛ تبصره- مسئولیت اخذ کلیه پروانه ها و مجوزهای قانونی
          موردنیاز طرح با متقاضی است و درصورتی که به واسطه عدم طی تشریفات قانونی موردنیاز برای اخذ
          این موارد به هر علت اعم از تصمیم یک طرفه مراجع قانونی ذی صلاح جهت اعطای مجوزهای قانونی
          مزبور، این مجوزها تحصیل نگردد یا به هر علت مجوزهای اعطایی پیشین لغو شوند، این امر تاثیری
          در تعهدات متقاضی مندرج در ماده 9فوق ندارد و مسئولیت جبران خسارات وارده به عامل و تامین
          کنندگان و نهاد مالی با متقاضی است.
          <br />
          3. سایر موارد اعلامی توسط کارگروه ارزیابی.
          <br />
          4. الزامات و گزارش های دورهای که حسب مورد عامل مقرر میدارد.
          <br />
          5. افشای دعاوی حقوقی و کیفری مطروحه علیه یا له متقاضی یا اعضای هیئت مدیره و مدیرعامل آن یا
          طرح.
          <br />
          6. مشخصات اعضای حقیقی و حقوقی عضو هیئت مدیره.
          <br />
          7. مشخصات سهامداران شرکت متقاضی.
          <br />
          8. امتیازات سهام ممتاز و نصاب سهام سهامداران ممتاز در صورت وجود.
          <br />
          9. لیست دارایی و بدهیها.
          <br />
          تبصره- حداقل مفاد برنامه کسب وکار متقاضی به شرح پیوست شماره سه این قرارداد است.
          <br />
          ب)موارد موضوع این ماده اسرار تجاری و اطلاعات محرمانه نیست و عامل حق دارد تمام یا بخشی از
          اطلاعات مندرج در بند فوق را جهت رعایت شفافیت در فرایندهای تامین مالی جمعی، به صورت عمومی
          نمایش دهد یا در مذاکرات جذب منابع مالی، آنها را به تامین کنندگان ارائه و افشا کند. افشا و
          انتشار موارد موضوع این بند، مشمول هیچکدام از تعهدات رعایت محرمانگی نبوده و عامل هیچگونه
          مسئولیتی در قبال ارائه و انتشار این اطلاعات ندارد.
          <br />
          <p>
            ج)متقاضی متعهد است تمامی قراردادهای باز برای فروش محصولات مندرج در طرح و همچنین محصولات
            تولید شده با منابع داخلی شرکت را به اطلاع عامل برساند بدیهی است معیار تولید، فروش این
            محصولات و سود حاصل شده در طرح بر اساس این اطلاعات و به تشخیص عامل خواهد بود. از زمان
            امضا، تمامی درآمدهای حاصل از فروش این محصول در قبل یا بعد تاریخ قرارداد به این قرارداد
            منتقل می شود.
          </p>
        </p>
      </div>
    </div>
  );
};

export default Page12;
