import React from 'react';
import { PropTypes } from 'prop-types';

const Page7 = ({ data }) => {
  if (!data) return null;

  return (
    <div className="contract-page page-1">
      <div className="text-justify leading-relaxed text-[23px] space-y-6">
      <p className="text-justify leading-relaxed text-[23px]">
          34) متقاضی متعهد است در تمام مدت اعتبار قرارداد و نیز مدتی که کسب وکار خود را در سکوی عامل
          به نمایش گذاشته است و پس از آن در صورت موفقیت طرح در جذب سرمایه، طرح موضوع این قرارداد را
          نزد عامل های دیگر تامین مالی جمعی، ثبت ننماید یا نسبت به تامین مالی جمعی بابت این طرح نزد
          سایر اشخاص اقدام نکند.
        </p>
        <p className="text-justify leading-relaxed text-[23px]">
          35) متقاضی متعهد است پس از تکمیل مبلغ سرمایه موردنیاز توسط تامین کنندگان، به هر تعداد که
          باشند، نسبت به انجام تعهدات خود در مقابل تامین کنندگان متناسب با شیوه اعلام شده در فراخوان
          طرح که جزء لاینفک این قرارداد است، اقدام نماید.
        </p>
        <p className="text-justify leading-relaxed text-[23px]">
          36) متقاضی تضمین می نماید که سهامداران وی در اسناد تاسیس یا اساسنامه خود هیچگونه اصلاح و
          الحاقی که با درخواست ارائه شده به عامل مغایرت دارد یا به نحوی از انحاء در ارائه درخواست یا
          اجرای آن و انعقاد قراردادهای مربوطه با تامین کنندگان مانع یا محدودیتی ایجاد می نماید یا به
          تضییع حقوق قانونی و قراردادی تامین کنندگان منتهی می گردد اعم از تصویب و تقسیم سود سالیانه،
          افزایش یا کاهش سرمایه، ادغام، انحلال یا اعلام ورشکستگی و مانند آن صورت ندهند؛ مگر آنکه
          عامل قبلا با اتخاذ چنین اقداماتی کتبا موافقت نماید.
        </p>
      <p className="text-justify leading-relaxed text-[23px]">
          37) متقاضی متعهد است گواهی عدم سوءپیشینه مدیرعامل و اعضای هیئت مدیره خود را که از تاریخ
          صدور آن بیش از یک ماه نگذشته باشد، در تاریخ قرارداد به عامل ارائه نماید و تضمین مینماید که
          مدیرعامل و اعضای هیئت مدیره وی، مشمول هیچگونه محدودیت های قانونی و قضایی یا اداری که بر
          اجرای قرارداد حاضر تاثیر بگذارد، نیستند.
        </p>
        <p className="text-justify leading-relaxed text-[23px]">
          38) متقاضی متعهد است گزارشهای مرتبط با کسب وکار خود را طبق فرمت پیوست شماره 4 و مصوبات
          کارگروه ارزیابی تامین مالی جمعی درخصوص بازه زمانی و نحوه ارائه گزارش های دورهای به عامل
          ارائه نماید. بدیهی است پرداخت و نیز برداشت هر میزان وجه (طبق پیوست شماره 1 از مبلغ منابع
          مالی جمع آوری شده به متقاضی، منوط و مشروط به تایید اقدامات متقاضی توسط عامل (طبق پیوست
          شماره 1) است. اما در صورت تخلف متقاضی، عامل امکان برداشت هیچ میزان وجه از مبلغ منابع مالی
          جمع آوری شده را به متقاضی نخواهد داد. درصورت عدم انطباق اقدامات متقاضی با برنامه کسب وکار
          و فراخوان تامین مالی جمعی یا کشف فساد، تدلیس و یا عدم افشای صحیح و واقعی از اطلاعات یا
          عملکرد متقاضی به تشخیص عامل و کارگروه ارزیابی، هیچ میزان از منابع مالی در اختیار متقاضی
          قرار نخواهد گرفت و در صورت پرداخت نیز متقاضی متعهد است از هرگونه تصرفات مادی و حقوقی در
          این موارد امتناع نماید. در صورت نقض این تعهد، متقاضی متعهد است ظرف حداکثر 10 روز کاری از
          تاریخ اعلام عامل، میزان 150 درصد مبلغ سرمایه موردنیاز را به عنوان وجه التزام ناشی از نقض
          تعهدات قراردادی به عامل پرداخت نماید.
        </p>
        <p className="text-justify leading-relaxed text-[23px]">
          39)متقاضی حق رجوع از اختیارات داده شده و همچنین حق ضم امین و اختیار وکیل را در اجرای
          اختیارات ارائه شده به عامل را در خصوص قرارداد حاضر تا وصول کامل مطالبات عامل از خود سلب و
          ساقط نمودند.
        </p>
        <p className="text-justify leading-relaxed text-[23px]">
          40) متقاضی متعهد است مقدار حد اقل شاخص های کلیدی عملکرد تعیین شده در پیوست شماره دو برای
          رسیدن به سود اعلام شده در این قرارداد را محقق نماید؛ درصورتیکه به تشخیص کارگروه ارزیابی و
          عامل، علت عدم دستیابی به این شاخص ها، ارتکاب جرایم و اعمال غیرقانونی یا اموری مانند بی
          احتیاطی یا بی مبالاتی در روند امور عادی و متعارف تجارت و کسب وکار باشد، عامل می تواند راسا
          از محل تضامین متقاضی، ضرر و زیان وارده به خود، نهاد مالی و تامین کنندگان را جبران نماید.
          در این راستا، متقاضی متعهد است ظرف مهلت حداکثر 10روز کاری از تاریخ اعلام عامل،150 درصد
          مبلغ سرمایه موردنیاز را به عنوان وجه التزام به عامل پرداخت نماید؛ در غیر این صورت عامل حق
          دارد راسا نسبت به مطالبه خسارات وارده از محل تضامین موضوع این قرارداد اقدام کند. عامل می
          تواند علاوه بر سایر تضامین این قرارداد، از محل وجه تضمین اولیه مندرج در قرارداد نیز
          استفاده نماید.
        </p>
        <p className="text-justify leading-relaxed text-[23px]">
          41) متقاضی متعهد است اقدامات لازم قانونی و اداری برای افتتاح حساب بانکی جدید برای طرح (یا
          خالی کردن موجودی یک حساب بانکی موجود و استفاده طبق شرط آمده در تبصره)، اخذ کد بورسی و ثبت
          نام در سامانه سجام و انعقاد قرارداد با حسابرسان معتمد سازمان بورس و اوراق بهادار (در صورت
          صلاحدید عامل) و صدور و تودیع ضمانت نامه تعهد پرداخت معتبر را بکار بندد و نتیجه آنها را به
          عامل اعلام نماید. عامل حق دارد انجام موضوع قرارداد در مقابل متقاضی ای که تعهدات مقدماتی
          موضوع این بند را رعایت ننموده است، متوقف کند.
        </p>
        <p className="text-justify leading-relaxed text-[23px]">
          تبصره: حساب بانکی موضوع قرارداد را به امور تامین مالی جمعی طرح متقاضی طبق این قرارداد
          اختصاص خواهد داشت و متقاضی متعهد است از این حساب بانکی صرفا در راستای همین قرارداد بهره
          برداری نماید. هرگونه واریز و برداشت از این حساب تابع مقررات مربوطه و شرایط قرارداد حاضر
          خواهد بود. متقاضی متعهد است این حساب را طی یک نامه به عامل معرفی کند تا کلیه پرداخت های فی
          مابین عامل و متقاضی از طریق این حساب بانکی انجام پذیرد. درهرصورت متقاضی متعهد است در صورت
          اعلام عامل گزارش جامعی از حساب های افراد یا حساب های دیگر متقاضی، حسب اعلام عامل به عامل
          تحویل دهد.
        </p>
        <p className="text-justify leading-relaxed text-[23px]">
          42) متقاضی متعهد است در راستای انجام امور تبلیغات برای پویش تامین مالی جمعی مرتبط با طرح
          خود، اقدامات و راهکارهای اعلام شده با هزینه کرد معقول توسط عامل را به کار بندد و از کلیه
          ظرفیت های رسانه ای و تبلیغاتی خود برای موفقیت طرح در جذب سرمایه و اجرای طرح موضوع این
          پویش، استفاده و بهره برداری نماید.
        </p>
        <p className="text-justify leading-relaxed text-[23px]">
          43) متقاضی متعهد است کلیه خسارات وارده به تامین کنندگان بابت اصل سرمایه از کل مبلغ منابع
          مالی موردنیاز به عنوان وجه التزام نقض تعهدات از محل تمام اموال و دارایی ها از جمله موجودی
          کالاهای تولیدی قبل از انعقاد این قرارداد به صورت رایگان بپردازد و جبران کند.
        </p>
        <p className="text-justify leading-relaxed text-[23px]">
          44) تبصره-متقاضی متعهد است مطابق برنامه زمان بندی مندرج در این قرارداد اقدام به عرضه محصول
          به بازار وفروش آن نماید و به هرتقدیر حق فروش و عرضه احتمالی محصولات قبلی تولیدی موجود در
          انبار خود و یا محصولات تولیدی مشابه خارج از این طرح را تا زمان فروش محصولات تولیدی ناشی از
          این قرارداد از خود سلب و ساقط نمود.
        </p>




      </div>
    </div>
  );
};

Page7.propTypes = {
  data: PropTypes.object.isRequired,
};

export default Page7;
