import React from 'react';
import { PropTypes } from 'prop-types';
import moment from 'moment-jalaali';
import { formatNumber } from 'src/utils/formatNumbers';

const Page7 = ({ agencyContract }) => {
  if (!agencyContract) return null;

  return (
    <div className="contract-page page-1">
      <div className="text-justify leading-relaxed text-[23px]">
        <h4 className="text-[23px] font-bold">(ب) چک</h4>
        <p className="text-[23px]">
          1) به منظور تضمین ابقای هر یک از تعهدات ناشی از این قرارداد از جمله پرداخت اقساط خرید
          دارایی در مواعد پرداخت و نیز بازپرداخت سرمایه در تاریخ اتمام طرح و نهایتاً ظرف مدت حداکثر
          ۱ روز تقویمی از آن تاریخ متقاضی همزمان با امضای قرارداد یک فقره چک صیادی به شناسه صیادی
          <p className="text-[23px]">
            1) به منظور تضمین ابقای هر یک از تعهدات ناشی از این قرارداد از جمله پرداخت اقساط خرید
            دارایی در مواعد پرداخت و نیز بازپرداخت سرمایه در تاریخ اتمام طرح و نهایتاً ظرف مدت
            حداکثر ۱ روز تقویمی از آن تاریخ متقاضی همزمان با امضای قرارداد یک فقره چک صیادی به شناسه
            صیادی
            <strong>
              {agencyContract.checks.find((check) => check.type === 'وجه التزام')?.fishing_id ||
                ' ???????'}
            </strong>{' '}
            و به مبلغ{' '}
            <strong>
              {agencyContract.checks.find((check) => check.type === 'وجه التزام')?.amount
                ? formatNumber(
                    agencyContract.checks.find((check) => check.type === 'وجه التزام').amount
                  )
                : ' ???????'}
            </strong>{' '}
            ریال صادر و به شرکت تسلیم خواهد نمود.
          </p>
          ریال صادر و به شرکت تسلیم خواهد نمود.
        </p>
        <p className="text-[23px]">
          2) متقاضی متعهد است ضمن ثبت چک در سامانه ماد رسید ثبت را تحویل شرکت نماید. در صورتی که در
          هر زمان پس از امضای قرارداد، عدم ثبت چک در سامانه مشخص گردد. شرکت مستحق در مطالبه معادل
          وجه چک صادره به عنوان وجه التزام قراردادی خواهد بود. وجه التزام باد شده، بدل از اصل تعهد
          نبوده و صادر کننده همچنان موظف به ایفای تعهدات خود وفق مفاد این قرارداد نیز خواهد بود.
        </p>
        <p className="text-[23px]">
          3) صادر کننده موظف است در چک موضوع این ماده صرفاً جمله بایت قرارداد شماره
          <strong> {`1${agencyContract.investor_request?.contract_number || ''}`}</strong>
          را درج نموده و از درج هر گونه عبارت مازاد از قبیل بابت تضمین بابت ضمانت بابت حسن انجام کار
          و امثال هم خودداری نماید.
        </p>

        <h4 className="text-[23px] font-bold">(ب) ضامن</h4>

        <p className="text-[23px]">
          به منظور تضمین ایفای هر یک از تعهدات ناشی از این قرارداد متقاضی موظف است همزمان با امضای
          قرارداد نسبت به معرفی{' '}
          {`${Array.isArray(agencyContract?.guarantor) ? agencyContract.guarantor.length : 0}`} ضامن
          به شرح ذیل به شرکت اقدام نماید.
        </p>

        <p className="text-[23px]">
          {Array.isArray(agencyContract?.guarantor) &&
            agencyContract.guarantor
              .filter((g) => g.company_agent === null)
              .map((item, index) => (
                <p key={`physical-guarantor-${index}`}>
                  {index + 3}) سرکار آقای/خانم {item.members?.[0]?.guarantor_name} به کد ملی{' '}
                  {item.members?.[0]?.guarantor_national_id} و شماره تماس{' '}
                  {item.members?.[0]?.phone_number} متولد{' '}
                  {moment(item.members?.[0]?.birth_date).format('jYYYY/jMM/jDD')} به آدرس{' '}
                  {item.members?.[0]?.guarantor_address} واحد {item.members?.[0]?.unit} به کد پستی{' '}
                  {item.members?.[0]?.postal_code} که از این پس در این قرارداد به عنوان «ضامن حقیقی»
                  معرفی می‌گردد.
                </p>
              ))}
          {Array.isArray(agencyContract?.guarantor) &&
            agencyContract.guarantor
              .filter((g) => g.company_agent !== null)
              .map((item, index) => (
                <p key={`legal-guarantor-${index}`}>
                  {index +
                    3 +
                    agencyContract.guarantor.filter((g) => g.company_agent === null).length}
                  ) شرکت {item.company_agent} ({item.kind_of_company}) به شناسه ملی{' '}
                  {item.company_national_id}، به شماره ثبت {item.register_number_of_company} در{' '}
                  {item.general_directorate_of_company}،{item.registration_unit_of_company}، به
                  نشانی {item.address_of_company}، به کدپستی {item.postal_code_of_company}،
                  {item.members && item.members.length > 0 && (
                    <>
                      {' '}
                      با نمایندگی{' '}
                      {item.members.map((member, memberIndex) => (
                        <span key={member.id}>
                          {memberIndex > 0 && ' و '}
                          {member.guarantor_name} به شماره ملی {member.guarantor_national_id} به سمت{' '}
                          {member.position_title}
                        </span>
                      ))}
                    </>
                  )}{' '}
                  بر اساس روزنامه رسمى شماره {item.document_news_paper} که از این پس در این قرارداد
                  &quot;ضامن حقوقی&quot; نامیده می‌شود
                </p>
              ))}
          <br />
        </p>
        <h4 className="text-[23px] font-bold">د) آورده شخصی</h4>

        <p>
          در فرض وجود شرایط لازم و دسترسی شرکت به آورده شخصی شرکت مستحق در وصول بدهی و مطالبات خود
          از آن محل نیز خواهد بود.
        </p>

        <h4 className="text-[23px] font-bold">ه) اموال و دارایی های متقاضی نزد شرکت</h4>

        <p className="text-[23px]">
          شرکت مستحق در وصول مطالبات ناشی از این قرارداد از جمله مبالغ مربوط به اقساط خرید دارایی و
          مبالغ سرمایه گذاری و حسب مورد خسارات و وجه التزام های متعلقه به آن از محل کلیه دارایی ها،
          اوراق بهادار مطالبات سود سهام و سایر اموال و دارایی های متقاضی و ضامن نزد خود با صندوق های
          تحت مدیریت، به هر شکل و تحت هر عنوان و به موجب هر قرارداد دیگری که نزد عامل موجود است یا
          پس از امضای این قرارداد موجود خواهد شد میباشد. متقاضی با امضای ذیل این قرارداد به صورت غیر
          قابل برگشت به شرکت اذن در رجوع به موارد مذکور و وصول مطالبات ناشی از این قرارداد را اعطا
          نمود.
        </p>

        <p className="text-[23px] font-bold">
          <span className="font-bold">تبصره 1:</span> در صورت استنکاف متقاضی از ایفای تعهدات مذکور
          در این قرارداد از جمله عدم پرداخت اقساط خرید دارایی در مواعد پرداخت و با بازپرداخت سرمایه
          در موعد مقرره شرکت راسا و بدون نیاز به مراجعه به مراجع قضایی و اداری مستحق در وصول مطالبات
          خود اعم از اصل مبلغ و حسب مورد خسارات و وجه التزام های متعلقه به آن از محل هر یک از تضامین
          و وثایق موضوع این ماده خواهد بود. شایان ذکر است انتخاب هر یک از تضامین و وثایق مذکور جهت
          وصول مطالبات به صلاحدید شرکت بوده و رجوع به هر یک از تضامین مانع وصول مطالبات از محل سایر
          تضامین نخواهد بود.
        </p>

        <p className="text-[23px] font-bold">
          <span className="font-bold">تبصره 2:</span> شرکت راسا و بدون نیاز به مراجعه به مراجع قضایی
          و اداری مستحق در وصول مبالغ مربوط به خسارت و وجه التزام مذکور در ماده ۱۲ قرار داده از محل
          هر یک از تضامین و وثایق مندرج در این ماده خواهد بود. شایان ذکر است انتخاب هر یک از تضامین
          و وثایق مذکور جهت وصول مطالبات، به صلاحدید شرکت بوده و رجوع به هر یک از تضامین مانع وصول
          مطالبات از محل سایر تضامین نخواهد بود.
        </p>

        <h3 className="text-[23px] font-bold">2) وجه التزام و خسارات قراردادی</h3>

        <h4 className="text-[23px] font-bold">ه) اموال و دارایی های متقاضی نزد شرکت</h4>

        <p className="text-[23px]">
          شرکت مستحق در وصول مطالبات ناشی از این قرارداد از جمله مبالغ مربوط به اقساط خرید دارایی و
          مبالغ سرمایه گذاری و حسب مورد خسارات و وجه التزام های متعلقه به آن از محل کلیه دارایی ها،
          اوراق بهادار مطالبات سود سهام و سایر اموال و دارایی های متقاضی و ضامن نزد خود با صندوق های
          تحت مدیریت، به هر شکل و تحت هر عنوان و به موجب هر قرارداد دیگری که نزد عامل موجود است یا
          پس از امضای این قرارداد موجود خواهد شد میباشد. متقاضی با امضای ذیل این قرارداد به صورت غیر
          قابل برگشت به شرکت اذن در رجوع به موارد مذکور و وصول مطالبات ناشی از این قرارداد را اعطا
          نمود.
        </p>

        <p className="text-[23px] font-bold">
          <span className="font-bold">تبصره 1:</span> در صورت استنکاف متقاضی از ایفای تعهدات مذکور
          در این قرارداد از جمله عدم پرداخت اقساط خرید دارایی در مواعد پرداخت و با بازپرداخت سرمایه
          در موعد مقرره شرکت راسا و بدون نیاز به مراجعه به مراجع قضایی و اداری مستحق در وصول مطالبات
          خود اعم از اصل مبلغ و حسب مورد خسارات و وجه التزام های متعلقه به آن از محل هر یک از تضامین
          و وثایق موضوع این ماده خواهد بود. شایان ذکر است انتخاب هر یک از تضامین و وثایق مذکور جهت
          وصول مطالبات به صلاحدید شرکت بوده و رجوع به هر یک از تضامین مانع وصول مطالبات از محل سایر
          تضامین نخواهد بود.
        </p>

        <p className="text-[23px] font-bold">
          <span className="font-bold">تبصره 2:</span> شرکت راسا و بدون نیاز به مراجعه به مراجع قضایی
          و اداری مستحق در وصول مبالغ مربوط به خسارت و وجه التزام مذکور در ماده ۱۲ قرار داده از محل
          هر یک از تضامین و وثایق مندرج در این ماده خواهد بود. شایان ذکر است انتخاب هر یک از تضامین
          و وثایق مذکور جهت وصول مطالبات، به صلاحدید شرکت بوده و رجوع به هر یک از تضامین مانع وصول
          مطالبات از محل سایر تضامین نخواهد بود.
        </p>
      </div>
    </div>
  );
};

Page7.propTypes = {
  agencyContract: PropTypes.object.isRequired,
};

export default Page7;
