import React from 'react';
import { PropTypes } from 'prop-types';
import { NavItem } from 'react-bootstrap';
import { formatNumber } from 'src/utils/formatNumbers';

const Page6 = ({ agencyContract }) => {
  if (!agencyContract) return null;

  return (
    <div className="contract-page page-1">
      <div className="text-justify leading-relaxed text-[23px]">
        <p className="text-[23px]">
          <span className="font-bold">تبصره ۳:</span> در صورت عدم ارائه گزارش پایانی یا گزارش
          حسابرسی طرح تا پایان مهلتهای مقرر کلیه سودهای پیش بینی شده طرح حال شده فرض گشته و سود پیش
          بینی شده معیار کلیه تسویه حسابها قرار خواهد گرفت در فرض اخیر خسارت عدم ارائه گزارش پایانی
          طرح توسط متقاضی پرداخت خواهد شد.
        </p>

        <p className="text-[23px] font-bold">
          10) متقاضی متعهد است امکان نظارت مستمر عامل و حضور در محل انجام فعالیتهای موضوع قرارداد در
          هر زمان به تشخیص عامل و دسترسی کامل به اطلاعات لازم را فراهم می کند.
        </p>
        
        <p className="text-[23px]">
          1) با عنایت به آنکه عامل صرفاً از طریق خدمات ارائه شده در بستر پلتفرم مقدمات تأمین مالی
          جمعی متقاضی و سرمایه گذاری را برای تأمین کنندگان فراهم می آورد، لذا هیچگونه مسئولیتی در
          قبال موفقیت کمپین نداشته و در صورت عدم موفقیت کمپین وجوه واریزی از جانب سرمایه گذاران را
          وفق مفاد این قرارداد به آنان مسترد خواهد نمود.
        </p>

        <h3 className="text-[23px] font-bold">10) حدود مسئولیت طرفین</h3>

        <p className="text-[23px]">
          2) با توجه به آنکه مسئولیت پرداخت اقساط خرید دارایی و نیز بازپرداخت سرمایه تماماً بر عهده
          متقاضی میباشد لذا هیچگونه مسئولیتی در این باره متوجه شرکت نبوده و شرکت صرفاً به وکالت از
          سرمایه گذار نسبت به اخذ مبالغ باد شده از متقاضی و واریز به شماره حساب سرمایه گذار، اقدام
          می نماید.
        </p>
        <p className="text-[23px]">
          3) متقاضی با امضای ذیل این قرارداد به صورت غیر قابل برگشت به شرکت اذن در پرداخت اقساط خرید
          دارایی و نیز سرمایه را در مواعد مقرر اعطا نمود. بدیهی است اعطای اذن مذکور هیچگونه تکلیفی
          برای شرکت در خصوص پرداخت ایجاد ننموده و تصمیم گیری در این خصوص تماماً بر عهده شرکت می
          باشد. مقاد بند حاضر، نافی بند ۲ این ماده نبوده و هر گونه تفسیر از این بند که منجر به ایجاد
          مسئولیت در پرداخت برای شرکت گردد. ممنوع است. بدیهی است مفاد این بند تحت هیچ عنوان تجویز
          تأخیر متقاضی در پرداخت بدهی تلقی نخواهد شد و در صورت تأخیر متقاضی ملزم به پرداخت خسارات
          قراردادی، می باشد.
        </p>

        <h3 className="text-[23px] font-bold">11)وثایق و تضامین</h3>
        <p className="text-[23px]">
          به منظور تضمین اجرای هر یک از تعهدات مذکور در این قرارداد از جمله و ته محدود به تعهد
          پرداخت اقساط خرید دارایی و نیز بازپرداخت سرمایه و ارائه گزارش های دوره ای مذکور در ماده ۹
          متقاضی موظف است همزمان با امضای قرارداد نسبت به سپردن وثایق و تضامین به شرح ذیل به عامل
          اقدام نماید.
        </p>
        <h4 className="text-[23px] font-bold">(الف) ضمانت نامه تعهد پرداخت بانکی</h4>
        {agencyContract.warranty.map((item) => {
          if (item.type === 'warranty') {
            return (
              <p className="text-[23px]">
                1) متقاضی به منظور تضمین ایفای تعهدات مذکور در این قرارداد از جمله پرداخت اقساط خرید
                دارایی در مواعد پرداخت و نیز بازپرداخت سرمایه در تاریخ اتمام طرح و نهایتاً ظرف مدت
                حداکثر ۱ روز تقویمی از آن تاریخ یک فقره ضمانت نامه تعهد پرداخت بانکی به شماره سپام
                <strong>{item.sepam_id}</strong>مورخ عهده به مبلغ{' '}
                <strong>{formatNumber(item.number)}</strong> ریال به شرکت تسلیم خواهد نمود.
              </p>
            );
          }
          return null;
        })}
        <p className="text-[23px]">
          2) در صورتی که شرکت خواهان تمدید مدت ضمانت نامه باشد بایستی درخواست خود را حداکثر تا تاریخ
          به متقاضی ارائه نماید. در صورت گذشت مدت ۲ روز کاری از تاریخ درخواست شرکت و عدم اقدام
          متقاضی در خصوص تمدید و با عدم تمدید ضمانت نامه به هر دلیل از جمله عدم همکاری بانکی صادر
          کننده ضمانت نامه شرکت مستحق در ضبط و وصول تمامی مبلغ ضمانت نامه به نفع خود خواهد بود.
          متقاضی با امضای ذیل این قرارداد، حق هرگونه اعتراض و ادعا در این خصوص را از خود سلب و ساقط
          نمود.
        </p>

        <h4 className="text-[23px] font-bold">(ب) چک</h4>
        <p className="text-[23px]">
          1) به منظور تضمین ابقای هر یک از تعهدات ناشی از این قرارداد از جمله پرداخت اقساط خرید
          دارایی در مواعد پرداخت و نیز بازپرداخت سرمایه در تاریخ اتمام طرح و نهایتاً ظرف مدت حداکثر
          ۱ روز تقویمی از آن تاریخ متقاضی همزمان با امضای قرارداد یک فقره چک صیادی به شناسه صیادی
          <strong>{' ???????'}</strong> و به مبلغ <strong>{' ???????'}</strong> ریال صادر و به شرکت
          تسلیم خواهد نمود.
        </p>
        <p className="text-[23px]">
          2) متقاضی متعهد است ضمن ثبت چک مذکور در سامانه ماد رسید ثبت را تحویل شرکت نماید. در صورتی
          که در هر زمان پس از امضای قرارداد، عدم ثبت چک در سامانه مشخص گردد. شرکت مستحق در مطالبه
          معادل وجه چک صادره به عنوان وجه التزام قراردادی خواهد بود. وجه التزام باد شده، بدل از اصل
          تعهد نبوده و صادر کننده همچنان موظف به ایفای تعهدات خود وفق مفاد این قرارداد نیز خواهد
          بود.
        </p>
        <p className="text-[23px]">
          3) صادر کننده موظف است در چک موضوع این ماده صرفاً جمله بایت قرارداد شماره
          <strong> {`3${agencyContract.investor_request?.contract_number || ''}`}</strong>
          مورخ 14/12/1403 را درج نموده و از درج هر گونه عبارت مازاد از قبیل بابت تضمین بابت ضمانت
          بابت حسن انجام کار و امثال هم خودداری نماید.
        </p>

        <h4 className="text-[23px] font-bold">(ب) ضامن</h4>

        <p className="text-[23px]">
          به منظور تضمین ایفای هر یک از تعهدات ناشی از این قرارداد متقاضی موظف است همزمان با امضای
          قرارداد نسبت به معرفی{' '}
          {`${agencyContract?.guarantor ? agencyContract?.guarantor?.length : 0}`} ضامن به شرح ذیل
          به شرکت اقدام نماید.
        </p>

        <p className="text-[23px]">
          {agencyContract.guarantor.map((item) => (
            <p className="text-[23px]">
              جناب آقای {item.guarantor_name} به شماره ملی{' '}
              <strong>{item.guarantor_national_id}</strong> متولد
              <strong>{item.guarantor_birth_date}</strong> به آدرس {item.guarantor_address} که از
              این پس در این قرارداد به عنوان «ضامن حقیقی» معرفی می گردد
            </p>
          ))}
          <br />
        </p>
      </div>
    </div>
  );
};

Page6.propTypes = {
  agencyContract: PropTypes.object.isRequired,
};

export default Page6;
