import React from 'react';
import { PropTypes } from 'prop-types';

const Page2 = ({ agencyContract }) => {
  if (!agencyContract) return null;

  return (
    <div className="contract-page page-1">
      <div className="text-justify leading-relaxed text-[23px] ">
        <br />
        <p className="text-justify leading-relaxed text-[23px]">
          2)شرکت <strong>{agencyContract.investor_request.company.title}</strong> (سهامی خاص) به
          شمارۀ شناسۀ ملی <strong>{agencyContract.investor_request.company.national_id}</strong>، کد
          اقتصادی <strong>{agencyContract.investor_request.company.economic_code}</strong>، و شماره
          ثبت <strong>{agencyContract.investor_request.company.registration_number}</strong> نزد
          اداره ثبت شركت ها و موسسات غيرتجاري يزد، استان يزد، شهرستان يزد، بخش مركزي، شهر يزد،
          صفاييه، خيابان شركت ها و موسسات غيرتجاري يزد، استان يزد، شهرستان يزد، بخش مركزي، شهر يزد،
          صفاييه، خيابان پژوهش، خيابان 10دانشگاه[بهار]، پلاك 0، ساختمان مجتمع مسكوني رزلند(ROSE
          LAND)، بلوك A، طبقه 4، واحد 403، کدپستی <strong>8915834258</strong>، شماره تماس
          38255950-035، و با نمایندگی آقای مجید حاجی زاده به شماره ملی
          <strong>4420356960</strong> به سمت مدیرعامل و رئیس هیئت‌مدیره به عنوان صاحب امضای مجاز بر
          اساس روزنامه رسمی شماره <strong>23274</strong> شهرستان مورخ <strong>29/11/1403</strong> که
          در این قرارداد،
          <strong>&quot;متقاضی/سرمایه‌پذیر&quot;</strong> نامیده می شود،
        </p>
        <p className="text-justify leading-relaxed text-[23px]">
          ِ 3) شخص حقیقی/حقوقی با مشخصات و اطلاعات سجامی مندرج در سکوی تأمین مالی جمعی عامل به نشانی
          <strong>Isatiscrowd.ir</strong> که در این قرارداد به اختصار &quot;تأمین کننده/سرمایه
          گذار&quot; نامیده می شود.
        </p>

        <p className="text-justify leading-relaxed text-[23px]">
          <span className="font-bold">تبصره:</span> واریز وجه توسط سرمایه‌گذار از طریق سکوی تأمین
          مالی جمعی عامل و نیز تأیید متن بیانیه ریسک و قوانین و مقررات مندرج در سکوی عامل به نشانی
          <strong>isatiscrowd.ir</strong>، به منزله امضای این قرارداد توسط سرمایه گذار تلقی میگردد.
        </p>
        <br />

        <h3 className="text-justify leading-relaxed text-[23px] font-bold"> 2) تعاریف</h3>
        <p className="text-justify leading-relaxed text-[23px]">
          اصطلاحات و واژگان مذکور در این قرارداد، در معنای عرفی و مرسوم خود به کار برده شده اند.
          سایر واژگان، دارای معانی ذیل هستند:
        </p>

        <p className="text-justify leading-relaxed text-[23px]">
          1) کارگروه ارزیابی منظور، کارگروهی است که در محل شرکت فرابورس ایران تشکیل میشود و دارای
          پنج عضو و یک دبیر به شرح ذیل میباشد:
          <br /> یک نفر به نمایندگی از رئیس سازمان بورس و اوراق بهادار ، دو نفر به نمایندگی از شرکت
          فرابورس ایران، دو کارشناس در حوزه فعالیت تأمین مالی جمعی با پیشنهاد شرکت فرابورس ایران و
          تأیید رئیس سازمان بورس و اوراق بهادار و یکی از مدیران شرکت فرابورس ایران به عنوان دبیر
          کارگروه بدون حق رأی. جلسات کارگروه ارزیابی با حضور تمامی اعضا تشکیل شده و تصمیمات آن با
          رأی موافق حداقل سه عضو که الزاماً یکی از آنها نماینده سازمان است، معتبر است.
        </p>
        <p className="text-justify leading-relaxed text-[23px]">
          2) دستورالعمل: منظور، دستورالعمل تأمین مالی جمعی مصوب 1397/02/25 شورای عالی بورس و اوراق
          بهادار و تمامی اصالحیه ها و ابلاغیه های کارگروه ارزیابی در آن خصوص، می باشد.
        </p>
        <p className="text-justify leading-relaxed text-[23px]">
          3) پلتفرم/سکو: منظور، نرم افزار و وبسایت تحت مدیریت عامل به نشانی Isatiscrowd.ir است که
          تحت نظارت شرکت فرابورس ایران، زمینه مشارکت عمومی در تأمین مالی جمعی کسب و کارها را فراهم
          می‌آورد.
        </p>
        <p className="text-justify leading-relaxed text-[23px]">
          4) ناظر فنی/مالی: شخص حقیقی یا حقوقی مورد تأیید فرابورس ایران است که حسب درخواست عامل یا
          کارگروه ارزیابی نسبت به ارزیابی اولیه یا نظارت بر حسن اجرای طرح تعریف شده توسط متقاضی،
          اقدام می کند.
        </p>
        <p className="text-justify leading-relaxed text-[23px]">
          5) طرح »: منظور، موضوع کسب و کار و فعالیت متقاضی است که عبارت از خرید و فروش برنج ایرانی،
          بوده و متقاضی، قصد تأمین منابع مالی مورد نیاز آن را وفق مفاد این قرارداد و از طریق مشارکت
          با سرمایه گذاران، دارد.
        </p>
        <p className="text-justify leading-relaxed text-[23px]">
          6) مبلغ سرمایه گذاری: منظور، مبلغی است که تأمین کننده در طرح سرمایه گذاری کرده و در ازای
          آن گواهی سرمایه گذاری به نام وی صادر شده است. تأمین کننده تا تاریخ اتمام طرح، حق مطالبه
          مبلغ سرمایه گذاری را تحت هر عنوان نداشته و طی این مدت، تنها مستحق دریافت اقساط خرید دارایی
          به تناسب مبلغ سرمایه گذاری خود خواهد بود.
        </p>

        <p className="text-justify leading-relaxed text-[23px]">
          7) گواهی سرمایه گذاری/گواهی شراکت»: منظور، گواهی ای است که متعاقب سرمایه گذاری، به میزان
          مبلغ سرمایه گذاری و به نام تأمین کننده، صادر و نشانگر حقوق و تکالیف تأمین کننده وفق مفاد
          این قرارداد می باشد.
        </p>
        <p className="text-justify leading-relaxed text-[23px]">
          8) طرح توجیهی»: منظور، گزارشی است که جهت تشریح و توجیه پذیری تأمین مالی طرح متقاضی و با
          توجه به مدارک و مستندات ارسالی متقاضی، توسط عامل تهیه می شود.
        </p>

        <p className="text-justify leading-relaxed text-[23px]">
          9) سرمایه: منظور، مجموع مبالغ سرمایه گذاری واریزشده از جانب تأمین کنندگان در تاریخ موفقیت
          کمپین می باشد که با رعایت شرایط مذکور در ای ن قرارداد و پس از کسر هزینه های قانونی (کارمزد
          عامل و شرکت فرابورس ایران)، توسط عامل به صورت یکجا، ظرف مدت 2 روز کاری جهت خرید دارایی های
          مورد نیاز به حساب متقاضی واریز میگردد.
        </p>
        <p className="text-justify leading-relaxed text-[23px]">
          10) فراخوان جمع آوری»: منظور، اعلان عمومی طرح در پلتفرم به منظور جذب سرمایه لازم برای
          تأمین منابع مالی مورد نیاز متقاضی، می باشد.
        </p>
        <p className="text-justify leading-relaxed text-[23px]">
          11) نماد طرح »: منظور، نمادی است که توسط شرکت فرابورس ایران و پس از ارسال مدارک و مستندات
          مربوطه، به طرح تخصیص داده میشود.
        </p>
        <p className="text-justify leading-relaxed text-[23px]">
          12) دوره جمع آوری»: منظور، یک دوره 21 روزه می باشد که با صلاح دید عامل و برای مدت حداکثر 2
          ماه قابل تمدید می باشد.
        </p>

        <p className="text-justify leading-relaxed text-[23px]">
          13) وکالت خرید»: منظور، وکالتی است که تأمین کننده، همزمان با واریز مبلغ سرمایه گذاری، جهت
          خرید داراییهای مورد نیاز به مبلغ{' '}
          <strong>
            {(agencyContract.investor_request.amount_of_investment / 1000000000).toLocaleString()}
          </strong>{' '}
          میلیون ریال از فروشنده مجاز، به متقاضی اعطا می نماید. نماید.
        </p>

        <p className="text-justify leading-relaxed text-[23px]">
          14) دارایی های خریداری شده: منظور، دارایی‌هایی است که متقاضی با استفاده از مبلغ سرمایه
          گذاری تأمین کننده و به استناد وکالت خرید، از فروشنده مجاز خریداری می نماید.
        </p>

        <p className="text-justify leading-relaxed text-[23px]">
          15) وکالت فروش: منظور، وکالتی است که سرمایه‌گذار ، همزمان با واریز مبلغ سرمایه گذاری، به
          متقاضی اعطا نموده و متقاضی به استناد آن، نسبت به انتقال دارایی های خریداری شده به خود
          (سرمایه پذیر) به مبلغ <strong>&#128512;&#128512;</strong> میلیون ریال، اقدام می نماید.
        </p>
        <p className="text-justify leading-relaxed text-[23px]">
          16) »حداقل مبلغ قابل پذیرش»: منظور، مبلغ{' '}
          <strong>
            {(agencyContract.investor_request.amount_of_investment * 0.8).toLocaleString()}
          </strong>{' '}
          ریال است که در صورت جذب آن تا پایان دوره جمع آوری، کمپین موفق فرض می گردد.
        </p>
        <p className="text-justify leading-relaxed text-[23px]">
          17) موفقیت کمپین»: منظور، اعم از موفقیت کمپین در جذب سرمایه به میزان حداقل مبلغ قابل پذیرش
          و یا جمع آوری کامل وجوه مورد نیاز (به مبلغ{' '}
          <strong>
            {(agencyContract.investor_request.amount_of_investment / 1000000000).toLocaleString()}
          </strong>{' '}
          میلیون ریال)، می باشد.
        </p>
        <p className="text-justify leading-relaxed text-[23px]">
          18) »تاریخ موفقیت کمپین»: منظور، تاریخی است که در آن، طرح موفق به جذب سرمایه به میزان
          حداقل مبلغ قابل پذیرش یا جمع‌آوری کامل وجوه مورد نیاز، می شود.
        </p>
        <p className="text-justify leading-relaxed text-[23px]">
          19) »آورده شخصی»: منظور، حداقل <strong>10 </strong>درصد سرمایه مورد نیاز (معادل مبلغ
          <strong>
            {(agencyContract.investor_request.amount_of_investment / 1000000000).toLocaleString()}
          </strong>{' '}
          میلیون ریال) است که متقاضی موظف است شخصاً نسبت به تأمین آن اقدام و ظرف مدت حداکثر 7 روز
          تقویمی از تاریخ درخواست مکتوب عامل، به شماره حساب عامل واریز نماید. انتشار فراخوان جمع
          آوری، منوط به واریز رقم مزبور توسط متقاضی می باشد.
        </p>

        <p className="text-justify leading-relaxed text-[23px]">
          20) »بدهی»: عبارت از اصل مبلغ سرمایه، اقساط خرید دارایی و حسب مورد وجه التزام و خسارات
          تعلقگرفته به آن، میباشد.
        </p>
      </div>
    </div>
  );
};

Page2.propTypes = {
  agencyContract: PropTypes.object.isRequired,
};

export default Page2;
