import React from 'react';
import { PropTypes } from 'prop-types';

const Page8 = ({ agencyContract }) => {
  if (!agencyContract) return null;

  return (
    <div className="contract-page page-1">
      <div className="text-justify leading-relaxed text-[23px]">
        <h3 className="text-[23px] font-bold">12) وجه التزام و خسارات قراردادی</h3>

        <h4 className="text-[23px] font-bold">الف) خسارت تأخیر:</h4>

        <p className="text-[23px]">
          1) در صورت تاخیر مقاضی در پرداخت اقساط خرید دارایی در مواعد پرداخت وفق پیوست ۱ و یا عدم
          بازپرداخت سرمایه در موعد مقرر وی موظف است علاوه بر ایفای اصل تعهد به ازای هر روز تأخیر پس
          از زمان سررسید میزان ۱۲ درصد بدهی پرداخت نشده را حسب مورد اقساط خرید دارایی و یا سرمایه)
          نیز به عنوان خسارت تأخیر، به عامل پرداخت نماید.
        </p>

        <p className="text-[23px]">
          2) متقاضی تعهد می نماید طبق شرایط و مفاد این قرارداد تعهدات خود را در مواعد مقرر انجام دهد
          و در صورت عدم انجام کلی و یا جزئی تعهدات قراردادی و تأخیر در ازای هر روز تأخیر پس از زمان
          سررسید میزان ۱۲ درصد از سرمایه را به عنوان خسارت تأخیر به شرکت پرداخت نماید. در هر صورت
          چنانچه تأخیر پیشامده بیش از ۲ روز به طول بیانجامد و بنابر تشخیص شرکت به دلیل تاخیر متقاضی
          در ایفای تعهدات مربوطه امکان ادامه فرآیند قرارداد وجود نداشته باشد. شرکت میتواند نسبت به
          فسخ قرارداد اقدام نماید.
        </p>
        <h3 className="text-[23px] font-bold">ب) وجه التزام</h3>
        <p className="text-[23px]">
          1) متقاضی متعهد است ظرف مدت حداکثر ۴۵ روز تقویمی از تاریخ واریز سرمایه نسبت به خرید دارایی
          های مورد نیاز از فروشنده مجاز و ارائه صورتحساب به شرکت اقدام نماید. در غیر این صورت متقاضی
          ملزم است علاوه بر ایفای اصل تعهد به ازای هر روز تأخیر پس از زمان سررسید میزان ۰/۲ درصد از
          سرمایه را به عنوان خسارت تأخیر به عامل پرداخت نماید. در هر صورت در فرض انقضای مدت ۹۰ روز
          تقویمی از تاریخ واریز سرمایه و عدم ارائه صورتحساب از جانب متقاضی شرکت مخیر در فسخ قرارداد
          خواهد بود.
        </p>
        <p className="text-[23px]">
          2) در صورتی که در هر زمان پس از امضای قرارداد کشف گردد که متقاضی نسبت به خرید داراییهای
          مورد نیاز از فروشندگان مجاز اقدام ننموده و با دارایی های مورد نیاز را از اشخاص وابسته
          خریداری نموده شرکت میتواند نسبت به فسخ قرارداد اقدام نماید. در این صورت متقاضی موظف است
          علاوه بر بازپرداخت سرمایه معادل مجموع اقساط خرید دارایی را نیز به عنوان خسارت عدم انجام
          تعهد به عامل پرداخت نماید.
        </p>

        <p className="text-[23px]">
          3) در صورت نقض هر یک از تعهدات قرارداد توسط متقاضی اعم از انتقال سرمایه با مصرف آن خارج از
          شرایط و ضوابط مقرر، سرمایه پذیر علاوه بر جبران کلیه خسارات وارده و بازپرداخت سرمایه و
          اقساط خرید دارایی به شرکت ملزم به پرداخت ۱۲ درصد از سرمایه نیز به عنوان وجه التزام به شرکت
          می باشد.
        </p>

        <p className="text-[23px]">
          4) در صورت انصراف متقاضی از ادامه همکاری تا پیش از انتشار فراخوان جمع آوری وی ملزم به
          پرداخت مبلغ <strong>%150 از مبلغ تامین مالی</strong> به عنوان خسارت عدم انجام تعهد به شرکت
          خواهد بود. شایان ذکر است انصراف متقاضی تا پیش از پرداخت خسارت مزبور واجد اثر نبوده و وی
          ملزم به ایفای تعهدات خود وفق مفاد این قرارداد در برابر شرکت و سرمایه گذار خواهد بود.
        </p>
        <p className="text-[23px]">
          <span className="font-bold">تبصره ۱:</span> پرداخت خسارت تأخیر و وجه التزام بدل از انجام
          تعهد نبوده و متقاضی در هر صورت موظف به ایفاء کامل تعهدات خویش می باشد.
        </p>

        <p className="text-[23px]">
          <span className="font-bold">تبصره ۲:</span> وصول وجه التزام، خسارات و بدهیهای متقاضی از
          محل تضامین مذکور در ماده ۱۱ مسقط حق طرح دعوا جهت جبران ضرر و زیان وارده به شرکت راجع صالح
          نخواهد بود.
        </p>
        <p className="text-[23px]">
          <span className="font-bold">تبصره 3:</span> خسارات و وجه التزامهای موضوع این ماده به عنوان
          حداقل خسارت مفروض بوده و در صورتی که خسارات وارده به شرکت مازاد بر مبالغ موضوع این ماده
          باشد شرکت مستحق در طرح دعوا به منظور مطالبه خسارات مازاد نیز خواهد بود.
        </p>
        <h3 className="text-[23px] font-bold">13) منع واگذاری</h3>
        <p className="text-[23px]">
          1) این قرارداد قائم به شخص بوده و متقاضی به هیچ نحو حق انتقال با واگذاری موضوع آن را به
          شخص با اشخاص ثالث نخواهد داشت.
        </p>
        <p className="text-[23px]">
          2) سرمایه اعطا شده در قالب این قرارداد غیر قابل فروش و نقل و انتقال بوده و متقاضی مجاز به
          انتقال و با فروش سرمایه به اشخاص ثالث نمی باشد.
        </p>
        <p className="text-[23px]">
          3) متقاضی مکلف است حداقل ۱۰ درصد سرمایه مورد نیاز را اصالتاً تأمین و پرداخت نماید و در این
          خصوص، حق اخذ وام، فرض و سایر تسهیلات را ندارد.
        </p>
        <p className="text-[23px]">
          4) متقاضی حق واگذاری دارایی های خریداری شده به غیر را ندارد و در این خصوص ملزم به رعایت
          مفاد وکالت فروش می باشد.
        </p>
        <h3 className="text-[23px] font-bold">14) اظهارات و اقاریر</h3>
        <h4 className="text-[23px] font-bold">الف) متقاضی به سایر طرف ها اظهار می نماید که:</h4>
        <p className="text-[23px]">
          1) با آگاهی کامل از مفاد قرارداد و رویه اجرایی آن نسبت به امضای قرارداد اقدام نموده است.
        </p>
        <p className="text-[23px]">
          2) برای انعقاد قرارداد حاضر و اجرای آن با ممنوعیت و محدودیتی مواجه نبوده و از زیر ساخت های
          فنی و قانونی مورد نیاز برای انجام موضوع قرار داد، برخوردار می باشد.
        </p>
        <p className="text-[23px]">
          3) دارایی های مورد نیاز را تماماً از فروشندگان مجاز خریداری نموده و در صورت اثبات خلاف این
          امر در هر زمان و به هر نحو مسئول پرداخت خسارات تعیین شده خواهد بود.
        </p>
        <p className="text-[23px]">
          4) در اجرای موضوع این قرارداد الزامات ناشی از مصوبات کارگروه ارزیابی در خصوص سقف تأمین
          مالی جمعی برای متقاضی و اشخاص وابسته به متقاضی را رعایت نموده و تمامی اطلاعات ضروری در این
          خصوص را به عامل ارائه نموده است.
        </p>
        <p className="text-[23px]">
          5) برای تامین مالی طرح موضوع این قرارداد به طور همزمان در پلتفرم دیگری اقدام نکرده است.
        </p>
        <p className="text-[23px]">
          6) با آگاهی کامل از موضوع این قرارداد نسبت به خرید داراییهای مورد نیاز و سپس انتقال دارایی
          های خریداری شده به خود اقدام می نماید.
        </p>
        <p className="text-[23px]">
          7) نسبت به قیمت خرید و فروش دارایی آگاهی و اطلاع کامل داشته و ضمن پذیرش مبلغ اقساط خرید
          دارایی به عنوان بدهی خود، حق هرگونه ادعای عین فاحش با افحش را از خود سلب و ساقط می نماید؛
        </p>
        <p className="text-[23px]">
          8) از زمره دستگاههای اجرایی موضوع ماده ۵ قانون مدیریت خدمات کشوری بانک یا مؤسسه مالی و
          اعتباری نهاد مالی دارای مجوز از سازمان بورس و اوراق بهار دار شرکت پذیرفته شده در بورس و
          بازار اول و دوم فرابورس با شرکت درج شده در بازار پایه فرابورس و همچنین مشمول هیچ یک از
          دیگر ممنوعیت های مندرج در دستور العمل نیز نمی باشد.
        </p>
        <p className="text-[23px]">
          9) تحت هیچ عنوان از موضوع این قرارداد با انتشار فراخوان جمع آوری در پلتفرم جهت امور
          تبلیغاتی و کسب درآمد استفاده ننموده و آن را دستاویر کسب اعتبار خود قرار نمی دهد.
        </p>
       
      </div>
    </div>
  );
};

Page8.propTypes = {
  agencyContract: PropTypes.object.isRequired,
};

export default Page8;
