import React from 'react';
import { PropTypes } from 'prop-types';
import moment from 'jalali-moment';

const Page9 = ({ agencyContract }) => {
  if (!agencyContract) return null;

  return (
    <div className="contract-page page-1">
      <div className="text-justify leading-relaxed text-[23px]">
      <p className="text-[23px]">
          10) مسئولیت پرداخت اقساط خرید دارایی و نیز بازپرداخت سرمایه در موعد مقرر بر عهده وی بوده و
          از این بابت هیچگونه مسئولیتی متوجه عامل نمی باشد.
        </p>
        <p className="text-[23px]">
          11) موضوع فعالیت وی حقوق مادی و معنوی اشخاص ثالث را نقض ننموده و هیچگونه دعاوی مؤثر و با
          اهمیت حقوقی با کیفری علیه شرکت و اعضای هیئت مدیره با مدیر عامل شرکت وجود ندارد
        </p>
        <p className="text-[23px]">
          12) مسئولیت کلبه خسارات و ضرر و زبان وارده در نتیجه با در رابطه با عدم صحت اظهارات و ضمانت
          های مقرر در این قرارداد را جبران نماید. این خسارت حداقل به میزان <strong>%120</strong>{' '}
          درصد سرمایه می باشد.
        </p>
        <h3 className="text-[23px] font-bold">ب) عامل به سایر طرف ها اظهار می نماید که:</h3>
        <p className="text-[23px]">
          1) از صلاحیت و اهلیت قانونی لازم جهت امضای این قرارداد و ایفای تعهدات آن برخوردار می باشد
        </p>
        <p className="text-[23px]">
          ۲) با رعایت شرایط و ضوابط مذکور در این قرارداد و وفق مقررات استفاده از پلتفرم، مقدمات
          تأمین مالی جمعی را فراهم می آورد.{' '}
        </p>
        <h3 className="text-[23px] font-bold">ج) سرمایه گذار به سایر طرف ها اظهار می نماید که:</h3>
        <p className="text-[23px]">
          1) با تایید الکترونیکی قوانین و مقررات و بیانیه ریسک مندرج در پلتفرم کلیه اختیارات و حقوق
          مربوط به پیگیری اداری و قضایی جهت مطالبات مربوط به این قرارداد را وفق مفاد مندرج در
          وکالتنامه به عامل منتقل نموده و عامل را جهت هرگونه اقدام قضایی اداری و اجرایی جهت وصول
          مطالبات اعم از اصل مبلغ سرمایه گذاری اقساط خرید دارایی خسارات وارده و سایر هزینه های
          مربوطه نماینده و وکیل خود قرار داده است.
        </p>
        <p className="text-[23px]">
          2) ضمن آگاهی کامل از ماهیت ریسک و مخاطرات سرمایه گذاری در زمینه طرح موضوع این قرارداد از
          رویه اجرایی قرارداد و نیز ضوابط استفاده از خدمات پلتفرم اطلاع کامل داشته و هیچ امر مجهول و
          با مبهمی برای وی وجود ندارد؛
        </p>
      <p className="text-[23px]">
          3) ضمن برخورداری از صلاحیت و اهلیت قانونی لازم جهت امضای این قرارداد و ایفای تعهدات مندرج
          در آن برای سرمایه گذاری در طرح با هیچگونه محدودیت و ممنوعیت قانونی مواجه نبوده و با رعایت
          قوانین و مقررات لازم الاجرا از جمله قانون مبارزه با تأمین مالی تروریسم و پولشویی نسبت به
          انعقاد قرارداد حاضر اقدام نموده است.
        </p>
        <p className="text-[23px]">
          4) اطلاعات کاربری و شماره حساب ثبت شده در حساب کاربری او در پلتفرم متعلق به وی بوده و کلیه
          پرداختهای موضوع این قرارداد به همان حساب واریز و مسئولیت وقوع هرگونه اشتباه از این بابت را
          شخصاً بر عهده گرفته و هیچگونه مسئولیتی متوجه عامل و متقاضی، نمی باشد.
        </p>

      <p className="text-[23px]">
          5) تا تاریخ اتمام طرح، حق مطالبه مبلغ سرمایه گذاری را نداشته و مبلغ یاد شده، صرفاً در
          تاریخ اتمام طرح و پس از واریز توسط متقاضی، توسط عامل به شماره حساب وی واریز می گردد؛
        </p>
        <p className="text-[23px]">
          6) پرداخت های موضوع این قرارداد بر عهده بانک و درگاه مربوطه است. لذا در صورت بروز مشکل در
          پرداخت از جانب بانک مبلغ پرداختی از طریق درگاه مورد استفاده به حساب مبداً عودت داده خواهد
          شد.
        </p>
      <h3 className="text-[23px] font-bold">15) خاتمه قرارداد </h3>
        <p className="text-[23px]">
          1) قرارداد حاضر در زمره عقود لازم بوده و جز در موارد مذکور در این قرارداد، منحل نخواهد شد.{' '}
        </p>
        <p className="text-[23px]">
          خرید دارایی های مورد نیاز به استناد وکالت خرید و نیز انتقال دارایی های خریداری شده به
          متقاضی به استناد وکالت فروش هر دو با علم و آگاهی کامل متقاضی نسبت به قیمت خرید و فروش و
          سایر شرایط معامله واقع شده و مقاضی تحت هیچ عنوان از قبیل ادعای عین فاحش و افحش، حق فسخ آن
          را نخواهد داشت.
        </p>
        <p className="text-[23px]">
          <span className="font-bold">تبصره ۱:</span> در صورت فسخ این قرارداد در موارد تعیین شده
          متقاضی موظف است ظرف مدت حداکثر ۲ روز کاری از تاریخ اعلام فسخ نسبت به بازپرداخت سرمایه به
          عامل اقدام نماید. در غیر این صورت مشمول خسارات تعیین شده در ماده ۱۲ بوده و شرکت مستحق در
          وصول مطالبات خود از محل هر یک از تضامین مذکور در این قرارداد خواهد بود.
        </p>
        <p className="text-[23px]">
          <span className="font-bold">تبصره ۲:</span> در موارد فسخ این قرارداد حق الزحمه های موضوع
          ماده ۵ به متقاضی مسترد نخواهد شد.
        </p>
        <h3 className="text-[23px] font-bold"> 17) قانون حاکم و حل و فصل اختلافات </h3>
        <p className="text-[23px]">
          تمامی ضمانم این قرارداد از جمله وکالت های خرید و فروش طرح توجیهی و دستورالعمل در حکم
          قرارداد حاضر محسوب و از اعتباری واحد برخوردارند. کلیه اختلافات ناشی از این قرارداد اعم از
          و نه محدود به انعقاد صحت بطلان انحلال، فسخ، تأیید فسخ و همچنین اختلاف در هر یک از مواد
          قرارداد و یا تفسیر و اجرای آن وفق مفاد ماده ۳۶ قانون بازار اوراق بهادار جمهوری اسلامی
          ایران حل و فصل خواهد شد.
        </p>
        <h3 className="text-[23px] font-bold">18) تفسیر قرارداد </h3>
        <p className="text-[23px]">
          بنابر توافق اطراف قرارداد نظم خاص حاکم بر این قرارداد وفق بند &quot;ساختار کلی
          قرارداد&quot; در مقدمه قرارداد بر این مبنا استوار است.
        </p>
        <p className="text-[23px]">
          1) مجموع مبالغی که توسط عامل به حساب متقاضی واریز می گردد، بایستی صرفاً وفق مفاد این
          قرارداد و جهت خرید دارایی های مورد نیاز مصرف گردد.
        </p>  
        <p className="text-[23px]">
          2) با عنایت به آنکه سرمایه واریز شده به حساب متقاضی حاصل تجمیع مبالغ سرمایه گذاری تأمین
          کنندگان متعدد است. تعهدات متقاضی وفق مفاد این قرارداد به ازای مبلغ تمام سرمایه بوده و تحت
          هیچ عنوان قابل تجزیه نمی باشد.
        </p>

        <p className="text-[23px]">
          3) با عنایت به آنکه سرمایه واریزی به حساب متقاضی بایستی در جهت خاصی مصرف گردد. بدین ترتیب
          ماهیت وکالت خرید موضوع این قرارداد به هیچ عنوان دال بر اختیار متقاضی نسبت به انجام موضوع
          وکالت نبوده و خرید دارایی های مورد نیاز وفق مفاد قرارداد تعهدی قطعی بر ذمه متقاضی می باشد.
          ۱- به مجرد خرید دارایی های مورد نیاز توسط متقاضی با استفاده از مبلغ سرمایه گذاری و به
          استناد وکالت خرید وکالت فروش نیز انجام شده تلقی و تعهدپرداخت اقساط خرید دارایی در مواعد
          پرداخت بر ذمه مقاضی مستقر می گردد. ۱۰۵ - با عنایت به آنکه قرارداد حاضر بایستی به عنوان یک
          کل واحد و غیر قابل تجزیه در نظر گرفته شود. بدین ترتیب خرید و فروش واقع شده به استناد وکالت
          خرید و فروش تحت هیچ عنوان قابلیت فسخ و انحلال نداشته و به عنوان جزئی از فرآیند اجرایی
          قرارداد لازم و قطعی خواهد بود و -۱- واریز مبلغ سرمایه گذاری توسط تأمین کننده به معنای
          پذیرش کامل مفاد این قرارداد و اعطای وکالت بلاعزل با سلب حق انجام موضوع وکالت از موکل
          (سرمایه گذار) به مدت طرح میباشد. بدین ترتیب به مجرد سرمایه گذاری تأمین کننده تحت هیچ عنوان
          رأساً حق پیگیری حقوق خود را نداشته و اختیار آن را با همزمان با واریز مبلغ سرمایه گذاری به
          عامل تفویض نمود.
        </p>

      
      </div>
    </div>
  );
};

Page9.propTypes = {
  agencyContract: PropTypes.object.isRequired,
};

export default Page9;
