import React from 'react';
import { PropTypes } from 'prop-types';
import moment from 'jalali-moment';

const Page9 = ({ agencyContract }) => {
  if (!agencyContract) return null;

  return (
    <div className="contract-page page-1">
      <div className="text-justify leading-relaxed text-[23px]">
      <p className="text-[23px]">
          <span className="text-[23px] font-bold">1)</span>
          با عنایت به آنکه عامل به عنوان مدیر پلتفرم و وکیل سرمایه گذار در انجام امور مربوط به این
          قرارداد صرفاً مسئول نظارت بر حسن اجرای قرارداد و اخذ مبالغ اقساط خرید دارایی و سرمایه از
          متقاضی و واریز به حساب سرمایه گذار می باشد. لذا هر گونه تفسیر برآمده از مفاد قرارداد که به
          هر نحو منجر به ایجاد مسئولیت در پرداخت برای شرکت گردد، مردود و غیر قابل پذیرش می باشد.
        </p>

        <p className="text-[23px]">
          <span className="text-[23px] font-bold">2)</span>
          وثایق و تضامین مذکور در ماده ۱۱ قرارداد به عنوان تضمین پرداخت مبالغ مربوط به اقساط خرید
          دارایی سرمایه و نیز خسارات و وجه التزام های متعلقه به آنها بوده و شرکت برای وصول مطالبات
          خود از محل تضامین و وثایق یاد شده محتاج به اثبات امری نبوده و صرف عدم پرداخت بدهی از جانب
          متقاضی در موعد مقرر به منزله اثبات وقوع تخلف تلقی می گردد.
        </p>

        <p className="text-[23px]">
          <span className="text-[23px] font-bold">3)</span>
          هرگونه تفسیر برآمده از قرارداد که در تعارض با ساختار کلی قرارداد و نکات مذکور در بندهای
          فوق باشد مورد قبول طرفین نمی باشد.
        </p>

        <h3 className="text-[23px] font-bold">16) اقامتگاه طرفین</h3>

        <p className="text-[23px]">
          اقامتگاه طرفین همان نشانی مذکور در ماده ۱ قرارداد است. هر کدام از طرفین موظف است در صورت
          تغییر نشانی مذکور حداکثر ظرف مدت ۷ روز، تغییر صورت گرفته را کتباً به اطلاع طرف دیگر
          برساند. در غیر این صورت ارسال هرگونه استاد و اوراق اداری و قضایی اعم از مرسولات اداری،
          اخطاریه ها و احضاریه ها به نشانی های فوق الذکر، دریافت شده و در حکم ابلاغ واقعی محسوب می
          گردد.
        </p>
        <p className="text-[23px]">
          <span className="text-[23px] font-bold">تبصره ۱:</span>
          ارتباطات الکترونیکی از قبیل پیامک ایمیل و امثالهم فقط صادر شده از جانب شرکت در حکم مکاتبات
          رسمی تلقی می گردد.
        </p>

        <p className="text-[23px]">
          <span className="text-[23px] font-bold">تبصره ۲:</span>
          اعلام نشانی جدید شرکت بر روی پلتفرم به منزله اعلام آن به متقاضی و سرمایه گذار می باشد.
        </p>

        <h3 className="text-[23px] font-bold">17)نسخ قرارداد </h3>
        <p className="text-[23px]">
          این قرارداد در ۲۰ ماده و بدون هرگونه قلم خوردگی در ۲ نسخه متحد المتن که همگی حکم واحد را
          دارد در نشانی شرکت تنظیم و در تاریخ <strong>{moment(agencyContract.investor_request.agency_agreement_date).format('jYYYY/jMM/jDD')}</strong> امضاء و میان طرفین مبادله شد. یک نسخه از
          قرارداد در اختیار شرکت و نسخه دوم در اختیار متقاضی میباشد.{' '}
        </p>
      </div>
    </div>
  );
};

Page9.propTypes = {
  agencyContract: PropTypes.object.isRequired,
};

export default Page9;
