import React from 'react';
import { PropTypes } from 'prop-types';

const Page5 = ({ agencyContract }) => {
  if (!agencyContract) return null;

  return (
    <div className="contract-page page-1">
      <div className="text-justify leading-relaxed text-[23px]">
        <h3 className="text-[23px] font-bold">5) حق الزحمه ارائه خدمات و نحوه پرداخت </h3>
        <p>
          <span className="font-bold">الف)</span> حق الزحمه عامل بابت ارائه خدمات تأمین مالی جمعی به
          متقاضی و خدمات ارائه شده در سکو، جمعاً به میزان 3،000,000,000 ریال، معادل سیصد میلیون
          تومان میباشد که به شرح مندرج در بند ب این ماده در وجه عامل پرداخت خواهدشد.
        </p>
        <p>
          <span className="font-bold">الف)</span> نحوه پرداخت: مبلغ مذکور در بند فوق پس از موفقیت
          کمپین، از مجموع مبالغ جمع آوری شده کسر و به عنوان حق الزحمه عامل منظور خواهدشد.
        </p>
        <br />
        <p>
          <span className="font-bold">تبصره :)</span> به مبالغ مذکور در این ماده، 10 درصد مالیات بر
          ارزش افزوده نیز تعلق گرفته و متقاضی موظف به تأدیه آن در وجه عامل خواهدبود.
        </p>
        <h3 className="text-[23px] font-bold">6)الزامات و تشریفات تامین مالی</h3>
        <p>
          <span className="font-bold">الف) تهیه طرح توجیهی و ارزیابی متقاضی:</span> 1) به مجرد ثبت
          درخواست تأمین مالی توسط متقاضی و ارسال مدارک و مستندات درخواستیِ عامل ، عامل نسبت به بررسی
          مدارک ارسالی و ارزیابی کسب و کار متقاضی اقدام مینماید.
        </p>
        <p>
          2) در صورتی که متعاقب ارزیابی های بعمل آمده توسط شرکت، متقاضی واجد شرایط لازم جهت تأمین
          مالی باشد، شرکت نسبت به تهیه و ارسال طرح توجیهی و سایر مدارک و مستندات مورد نیاز به شرکت
          فرابورس ایران جهت اخذ نماد طرح ، اقدام می نماید
        </p>
        <p>
          3) امضای این قرارداد و یا ارزیابی متقاضی و تهیه طرح توجیهی، به معنای الزام شرکت به پذیرش
          درخواست متقاضی مبنیبر تأمین مالی نبوده و شرکت در قبول و یا رد درخواست، اختیار تام دارد.
          بدین ترتیب، صرفاً واریز سرمایه به حساب متقاضی، به منزله تأیید نهایی تأمین مالی میباشد.
        </p>
        <p>
          <span className="font-bold">ب)</span> متقاضی موظف به تامین مالی جمعی به میزان
          3،000,000,000 فرآیند تأمین مالی متقاضی صرفاً وفق مفاد این ماده و با رعایت شرایط و ضوابط
          مذکور در ذیل انجام خواهدشد{' '}
        </p>
        <p>
          <span className="font-bold">ب)انتشار فراخوان جمع‌آوری:</span>
          <br />
          <span className="font-bold">4)</span> در راستای ارسال مدارک و مستندات به شرکت فرابورس
          ایران، متقاضی متعهد است ظرف مدت حداکثر 7 روز تقویمی از تاریخ درخواست مکتوب عامل، نسبت به
          تأمین آورده شخصی و واریز آن به شماره حساب عامل، اقدام نماید.
        </p>
        <p>
          شایان ذکر است انتشار فراخوان جمعآوری بر روی سکو، منوط به تأمین آورده شخصی توسط متقاضی
          میباشد.
        </p>
        <p>
          <span className="font-bold">5)</span>در ازای آورده شخصی، گواهی سرمایه گذاری به نام متقاضی
          صادر می گردد. بدین ترتیب، متقاضی، اولین سرمایه گذار طرح محسوب شده و تا تاریخ اتمام طرح و
          ایفای کامل تعهدات و انجام تسویه حساب های مربوطه، حق مطالبه، برداشت و انتقال گواهی صادره به
          هر عنوان را نخواهدداشت.
        </p>
        <p>
          <span className="font-bold">6)</span>در صورت موفقیت کمپین در پایان دوره جمع آوری، وجوه جمع
          آوری شده وفق شرایط و ضوابط مذکور در ذیل به متقاضی پرداخت خواهدشد.
        </p>
        <p>
          تبصره :1 در صورت اتمام دوره جمع آوری و عدم موفقیت کمپین، وجوه واریزی از جانب سرمایه گذار،
          ظرف مدت حداکثر 3 روز کاری به شماره حساب سرمایه‌گذار مسترد خواهدشد.
        </p>
        <h3 className="text-[23px] font-bold"> ج) پرداخت وجوه جمع‌آوری شده به متقاضی:</h3>
        <p className="text-justify leading-relaxed text-[22px]">
          7) از وجوه جمع آوری شده، حق الزحمه عامل به میزان مقرر در ماده 5 و نیز کارمزد شرکت فرابورس
          ایران به میزان 200,000,000 ریال، معادل بیست میلیون تومان کسر و مابقی ظرف مدت 2 روز کاری،
          به شماره حساب متقاضی واریز خواهدشد.
        </p>
        <p className="text-justify leading-relaxed text-[22px]">
          8) در هر حال، پرداخت وجوه جمع آوری شده به متقاضی، منوط به سپردن وثایق و تضامین مذکور در
          ماده 11 به نفع عامل می باشد.
        </p>
        <p className="text-justify leading-relaxed text-[22px]">
          9) متقاضی مکلف است چک های پرداخت اقساط خرید دارایی و بازپرداخت اصل سرمایه را مطابق طرح
          جمعاً به مبلغ 281،00 میلیون ریال، حداکثر ظرف مدت دو روز کاری از تاریخ پایان دوره جمع آوری،
          طی یک فقره چک بابت اصل مبلغ سرمایه به تاریخ اعالمی توسط عامل و چهار فقره چک بابت اقساط
          خرید دارایی، با تاریخهای پرداخت 4 روز کاری قبل از مواعد پرداخت، به عامل تحویل نماید. در
          غیر این صورت، عامل تعهدی نسبت به پرداخت وجوه جمع آوری شده به متقاضی نداشته و صرفاً آورده
          شخصی، پس از کسر مبلغ 3،000 میلیون ریال (سیصد میلیون تومان ) به عنوان خسارت عدم انجام تعهد،
          به متقاضی عودت داده خواهدشد و قرارداد از سوی عامل فسخ میگردد.
        </p>
        <h3 className="text-[23px] font-bold"> د) شرایط و ضوابط مصرف سرمایه:</h3>
        <p className="text-justify leading-relaxed text-[22px]">
          <span className="font-bold">10)</span> متقاضی متعهد به مصرف سرمایه، صرفاً جهت خرید دارایی
          های مورد نیاز از فروشنده مجاز می باشد.
        </p>

        <p className="text-justify leading-relaxed text-[22px]">
          <span className="font-bold">11)</span> متقاضی متعهد است هرگونه تغییر در لیست دارایی های
          مورد نیاز و یا فروشندگان مجاز را به اطلاع عامل رسانده و پس از کسب تأیید کتبی عامل، نسبت به
          خرید اقدام نماید.
        </p>

        <p className="text-justify leading-relaxed text-[22px]">
          <span className="font-bold">12)</span> متقاضی متعهد است ظرف مدت حداکثر 45 روز تقویمی از
          تاریخ واریز سرمایه، نسبت به خرید دارایی های مورد نیاز از فروشنده مجاز و ارائه صورتحساب به
          عامل، اقدام نماید. بدیهی است حداکثر مهلت متقاضی جهت خرید داراییهای مورد نیاز و ارائه
          صورتحساب به عامل، 45 روز تقویمی بوده و متقاضی نمیتواند به عذر تغییر در لیست داراییهای مورد
          نیاز و یا فروشندگان مجاز، از اجرای تعهد ظرف مهلت مقرر استنکاف نماید
        </p>

        <p className="text-justify leading-relaxed text-[22px]">
          <span className="font-bold">تبصره :2</span> مستند احراز خریدِ دارایی های مورد نیاز توسط
          متقاضی، صرفاً صورتحساب بوده و عدم ارائه صورتحساب ظرف مهلت مقرر، به منزله عدم خرید توسط
          متقاضی میباشد. بدیهی است در فرض اخیر، متقاضی متعهد به پرداخت خسارات تعیین شده خواهدبود
        </p>

        <p className="text-justify leading-relaxed text-[22px]">
          <span className="font-bold">تبصره :3</span> متقاضی می تواند در هر مرحله و صرفاً تا پیش از
          انتشار فراخوان جمع آوری بر روی سکو، با رعایت شرایط مذکور در این قرارداد از ادامه همکاری
          انصراف دهد .
        </p>

        <p className="text-justify leading-relaxed text-[22px]">
          <span className="font-bold">تبصره :4</span> در صورت حصول سود مازاد وفق مفاد این قرارداد
          ناشی از طرح، متقاضی موظف است مبالغ مزبور را به نسبت مبلغ سرمایهگذاری هر تأمین کننده به وی
          پرداخت نماید.
        </p>

        <h3 className="text-[23px] font-bold">
          {' '}
          7) بازپرداخت بدهی (سرمایه، اقساط خرید دارایی، وجه التزام، خسارات)
        </h3>
        <p>
          متقاضی متعهد است وفق مفاد این ماده و در مواعد مقرر، نسبت به بازپرداخت سرمایه و نیز پرداخت
          اقساط خرید دارایی اقدام نماید:
        </p>
        <h3 className="text-[23px] font-bold"> الف) بازپرداخت سرمایه:</h3>
        <p>
          متقاضی متعهد است در تاریخ اتمام طرح و نهایتاً ظرف مدت حداکثر 1 روز تقویمی از آن تاریخ،
          نسبت به بازپرداخت سرمایه و واریز رقم مربوطه (مبلغ 200،000،000،000 ریال، معادل
          20،000,000,000 تومان) به شماره حساب عامل اقدام نماید. عامل ، به وکالت از سرمایه گذار نسبت
          به اخذ مبلغ یادشده از متقاضی اقدام نموده و مطابق با رقم مندرج در گواهی سرمایه گذاری، مبلغ
          سرمایهگذاری هر تأمین کننده را به شماره حساب وی واریز می نماید.
        </p>

        <h3 className="text-[23px] font-bold"> ب) اقساط خرید دارایی:</h3>
        <p>
          متقاضی متعهد است وفق مفاد مذکور در پیوست 1 و در مواعد پرداخت، نسبت به واریز اقساط خرید
          دارایی به شماره حساب عامل، اقدام نماید
        </p>





      </div>
    </div>
  );
};

Page5.propTypes = {
  agencyContract: PropTypes.object.isRequired,
};

export default Page5;
