import React from 'react';
import { PropTypes } from 'prop-types';

const Page7 = ({ agencyContract }) => {
  if (!agencyContract) return null;

  return (
    <div className="contract-page page-1">
      <div className="text-justify leading-relaxed text-[23px]">
        <h4 className="text-[23px] font-bold">د) آورده شخصی</h4>

        <p>
          در فرض وجود شرایط لازم و دسترسی شرکت به آورده شخصی شرکت مستحق در وصول بدهی و مطالبات خود
          از آن محل نیز خواهد بود.
        </p>

        <h4 className="text-[23px] font-bold">ه) اموال و دارایی های متقاضی نزد شرکت</h4>

        <p className="text-[23px]">
          شرکت مستحق در وصول مطالبات ناشی از این قرارداد از جمله مبالغ مربوط به اقساط خرید دارایی و
          مبالغ سرمایه گذاری و حسب مورد خسارات و وجه التزام های متعلقه به آن از محل کلیه دارایی ها،
          اوراق بهادار مطالبات سود سهام و سایر اموال و دارایی های متقاضی و ضامن نزد خود با صندوق های
          تحت مدیریت، به هر شکل و تحت هر عنوان و به موجب هر قرارداد دیگری که نزد عامل موجود است یا
          پس از امضای این قرارداد موجود خواهد شد میباشد. متقاضی با امضای ذیل این قرارداد به صورت غیر
          قابل برگشت به شرکت اذن در رجوع به موارد مذکور و وصول مطالبات ناشی از این قرارداد را اعطا
          نمود.
        </p>

        <p className="text-[23px] font-bold">
          <span className="font-bold">تبصره 1:</span> در صورت استنکاف متقاضی از ایفای تعهدات مذکور
          در این قرارداد از جمله عدم پرداخت اقساط خرید دارایی در مواعد پرداخت و با بازپرداخت سرمایه
          در موعد مقرره شرکت راسا و بدون نیاز به مراجعه به مراجع قضایی و اداری مستحق در وصول مطالبات
          خود اعم از اصل مبلغ و حسب مورد خسارات و وجه التزام های متعلقه به آن از محل هر یک از تضامین
          و وثایق موضوع این ماده خواهد بود. شایان ذکر است انتخاب هر یک از تضامین و وثایق مذکور جهت
          وصول مطالبات به صلاحدید شرکت بوده و رجوع به هر یک از تضامین مانع وصول مطالبات از محل سایر
          تضامین نخواهد بود.
        </p>

        <p className="text-[23px] font-bold">
          <span className="font-bold">تبصره 2:</span> شرکت راسا و بدون نیاز به مراجعه به مراجع قضایی
          و اداری مستحق در وصول مبالغ مربوط به خسارت و وجه التزام مذکور در ماده ۱۲ قرار داده از محل
          هر یک از تضامین و وثایق مندرج در این ماده خواهد بود. شایان ذکر است انتخاب هر یک از تضامین
          و وثایق مذکور جهت وصول مطالبات، به صلاحدید شرکت بوده و رجوع به هر یک از تضامین مانع وصول
          مطالبات از محل سایر تضامین نخواهد بود.
        </p>

        <h3 className="text-[23px] font-bold">2) وجه التزام و خسارات قراردادی</h3>

        <h4 className="text-[23px] font-bold">ه) اموال و دارایی های متقاضی نزد شرکت</h4>

        <p className="text-[23px]">
          شرکت مستحق در وصول مطالبات ناشی از این قرارداد از جمله مبالغ مربوط به اقساط خرید دارایی و
          مبالغ سرمایه گذاری و حسب مورد خسارات و وجه التزام های متعلقه به آن از محل کلیه دارایی ها،
          اوراق بهادار مطالبات سود سهام و سایر اموال و دارایی های متقاضی و ضامن نزد خود با صندوق های
          تحت مدیریت، به هر شکل و تحت هر عنوان و به موجب هر قرارداد دیگری که نزد عامل موجود است یا
          پس از امضای این قرارداد موجود خواهد شد میباشد. متقاضی با امضای ذیل این قرارداد به صورت غیر
          قابل برگشت به شرکت اذن در رجوع به موارد مذکور و وصول مطالبات ناشی از این قرارداد را اعطا
          نمود.
        </p>

        <p className="text-[23px] font-bold">
          <span className="font-bold">تبصره 1:</span> در صورت استنکاف متقاضی از ایفای تعهدات مذکور
          در این قرارداد از جمله عدم پرداخت اقساط خرید دارایی در مواعد پرداخت و با بازپرداخت سرمایه
          در موعد مقرره شرکت راسا و بدون نیاز به مراجعه به مراجع قضایی و اداری مستحق در وصول مطالبات
          خود اعم از اصل مبلغ و حسب مورد خسارات و وجه التزام های متعلقه به آن از محل هر یک از تضامین
          و وثایق موضوع این ماده خواهد بود. شایان ذکر است انتخاب هر یک از تضامین و وثایق مذکور جهت
          وصول مطالبات به صلاحدید شرکت بوده و رجوع به هر یک از تضامین مانع وصول مطالبات از محل سایر
          تضامین نخواهد بود.
        </p>

        <p className="text-[23px] font-bold">
          <span className="font-bold">تبصره 2:</span> شرکت راسا و بدون نیاز به مراجعه به مراجع قضایی
          و اداری مستحق در وصول مبالغ مربوط به خسارت و وجه التزام مذکور در ماده ۱۲ قرار داده از محل
          هر یک از تضامین و وثایق مندرج در این ماده خواهد بود. شایان ذکر است انتخاب هر یک از تضامین
          و وثایق مذکور جهت وصول مطالبات، به صلاحدید شرکت بوده و رجوع به هر یک از تضامین مانع وصول
          مطالبات از محل سایر تضامین نخواهد بود.
        </p>

        <h3 className="text-[23px] font-bold">12) وجه التزام و خسارات قراردادی</h3>

        <h4 className="text-[23px] font-bold">الف) خسارت تأخیر:</h4>

        <p className="text-[23px]">
          1) در صورت تاخیر مقاضی در پرداخت اقساط خرید دارایی در مواعد پرداخت وفق پیوست ۱ و یا عدم
          بازپرداخت سرمایه در موعد مقرر وی موظف است علاوه بر ایفای اصل تعهد به ازای هر روز تأخیر پس
          از زمان سررسید میزان ۱۲ درصد بدهی پرداخت نشده را حسب مورد اقساط خرید دارایی و یا سرمایه)
          نیز به عنوان خسارت تأخیر، به عامل پرداخت نماید.
        </p>

        <p className="text-[23px]">
          2) متقاضی تعهد می نماید طبق شرایط و مفاد این قرارداد تعهدات خود را در مواعد مقرر انجام دهد
          و در صورت عدم انجام کلی و یا جزئی تعهدات قراردادی و تأخیر در ازای هر روز تأخیر پس از زمان
          سررسید میزان ۱۲ درصد از سرمایه را به عنوان خسارت تأخیر به شرکت پرداخت نماید. در هر صورت
          چنانچه تأخیر پیشامده بیش از ۲ روز به طول بیانجامد و بنابر تشخیص شرکت به دلیل تاخیر متقاضی
          در ایفای تعهدات مربوطه امکان ادامه فرآیند قرارداد وجود نداشته باشد. شرکت میتواند نسبت به
          فسخ قرارداد اقدام نماید.
        </p>
        <h3 className="text-[23px] font-bold">ب) وجه التزام</h3>
        <p className="text-[23px]">
          1) متقاضی متعهد است ظرف مدت حداکثر ۴۵ روز تقویمی از تاریخ واریز سرمایه نسبت به خرید دارایی
          های مورد نیاز از فروشنده مجاز و ارائه صورتحساب به شرکت اقدام نماید. در غیر این صورت متقاضی
          ملزم است علاوه بر ایفای اصل تعهد به ازای هر روز تأخیر پس از زمان سررسید میزان ۰/۲ درصد از
          سرمایه را به عنوان خسارت تأخیر به عامل پرداخت نماید. در هر صورت در فرض انقضای مدت ۹۰ روز
          تقویمی از تاریخ واریز سرمایه و عدم ارائه صورتحساب از جانب متقاضی شرکت مخیر در فسخ قرارداد
          خواهد بود.
        </p>
        <p className="text-[23px]">
          2) در صورتی که در هر زمان پس از امضای قرارداد کشف گردد که متقاضی نسبت به خرید داراییهای
          مورد نیاز از فروشندگان مجاز اقدام ننموده و با دارایی های مورد نیاز را از اشخاص وابسته
          خریداری نموده شرکت میتواند نسبت به فسخ قرارداد اقدام نماید. در این صورت متقاضی موظف است
          علاوه بر بازپرداخت سرمایه معادل مجموع اقساط خرید دارایی را نیز به عنوان خسارت عدم انجام
          تعهد به عامل پرداخت نماید.
        </p>

        <p className="text-[23px]">
          3) در صورت نقض هر یک از تعهدات قرارداد توسط متقاضی اعم از انتقال سرمایه با مصرف آن خارج از
          شرایط و ضوابط مقرر، سرمایه پذیر علاوه بر جبران کلیه خسارات وارده و بازپرداخت سرمایه و
          اقساط خرید دارایی به شرکت ملزم به پرداخت ۱۲ درصد از سرمایه نیز به عنوان وجه التزام به شرکت
          می باشد.
        </p>
        <p className="text-[23px]">
          4) در صورت انصراف متقاضی از ادامه همکاری تا پیش از انتشار فراخوان جمع آوری وی ملزم به
          پرداخت مبلغ <strong>%150 از مبلغ تامین مالی</strong>{' '}
           به عنوان خسارت عدم انجام تعهد به شرکت خواهد بود. شایان ذکر است انصراف متقاضی تا پیش
          از پرداخت خسارت مزبور واجد اثر نبوده و وی ملزم به ایفای تعهدات خود وفق مفاد این قرارداد در
          برابر شرکت و سرمایه گذار خواهد بود.
        </p>
        <p className="text-[23px]">
          <span className="font-bold">تبصره ۱:</span> پرداخت خسارت تأخیر و وجه التزام بدل از انجام
          تعهد نبوده و متقاضی در هر صورت موظف به ایفاء کامل تعهدات خویش می باشد.
        </p>
        <p className="text-[23px]">
          <span className="font-bold">تبصره ۲:</span> وصول وجه التزام، خسارات و بدهیهای متقاضی از
          محل تضامین مذکور در ماده ۱۱ مسقط حق طرح دعوا جهت جبران ضرر و زیان وارده به شرکت راجع صالح
          نخواهد بود.
        </p>
        <p className="text-[23px]">
          <span className="font-bold">تبصره 3:</span> خسارات و وجه التزامهای موضوع این ماده به عنوان
          حداقل خسارت مفروض بوده و در صورتی که خسارات وارده به شرکت مازاد بر مبالغ موضوع این ماده
          باشد شرکت مستحق در طرح دعوا به منظور مطالبه خسارات مازاد نیز خواهد بود.
        </p>
      </div>
    </div>
  );
};

Page7.propTypes = {
  agencyContract: PropTypes.object.isRequired,
};

export default Page7;
