import React from 'react';
import { PropTypes } from 'prop-types';
import { formatNumber } from 'src/utils/formatNumbers';
import moment from 'jalali-moment';

const Page6 = ({ agencyContract }) => {
  if (!agencyContract) return null;

  const warrantyList = agencyContract.warranty.filter((item) => item.type === 'warranty');

  return (
    <div className="contract-page page-1">
      <div className="text-justify leading-relaxed text-[23px]">
        <h3 className="text-[23px] font-bold"> 9) گزارش پیشرفت طرح</h3>
        <p className="text-[23px]">
          1) متقاضی موظف است گزارش دوره ای طرح خود را در بازههای زمانی ذکر شده در این ماده و گزارش
          پایانی طرح را نیز در تاریخ اتمام طرح و در قالب مورد تأیید عامل، تهیه و از طریق پلتفرم به
          اطلاع سرمایه گذاران برساند. حداقل مفاد لازم جهت ارائه در گزارش های دوره ای و پایانی در
          پیوست های قرارداد، آیین نامه های مصوب عامل و آیین نامههای مصوب شرکت فرابورس ایران مشخص شده
          است
        </p>
        <p className="text-[23px]">
          2) متقاضی موظف است در بخش کیفی هر گزارش، عامل و سرمایه گذاران را از اقدامات انجام شده و
          پیشرفت و تأ خیرات احتمالی طرح و برنامه های آتی آگاه کرده و در صورت وجود تأخیر، آنها را از
          راهکارها ی ارائه شده به جهت مقابله با آن تأخیر مطلع کند.
        </p>
        <p className="text-[23px]">
          3) گزارش دهی یک طرح در هیچ شرایطی به نسبت میزان وجوه تأمینشده نمیتواند از حداقل های زیر
          کمتر باشد: -گزارش دوره ای هر سه ماه یکبار، گزارش سالیانه یا پایانی حسابرسی شده
        </p>
        <p className="text-[23px]">
          4) تأخیر در ارائه گزارشات موضوع بندهای پیشین، در شرایط زیر مشمول خسارات تعیینشده در این
          قرارداد می باشد:
        </p>
        <p className="text-[23px]">
          1- گزارش دوره ای و پایانی در قالب مصوب عامل حداکثر مهلت ۱۰ روز
        </p>
        <p className="text-[23px]">2-گزارش حسابرسی شده حداکثر مهلت ۳۰ روز.</p>

        <p className="text-[23px]">
          5) با ارائه هر گزارش دوره ای صورت مالی با پایانی این گزارش علی ۳ روز کاری به تایید عامل
          رسیده یا حسب مورد ایرادات گزارش به متقاضی اعلام می گردد.
        </p>
        <p className="text-[23px]">
          در صورت اعلام عامل یا ناظر فنی مالی بر عدم پذیرش گزارش متقاضی گزارش اصلاح شده را ظرف مدت ۲
          روز به عامل ارائه نموده و این روند تا زمان اخذ تأیید عامل و حسب مورد ناظر فنی امالی ادامه
          خواهد یافت.
        </p>
        <p className="text-[23px]">
          کلیه بررسی ها و اصلاحات لازم برای گزارشات میبایست در مهلت مقرر در بند پیشین به انجام برسد.
        </p>

        <p className="text-[23px]">
          معیار زمان تحویل گزارش روز ارائه گزارش تایید شده بوده و تاخیر بیش از میزان تعیین شده در
          بند فوق مشمول خسارات مشخص شده خواهد بود.
        </p>
        <p className="text-[23px]">
          <span className="font-bold">تبصره ۱:</span> تأخیر عامل در بررسی و اعلام نظر بیش از زمان
          مشخص شده در این بند به مهلت ارائه گزارش اضافه می شود.
        </p>
        <p className="text-[23px]">
          <span className="font-bold">تبصره ۲:</span> در مورد گزارشات نیازمند حسابرسی رسمی متقاضی
          موظف است همزمان با ارائه گزارش جهت حسابرسی یک نسخه از صورتهای مالی و مستندات ارائه شده به
          حسابرس را به عامل ارائه نماید. همچنین تأیید این گزارشات منوط به ارائه گزارش حسابرسی رسمی
          خواهد بود.
        </p>
        <p className="text-[23px]">
          <span className="font-bold">تبصره ۳:</span> در صورت عدم ارائه گزارش پایانی یا گزارش
          حسابرسی طرح تا پایان مهلتهای مقرر کلیه سودهای پیش بینی شده طرح حال شده فرض گشته و سود پیش
          بینی شده معیار کلیه تسویه حسابها قرار خواهد گرفت در فرض اخیر خسارت عدم ارائه گزارش پایانی
          طرح توسط متقاضی پرداخت خواهد شد.
        </p>

        <p className="text-[23px] font-bold">
          10) متقاضی متعهد است امکان نظارت مستمر عامل و حضور در محل انجام فعالیتهای موضوع قرارداد در
          هر زمان به تشخیص عامل و دسترسی کامل به اطلاعات لازم را فراهم می کند.
        </p>

        <p className="text-[23px]">
          1) با عنایت به آنکه عامل صرفاً از طریق خدمات ارائه شده در بستر پلتفرم مقدمات تأمین مالی
          جمعی متقاضی و سرمایه گذاری را برای تأمین کنندگان فراهم می آورد، لذا هیچگونه مسئولیتی در
          قبال موفقیت کمپین نداشته و در صورت عدم موفقیت کمپین وجوه واریزی از جانب سرمایه گذاران را
          وفق مفاد این قرارداد به آنان مسترد خواهد نمود.
        </p>

        <h3 className="text-[23px] font-bold">10) حدود مسئولیت طرفین</h3>

        <p className="text-[23px]">
          2) با توجه به آنکه مسئولیت پرداخت اقساط خرید دارایی و نیز بازپرداخت سرمایه تماماً بر عهده
          متقاضی میباشد لذا هیچگونه مسئولیتی در این باره متوجه شرکت نبوده و شرکت صرفاً به وکالت از
          سرمایه گذار نسبت به اخذ مبالغ باد شده از متقاضی و واریز به شماره حساب سرمایه گذار، اقدام
          می نماید.
        </p>
        <p className="text-[23px]">
          3) متقاضی با امضای ذیل این قرارداد به صورت غیر قابل برگشت به شرکت اذن در پرداخت اقساط خرید
          دارایی و نیز سرمایه را در مواعد مقرر اعطا نمود. بدیهی است اعطای اذن مذکور هیچگونه تکلیفی
          برای شرکت در خصوص پرداخت ایجاد ننموده و تصمیم گیری در این خصوص تماماً بر عهده شرکت می
          باشد. مقاد بند حاضر، نافی بند ۲ این ماده نبوده و هر گونه تفسیر از این بند که منجر به ایجاد
          مسئولیت در پرداخت برای شرکت گردد. ممنوع است. بدیهی است مفاد این بند تحت هیچ عنوان تجویز
          تأخیر متقاضی در پرداخت بدهی تلقی نخواهد شد و در صورت تأخیر متقاضی ملزم به پرداخت خسارات
          قراردادی، می باشد.
        </p>

        <h3 className="text-[23px] font-bold">11)وثایق و تضامین</h3>
        <p className="text-[23px]">
          به منظور تضمین اجرای هر یک از تعهدات مذکور در این قرارداد از جمله و ته محدود به تعهد
          پرداخت اقساط خرید دارایی و نیز بازپرداخت سرمایه و ارائه گزارش های دوره ای مذکور در ماده ۹
          متقاضی موظف است همزمان با امضای قرارداد نسبت به سپردن وثایق و تضامین به شرح ذیل به عامل
          اقدام نماید.
        </p>
        <h4 className="text-[23px] font-bold">(الف) ضمانت نامه تعهد پرداخت بانکی</h4>
        {warrantyList && (
          <p className="text-[23px]">
            1)متقاضی به منظور تضمین ایفای تعهدات مذکور در این قرارداد از جمله پرداخت اقساط خرید
            دارایی در مواعد پرداخت و نیز بازپرداخت سرمایه در تاریخ اتمام طرح و نهایتاً ظرف مدت
            حداکثر ۱ روز تقویمی از آن تاریخ {warrantyList.length} فقره ضمانت نامه تعهد پرداخت بانکی
            به
            {warrantyList.map((item, index) => (
              <span key={index}>
                {index > 0 && '، '}
                شماره سپام <strong>{item.sepam_id}</strong> به عهده <strong>{item.exporter}</strong>{' '}
                به مبلغ <strong>{item.value.toLocaleString()} ریال</strong> مورخ{' '}
                <strong>{moment(item.date).format('jYYYY/jMM/jDD')}</strong>
              </span>
            ))}
            به شرکت تسلیم خواهد نمود.
          </p>
        )}
        <p className="text-[23px]">
          2) در صورتی که عامل خواهان تمدید مدت ضمانت نامه باشد بایستی درخواست خود را قبل از سررسید
          به متقاضی ارائه نماید. در صورت گذشت مدت ۲ روز کاری از تاریخ درخواست عامل و عدم اقدام
          متقاضی در خصوص تمدید و یا عدم تمدید ضمانت نامه به هر دلیل از جمله عدم همکاری بانک صادر
          کننده ضمانت نامه، عامل مستحق و وکیل در ضبط و وصول تمامی مبلغ ضمانت نامه به نفع خود خواهد
          بود. متقاضی با امضای ذیل قرارداد اجرایی، حق هرگونه اعتراض و ادعا و دعوی حقوقی و کیفری اعم
          از خیانت در امانت، مطالبه خسارت و غیره در این خصوص را از خود سلب و ساقط نمود. بند الف:
          سررسید ضمانت‌نامه تعهد پرداخت صادر شده بابت ضمانت اصل مبلغ تأمین مالی، باید حداقل سه روز
          کاری پس از موعد پرداخت اصل مبلغ تأمین مالیِ مندرج در جدول بند 1 مادۀ 5 قرارداد اقدامات
          اجرایی و ماده 11 قرارداد تامین مالی جمعی (مشارکت) باشد، در صورتیکه موعد سررسید ضمانت‌نامه
          صادر شده پیش از موعد مقرر در جدول بند 1 مادۀ 5 قرارداد اقدامات اجرایی و ماده 11 قرارداد
          تامین مالی جمعی (مشارکت) باشد، عامل رأسا به وکالت یا با اعلام و تقاضا به متقاضی نسبت به
          تمدید ضمانت‌نامه اقدام می‌نماید و در صورتیکه شرایط تمدید توسط متقاضی فراهم نشود یا بانک
          نتواند ضمانت‌نامه را تمدید کند یا به هر دلیل دیگری ضمانت نامه تمدید نگردد، عامل در همان
          تاریخ مندرج در ضمانت نامه، کل وجه را از بانک مطالبه نموده و دریافت می‌نماید و متقاضی حق
          هرگونه ادعا یا اعتراض و دعوای حقوقی و کیفری اعم از خیانت در امانت، مطالبه خسارت و غیره را
          از خود سلب و ساقط نمود.
        </p>
      </div>
    </div>
  );
};

Page6.propTypes = {
  agencyContract: PropTypes.object.isRequired,
};

export default Page6;
