import React from 'react';
import { PropTypes } from 'prop-types';

const Page8 = ({ agencyContract }) => {
  if (!agencyContract) return null;

  return (
    <div className="contract-page page-1">
      <div className="text-justify leading-relaxed text-[23px]">
        <h3 className="text-[23px] font-bold">13) منع واگذاری</h3>
        <p className="text-[23px]">
          1) این قرارداد قائم به شخص بوده و متقاضی به هیچ نحو حق انتقال با واگذاری موضوع آن را به
          شخص با اشخاص ثالث نخواهد داشت.
        </p>
        <p className="text-[23px]">
          2) سرمایه اعطا شده در قالب این قرارداد غیر قابل فروش و نقل و انتقال بوده و متقاضی مجاز به
          انتقال و با فروش سرمایه به اشخاص ثالث نمی باشد.
        </p>
        <p className="text-[23px]">
          3) متقاضی مکلف است حداقل ۱۰ درصد سرمایه مورد نیاز را اصالتاً تأمین و پرداخت نماید و در این
          خصوص، حق اخذ وام، فرض و سایر تسهیلات را ندارد.
        </p>
        <p className="text-[23px]">
          4) متقاضی حق واگذاری دارایی های خریداری شده به غیر را ندارد و در این خصوص ملزم به رعایت
          مفاد وکالت فروش می باشد.
        </p>
        <h3 className="text-[23px] font-bold">14) اظهارات و اقاریر</h3>
        <h4 className="text-[23px] font-bold">الف) متقاضی به سایر طرف ها اظهار می نماید که:</h4>
        <p className="text-[23px]">
          1) با آگاهی کامل از مفاد قرارداد و رویه اجرایی آن نسبت به امضای قرارداد اقدام نموده است.
        </p>
        <p className="text-[23px]">
          2) برای انعقاد قرارداد حاضر و اجرای آن با ممنوعیت و محدودیتی مواجه نبوده و از زیر ساخت های
          فنی و قانونی مورد نیاز برای انجام موضوع قرار داد، برخوردار می باشد.
        </p>
        <p className="text-[23px]">
          3) دارایی های مورد نیاز را تماماً از فروشندگان مجاز خریداری نموده و در صورت اثبات خلاف این
          امر در هر زمان و به هر نحو مسئول پرداخت خسارات تعیین شده خواهد بود.
        </p>
        <p className="text-[23px]">
          4) در اجرای موضوع این قرارداد الزامات ناشی از مصوبات کارگروه ارزیابی در خصوص سقف تأمین
          مالی جمعی برای متقاضی و اشخاص وابسته به متقاضی را رعایت نموده و تمامی اطلاعات ضروری در این
          خصوص را به عامل ارائه نموده است.
        </p>
        <p className="text-[23px]">
          5) برای تامین مالی طرح موضوع این قرارداد به طور همزمان در پلتفرم دیگری اقدام نکرده است.
        </p>
        <p className="text-[23px]">
          6) با آگاهی کامل از موضوع این قرارداد نسبت به خرید داراییهای مورد نیاز و سپس انتقال دارایی
          های خریداری شده به خود اقدام می نماید.
        </p>
        <p className="text-[23px]">
          7) نسبت به قیمت خرید و فروش دارایی آگاهی و اطلاع کامل داشته و ضمن پذیرش مبلغ اقساط خرید
          دارایی به عنوان بدهی خود، حق هرگونه ادعای عین فاحش با افحش را از خود سلب و ساقط می نماید؛
        </p>
        <p className="text-[23px]">
          8) از زمره دستگاههای اجرایی موضوع ماده ۵ قانون مدیریت خدمات کشوری بانک یا مؤسسه مالی و
          اعتباری نهاد مالی دارای مجوز از سازمان بورس و اوراق بهار دار شرکت پذیرفته شده در بورس و
          بازار اول و دوم فرابورس با شرکت درج شده در بازار پایه فرابورس و همچنین مشمول هیچ یک از
          دیگر ممنوعیت های مندرج در دستور العمل نیز نمی باشد.
        </p>
        <p className="text-[23px]">
          9) تحت هیچ عنوان از موضوع این قرارداد با انتشار فراخوان جمع آوری در پلتفرم جهت امور
          تبلیغاتی و کسب درآمد استفاده ننموده و آن را دستاویر کسب اعتبار خود قرار نمی دهد.
        </p>
        <p className="text-[23px]">
          10) مسئولیت پرداخت اقساط خرید دارایی و نیز بازپرداخت سرمایه در موعد مقرر بر عهده وی بوده و
          از این بابت هیچگونه مسئولیتی متوجه عامل نمی باشد.
        </p>
        <p className="text-[23px]">
          11) موضوع فعالیت وی حقوق مادی و معنوی اشخاص ثالث را نقض ننموده و هیچگونه دعاوی مؤثر و با
          اهمیت حقوقی با کیفری علیه شرکت و اعضای هیئت مدیره با مدیر عامل شرکت وجود ندارد
        </p>
        <p className="text-[23px]">
          12) مسئولیت کلبه خسارات و ضرر و زبان وارده در نتیجه با در رابطه با عدم صحت اظهارات و ضمانت
          های مقرر در این قرارداد را جبران نماید. این خسارت حداقل به میزان ۱۲۰ درصد سرمایه می باشد.
        </p>
        <h3 className="text-[23px] font-bold">ب) عامل به سایر طرف ها اظهار می نماید که:</h3>
        <p className="text-[23px]">
          1) از صلاحیت و اهلیت قانونی لازم جهت امضای این قرارداد و ایفای تعهدات آن برخوردار می باشد
        </p>
        <p className="text-[23px]">
          ۲) با رعایت شرایط و ضوابط مذکور در این قرارداد و وفق مقررات استفاده از پلتفرم، مقدمات
          تأمین مالی جمعی را فراهم می آورد.{' '}
        </p>
        <h3 className="text-[23px] font-bold">ج) سرمایه گذار به سایر طرف ها اظهار می نماید که:</h3>
        <p className="text-[23px]">
          1) با تایید الکترونیکی قوانین و مقررات و بیانیه ریسک مندرج در پلتفرم کلیه اختیارات و حقوق
          مربوط به پیگیری اداری و قضایی جهت مطالبات مربوط به این قرارداد را وفق مفاد مندرج در
          وکالتنامه به عامل منتقل نموده و عامل را جهت هرگونه اقدام قضایی اداری و اجرایی جهت وصول
          مطالبات اعم از اصل مبلغ سرمایه گذاری اقساط خرید دارایی خسارات وارده و سایر هزینه های
          مربوطه نماینده و وکیل خود قرار داده است.
        </p>
        <p className="text-[23px]">
          2) ضمن آگاهی کامل از ماهیت ریسک و مخاطرات سرمایه گذاری در زمینه طرح موضوع این قرارداد از
          رویه اجرایی قرارداد و نیز ضوابط استفاده از خدمات پلتفرم اطلاع کامل داشته و هیچ امر مجهول و
          با مبهمی برای وی وجود ندارد؛
        </p>
        <p className="text-[23px]">
          3) ضمن برخورداری از صلاحیت و اهلیت قانونی لازم جهت امضای این قرارداد و ایفای تعهدات مندرج
          در آن برای سرمایه گذاری در طرح با هیچگونه محدودیت و ممنوعیت قانونی مواجه نبوده و با رعایت
          قوانین و مقررات لازم الاجرا از جمله قانون مبارزه با تأمین مالی تروریسم و پولشویی نسبت به
          انعقاد قرارداد حاضر اقدام نموده است.
        </p>
        <p className="text-[23px]">
          4) اطلاعات کاربری و شماره حساب ثبت شده در حساب کاربری او در پلتفرم متعلق به وی بوده و کلیه
          پرداختهای موضوع این قرارداد به همان حساب واریز و مسئولیت وقوع هرگونه اشتباه از این بابت را
          شخصاً بر عهده گرفته و هیچگونه مسئولیتی متوجه عامل و متقاضی، نمی باشد.
        </p>
        <p className="text-[23px]">
          5) تا تاریخ اتمام طرح، حق مطالبه مبلغ سرمایه گذاری را نداشته و مبلغ یاد شده، صرفاً در
          تاریخ اتمام طرح و پس از واریز توسط متقاضی، توسط عامل به شماره حساب وی واریز می گردد؛
        </p>
        <p className="text-[23px]">
          6) پرداخت های موضوع این قرارداد بر عهده بانک و درگاه مربوطه است. لذا در صورت بروز مشکل در
          پرداخت از جانب بانک مبلغ پرداختی از طریق درگاه مورد استفاده به حساب مبداً عودت داده خواهد
          شد.
        </p>
        <h3 className="text-[23px] font-bold">15) خاتمه قرارداد </h3>
        <p className="text-[23px]">
          1) قرارداد حاضر در زمره عقود لازم بوده و جز در موارد مذکور در این قرارداد، منحل نخواهد شد.{' '}
        </p>
        <p className="text-[23px]">
          خرید دارایی های مورد نیاز به استناد وکالت خرید و نیز انتقال دارایی های خریداری شده به
          متقاضی به استناد وکالت فروش هر دو با علم و آگاهی کامل متقاضی نسبت به قیمت خرید و فروش و
          سایر شرایط معامله واقع شده و مقاضی تحت هیچ عنوان از قبیل ادعای عین فاحش و افحش، حق فسخ آن
          را نخواهد داشت.
        </p>
        <p className="text-[23px]">
          <span className="font-bold">تبصره ۱:</span> در صورت فسخ این قرارداد در موارد تعیین شده
          متقاضی موظف است ظرف مدت حداکثر ۲ روز کاری از تاریخ اعلام فسخ نسبت به بازپرداخت سرمایه به
          عامل اقدام نماید. در غیر این صورت مشمول خسارات تعیین شده در ماده ۱۲ بوده و شرکت مستحق در
          وصول مطالبات خود از محل هر یک از تضامین مذکور در این قرارداد خواهد بود.
        </p>
        <p className="text-[23px]">
          <span className="font-bold">تبصره ۲:</span> در موارد فسخ این قرارداد حق الزحمه های موضوع
          ماده ۵ به متقاضی مسترد نخواهد شد.
        </p>
      </div>
    </div>
  );
};

Page8.propTypes = {
  agencyContract: PropTypes.object.isRequired,
};

export default Page8;
